var cityData=[
  {
    "Code": "110000",
    "Name": "北京",
    "level": [
      {
        "Code": "110100",
        "Name": "北京市",
        "level": [
          {
            "Code": "110101",
            "Name": "东城区"
          },
          {
            "Code": "110102",
            "Name": "西城区"
          },
          {
            "Code": "110105",
            "Name": "朝阳区"
          },
          {
            "Code": "110106",
            "Name": "丰台区"
          },
          {
            "Code": "110107",
            "Name": "石景山区"
          },
          {
            "Code": "110108",
            "Name": "海淀区"
          },
          {
            "Code": "110109",
            "Name": "门头沟区"
          },
          {
            "Code": "110111",
            "Name": "房山区"
          },
          {
            "Code": "110112",
            "Name": "通州区"
          },
          {
            "Code": "110113",
            "Name": "顺义区"
          },
          {
            "Code": "110114",
            "Name": "昌平区"
          },
          {
            "Code": "110115",
            "Name": "大兴区"
          },
          {
            "Code": "110116",
            "Name": "怀柔区"
          },
          {
            "Code": "110117",
            "Name": "平谷区"
          },
          {
            "Code": "110228",
            "Name": "密云县"
          },
          {
            "Code": "110229",
            "Name": "延庆县"
          }
        ]
      }
    ]
  },
  {
    "Code": "120000",
    "Name": "天津",
    "level": [
      {
        "Code": "120100",
        "Name": "天津市",
        "level": [
          {
            "Code": "120101",
            "Name": "和平区"
          },
          {
            "Code": "120102",
            "Name": "河东区"
          },
          {
            "Code": "120103",
            "Name": "河西区"
          },
          {
            "Code": "120104",
            "Name": "南开区"
          },
          {
            "Code": "120105",
            "Name": "河北区"
          },
          {
            "Code": "120106",
            "Name": "红桥区"
          },
          {
            "Code": "120110",
            "Name": "东丽区"
          },
          {
            "Code": "120111",
            "Name": "西青区"
          },
          {
            "Code": "120112",
            "Name": "津南区"
          },
          {
            "Code": "120113",
            "Name": "北辰区"
          },
          {
            "Code": "120114",
            "Name": "武清区"
          },
          {
            "Code": "120115",
            "Name": "宝坻区"
          },
          {
            "Code": "120116",
            "Name": "滨海新区"
          },
          {
            "Code": "120221",
            "Name": "宁河县"
          },
          {
            "Code": "120223",
            "Name": "静海县"
          },
          {
            "Code": "120225",
            "Name": "蓟县"
          }
        ]
      }
    ]
  },
  {
    "Code": "130000",
    "Name": "河北省",
    "level": [
      {
        "Code": "130100",
        "Name": "石家庄市",
        "level": [
          {
            "Code": "130102",
            "Name": "长安区"
          },
          {
            "Code": "130103",
            "Name": "桥东区"
          },
          {
            "Code": "130104",
            "Name": "桥西区"
          },
          {
            "Code": "130105",
            "Name": "新华区"
          },
          {
            "Code": "130107",
            "Name": "井陉矿区"
          },
          {
            "Code": "130108",
            "Name": "裕华区"
          },
          {
            "Code": "130121",
            "Name": "井陉县"
          },
          {
            "Code": "130123",
            "Name": "正定县"
          },
          {
            "Code": "130124",
            "Name": "栾城县"
          },
          {
            "Code": "130125",
            "Name": "行唐县"
          },
          {
            "Code": "130126",
            "Name": "灵寿县"
          },
          {
            "Code": "130127",
            "Name": "高邑县"
          },
          {
            "Code": "130128",
            "Name": "深泽县"
          },
          {
            "Code": "130129",
            "Name": "赞皇县"
          },
          {
            "Code": "130130",
            "Name": "无极县"
          },
          {
            "Code": "130131",
            "Name": "平山县"
          },
          {
            "Code": "130132",
            "Name": "元氏县"
          },
          {
            "Code": "130133",
            "Name": "赵县"
          },
          {
            "Code": "130181",
            "Name": "辛集市"
          },
          {
            "Code": "130182",
            "Name": "藁城市"
          },
          {
            "Code": "130183",
            "Name": "晋州市"
          },
          {
            "Code": "130184",
            "Name": "新乐市"
          },
          {
            "Code": "130185",
            "Name": "鹿泉市"
          }
        ]
      },
      {
        "Code": "130200",
        "Name": "唐山市",
        "level": [
          {
            "Code": "130202",
            "Name": "路南区"
          },
          {
            "Code": "130203",
            "Name": "路北区"
          },
          {
            "Code": "130204",
            "Name": "古冶区"
          },
          {
            "Code": "130205",
            "Name": "开平区"
          },
          {
            "Code": "130207",
            "Name": "丰南区"
          },
          {
            "Code": "130208",
            "Name": "丰润区"
          },
          {
            "Code": "130223",
            "Name": "滦县"
          },
          {
            "Code": "130224",
            "Name": "滦南县"
          },
          {
            "Code": "130225",
            "Name": "乐亭县"
          },
          {
            "Code": "130227",
            "Name": "迁西县"
          },
          {
            "Code": "130229",
            "Name": "玉田县"
          },
          {
            "Code": "130230",
            "Name": "曹妃甸区"
          },
          {
            "Code": "130281",
            "Name": "遵化市"
          },
          {
            "Code": "130283",
            "Name": "迁安市"
          }
        ]
      },
      {
        "Code": "130300",
        "Name": "秦皇岛市",
        "level": [
          {
            "Code": "130302",
            "Name": "海港区"
          },
          {
            "Code": "130303",
            "Name": "山海关区"
          },
          {
            "Code": "130304",
            "Name": "北戴河区"
          },
          {
            "Code": "130321",
            "Name": "青龙满族自治县"
          },
          {
            "Code": "130322",
            "Name": "昌黎县"
          },
          {
            "Code": "130323",
            "Name": "抚宁县"
          },
          {
            "Code": "130324",
            "Name": "卢龙县"
          }
        ]
      },
      {
        "Code": "130400",
        "Name": "邯郸市",
        "level": [
          {
            "Code": "130402",
            "Name": "邯山区"
          },
          {
            "Code": "130403",
            "Name": "丛台区"
          },
          {
            "Code": "130404",
            "Name": "复兴区"
          },
          {
            "Code": "130406",
            "Name": "峰峰矿区"
          },
          {
            "Code": "130421",
            "Name": "邯郸县"
          },
          {
            "Code": "130423",
            "Name": "临漳县"
          },
          {
            "Code": "130424",
            "Name": "成安县"
          },
          {
            "Code": "130425",
            "Name": "大名县"
          },
          {
            "Code": "130426",
            "Name": "涉县"
          },
          {
            "Code": "130427",
            "Name": "磁县"
          },
          {
            "Code": "130428",
            "Name": "肥乡县"
          },
          {
            "Code": "130429",
            "Name": "永年县"
          },
          {
            "Code": "130430",
            "Name": "邱县"
          },
          {
            "Code": "130431",
            "Name": "鸡泽县"
          },
          {
            "Code": "130432",
            "Name": "广平县"
          },
          {
            "Code": "130433",
            "Name": "馆陶县"
          },
          {
            "Code": "130434",
            "Name": "魏县"
          },
          {
            "Code": "130435",
            "Name": "曲周县"
          },
          {
            "Code": "130481",
            "Name": "武安市"
          }
        ]
      },
      {
        "Code": "130500",
        "Name": "邢台市",
        "level": [
          {
            "Code": "130502",
            "Name": "桥东区"
          },
          {
            "Code": "130503",
            "Name": "桥西区"
          },
          {
            "Code": "130521",
            "Name": "邢台县"
          },
          {
            "Code": "130522",
            "Name": "临城县"
          },
          {
            "Code": "130523",
            "Name": "内丘县"
          },
          {
            "Code": "130524",
            "Name": "柏乡县"
          },
          {
            "Code": "130525",
            "Name": "隆尧县"
          },
          {
            "Code": "130526",
            "Name": "任县"
          },
          {
            "Code": "130527",
            "Name": "南和县"
          },
          {
            "Code": "130528",
            "Name": "宁晋县"
          },
          {
            "Code": "130529",
            "Name": "巨鹿县"
          },
          {
            "Code": "130530",
            "Name": "新河县"
          },
          {
            "Code": "130531",
            "Name": "广宗县"
          },
          {
            "Code": "130532",
            "Name": "平乡县"
          },
          {
            "Code": "130533",
            "Name": "威县"
          },
          {
            "Code": "130534",
            "Name": "清河县"
          },
          {
            "Code": "130535",
            "Name": "临西县"
          },
          {
            "Code": "130581",
            "Name": "南宫市"
          },
          {
            "Code": "130582",
            "Name": "沙河市"
          }
        ]
      },
      {
        "Code": "130600",
        "Name": "保定市",
        "level": [
          {
            "Code": "130602",
            "Name": "新市区"
          },
          {
            "Code": "130603",
            "Name": "北市区"
          },
          {
            "Code": "130604",
            "Name": "南市区"
          },
          {
            "Code": "130621",
            "Name": "满城县"
          },
          {
            "Code": "130622",
            "Name": "清苑县"
          },
          {
            "Code": "130623",
            "Name": "涞水县"
          },
          {
            "Code": "130624",
            "Name": "阜平县"
          },
          {
            "Code": "130625",
            "Name": "徐水县"
          },
          {
            "Code": "130626",
            "Name": "定兴县"
          },
          {
            "Code": "130627",
            "Name": "唐县"
          },
          {
            "Code": "130628",
            "Name": "高阳县"
          },
          {
            "Code": "130629",
            "Name": "容城县"
          },
          {
            "Code": "130630",
            "Name": "涞源县"
          },
          {
            "Code": "130631",
            "Name": "望都县"
          },
          {
            "Code": "130632",
            "Name": "安新县"
          },
          {
            "Code": "130633",
            "Name": "易县"
          },
          {
            "Code": "130634",
            "Name": "曲阳县"
          },
          {
            "Code": "130635",
            "Name": "蠡县"
          },
          {
            "Code": "130636",
            "Name": "顺平县"
          },
          {
            "Code": "130637",
            "Name": "博野县"
          },
          {
            "Code": "130638",
            "Name": "雄县"
          },
          {
            "Code": "130681",
            "Name": "涿州市"
          },
          {
            "Code": "130682",
            "Name": "定州市"
          },
          {
            "Code": "130683",
            "Name": "安国市"
          },
          {
            "Code": "130684",
            "Name": "高碑店市"
          }
        ]
      },
      {
        "Code": "130700",
        "Name": "张家口市",
        "level": [
          {
            "Code": "130702",
            "Name": "桥东区"
          },
          {
            "Code": "130703",
            "Name": "桥西区"
          },
          {
            "Code": "130705",
            "Name": "宣化区"
          },
          {
            "Code": "130706",
            "Name": "下花园区"
          },
          {
            "Code": "130721",
            "Name": "宣化县"
          },
          {
            "Code": "130722",
            "Name": "张北县"
          },
          {
            "Code": "130723",
            "Name": "康保县"
          },
          {
            "Code": "130724",
            "Name": "沽源县"
          },
          {
            "Code": "130725",
            "Name": "尚义县"
          },
          {
            "Code": "130726",
            "Name": "蔚县"
          },
          {
            "Code": "130727",
            "Name": "阳原县"
          },
          {
            "Code": "130728",
            "Name": "怀安县"
          },
          {
            "Code": "130729",
            "Name": "万全县"
          },
          {
            "Code": "130730",
            "Name": "怀来县"
          },
          {
            "Code": "130731",
            "Name": "涿鹿县"
          },
          {
            "Code": "130732",
            "Name": "赤城县"
          },
          {
            "Code": "130733",
            "Name": "崇礼县"
          }
        ]
      },
      {
        "Code": "130800",
        "Name": "承德市",
        "level": [
          {
            "Code": "130802",
            "Name": "双桥区"
          },
          {
            "Code": "130803",
            "Name": "双滦区"
          },
          {
            "Code": "130804",
            "Name": "鹰手营子矿区"
          },
          {
            "Code": "130821",
            "Name": "承德县"
          },
          {
            "Code": "130822",
            "Name": "兴隆县"
          },
          {
            "Code": "130823",
            "Name": "平泉县"
          },
          {
            "Code": "130824",
            "Name": "滦平县"
          },
          {
            "Code": "130825",
            "Name": "隆化县"
          },
          {
            "Code": "130826",
            "Name": "丰宁满族自治县"
          },
          {
            "Code": "130827",
            "Name": "宽城满族自治县"
          },
          {
            "Code": "130828",
            "Name": "围场满族蒙古族自治县"
          }
        ]
      },
      {
        "Code": "130900",
        "Name": "沧州市",
        "level": [
          {
            "Code": "130902",
            "Name": "新华区"
          },
          {
            "Code": "130903",
            "Name": "运河区"
          },
          {
            "Code": "130921",
            "Name": "沧县"
          },
          {
            "Code": "130922",
            "Name": "青县"
          },
          {
            "Code": "130923",
            "Name": "东光县"
          },
          {
            "Code": "130924",
            "Name": "海兴县"
          },
          {
            "Code": "130925",
            "Name": "盐山县"
          },
          {
            "Code": "130926",
            "Name": "肃宁县"
          },
          {
            "Code": "130927",
            "Name": "南皮县"
          },
          {
            "Code": "130928",
            "Name": "吴桥县"
          },
          {
            "Code": "130929",
            "Name": "献县"
          },
          {
            "Code": "130930",
            "Name": "孟村回族自治县"
          },
          {
            "Code": "130981",
            "Name": "泊头市"
          },
          {
            "Code": "130982",
            "Name": "任丘市"
          },
          {
            "Code": "130983",
            "Name": "黄骅市"
          },
          {
            "Code": "130984",
            "Name": "河间市"
          }
        ]
      },
      {
        "Code": "131000",
        "Name": "廊坊市",
        "level": [
          {
            "Code": "131002",
            "Name": "安次区"
          },
          {
            "Code": "131003",
            "Name": "广阳区"
          },
          {
            "Code": "131022",
            "Name": "固安县"
          },
          {
            "Code": "131023",
            "Name": "永清县"
          },
          {
            "Code": "131024",
            "Name": "香河县"
          },
          {
            "Code": "131025",
            "Name": "大城县"
          },
          {
            "Code": "131026",
            "Name": "文安县"
          },
          {
            "Code": "131028",
            "Name": "大厂回族自治县"
          },
          {
            "Code": "131081",
            "Name": "霸州市"
          },
          {
            "Code": "131082",
            "Name": "三河市"
          }
        ]
      },
      {
        "Code": "131100",
        "Name": "衡水市",
        "level": [
          {
            "Code": "131102",
            "Name": "桃城区"
          },
          {
            "Code": "131121",
            "Name": "枣强县"
          },
          {
            "Code": "131122",
            "Name": "武邑县"
          },
          {
            "Code": "131123",
            "Name": "武强县"
          },
          {
            "Code": "131124",
            "Name": "饶阳县"
          },
          {
            "Code": "131125",
            "Name": "安平县"
          },
          {
            "Code": "131126",
            "Name": "故城县"
          },
          {
            "Code": "131127",
            "Name": "景县"
          },
          {
            "Code": "131128",
            "Name": "阜城县"
          },
          {
            "Code": "131181",
            "Name": "冀州市"
          },
          {
            "Code": "131182",
            "Name": "深州市"
          }
        ]
      }
    ]
  },
  {
    "Code": "140000",
    "Name": "山西省",
    "level": [
      {
        "Code": "140100",
        "Name": "太原市",
        "level": [
          {
            "Code": "140105",
            "Name": "小店区"
          },
          {
            "Code": "140106",
            "Name": "迎泽区"
          },
          {
            "Code": "140107",
            "Name": "杏花岭区"
          },
          {
            "Code": "140108",
            "Name": "尖草坪区"
          },
          {
            "Code": "140109",
            "Name": "万柏林区"
          },
          {
            "Code": "140110",
            "Name": "晋源区"
          },
          {
            "Code": "140121",
            "Name": "清徐县"
          },
          {
            "Code": "140122",
            "Name": "阳曲县"
          },
          {
            "Code": "140123",
            "Name": "娄烦县"
          },
          {
            "Code": "140181",
            "Name": "古交市"
          }
        ]
      },
      {
        "Code": "140200",
        "Name": "大同市",
        "level": [
          {
            "Code": "140202",
            "Name": "城区"
          },
          {
            "Code": "140203",
            "Name": "矿区"
          },
          {
            "Code": "140211",
            "Name": "南郊区"
          },
          {
            "Code": "140212",
            "Name": "新荣区"
          },
          {
            "Code": "140221",
            "Name": "阳高县"
          },
          {
            "Code": "140222",
            "Name": "天镇县"
          },
          {
            "Code": "140223",
            "Name": "广灵县"
          },
          {
            "Code": "140224",
            "Name": "灵丘县"
          },
          {
            "Code": "140225",
            "Name": "浑源县"
          },
          {
            "Code": "140226",
            "Name": "左云县"
          },
          {
            "Code": "140227",
            "Name": "大同县"
          }
        ]
      },
      {
        "Code": "140300",
        "Name": "阳泉市",
        "level": [
          {
            "Code": "140302",
            "Name": "城区"
          },
          {
            "Code": "140303",
            "Name": "矿区"
          },
          {
            "Code": "140311",
            "Name": "郊区"
          },
          {
            "Code": "140321",
            "Name": "平定县"
          },
          {
            "Code": "140322",
            "Name": "盂县"
          }
        ]
      },
      {
        "Code": "140400",
        "Name": "长治市",
        "level": [
          {
            "Code": "140421",
            "Name": "长治县"
          },
          {
            "Code": "140423",
            "Name": "襄垣县"
          },
          {
            "Code": "140424",
            "Name": "屯留县"
          },
          {
            "Code": "140425",
            "Name": "平顺县"
          },
          {
            "Code": "140426",
            "Name": "黎城县"
          },
          {
            "Code": "140427",
            "Name": "壶关县"
          },
          {
            "Code": "140428",
            "Name": "长子县"
          },
          {
            "Code": "140429",
            "Name": "武乡县"
          },
          {
            "Code": "140430",
            "Name": "沁县"
          },
          {
            "Code": "140431",
            "Name": "沁源县"
          },
          {
            "Code": "140481",
            "Name": "潞城市"
          },
          {
            "Code": "140482",
            "Name": "城区"
          },
          {
            "Code": "140483",
            "Name": "郊区"
          }
        ]
      },
      {
        "Code": "140500",
        "Name": "晋城市",
        "level": [
          {
            "Code": "140502",
            "Name": "城区"
          },
          {
            "Code": "140521",
            "Name": "沁水县"
          },
          {
            "Code": "140522",
            "Name": "阳城县"
          },
          {
            "Code": "140524",
            "Name": "陵川县"
          },
          {
            "Code": "140525",
            "Name": "泽州县"
          },
          {
            "Code": "140581",
            "Name": "高平市"
          }
        ]
      },
      {
        "Code": "140600",
        "Name": "朔州市",
        "level": [
          {
            "Code": "140602",
            "Name": "朔城区"
          },
          {
            "Code": "140603",
            "Name": "平鲁区"
          },
          {
            "Code": "140621",
            "Name": "山阴县"
          },
          {
            "Code": "140622",
            "Name": "应县"
          },
          {
            "Code": "140623",
            "Name": "右玉县"
          },
          {
            "Code": "140624",
            "Name": "怀仁县"
          }
        ]
      },
      {
        "Code": "140700",
        "Name": "晋中市",
        "level": [
          {
            "Code": "140702",
            "Name": "榆次区"
          },
          {
            "Code": "140721",
            "Name": "榆社县"
          },
          {
            "Code": "140722",
            "Name": "左权县"
          },
          {
            "Code": "140723",
            "Name": "和顺县"
          },
          {
            "Code": "140724",
            "Name": "昔阳县"
          },
          {
            "Code": "140725",
            "Name": "寿阳县"
          },
          {
            "Code": "140726",
            "Name": "太谷县"
          },
          {
            "Code": "140727",
            "Name": "祁县"
          },
          {
            "Code": "140728",
            "Name": "平遥县"
          },
          {
            "Code": "140729",
            "Name": "灵石县"
          },
          {
            "Code": "140781",
            "Name": "介休市"
          }
        ]
      },
      {
        "Code": "140800",
        "Name": "运城市",
        "level": [
          {
            "Code": "140802",
            "Name": "盐湖区"
          },
          {
            "Code": "140821",
            "Name": "临猗县"
          },
          {
            "Code": "140822",
            "Name": "万荣县"
          },
          {
            "Code": "140823",
            "Name": "闻喜县"
          },
          {
            "Code": "140824",
            "Name": "稷山县"
          },
          {
            "Code": "140825",
            "Name": "新绛县"
          },
          {
            "Code": "140826",
            "Name": "绛县"
          },
          {
            "Code": "140827",
            "Name": "垣曲县"
          },
          {
            "Code": "140828",
            "Name": "夏县"
          },
          {
            "Code": "140829",
            "Name": "平陆县"
          },
          {
            "Code": "140830",
            "Name": "芮城县"
          },
          {
            "Code": "140881",
            "Name": "永济市"
          },
          {
            "Code": "140882",
            "Name": "河津市"
          }
        ]
      },
      {
        "Code": "140900",
        "Name": "忻州市",
        "level": [
          {
            "Code": "140902",
            "Name": "忻府区"
          },
          {
            "Code": "140921",
            "Name": "定襄县"
          },
          {
            "Code": "140922",
            "Name": "五台县"
          },
          {
            "Code": "140923",
            "Name": "代县"
          },
          {
            "Code": "140924",
            "Name": "繁峙县"
          },
          {
            "Code": "140925",
            "Name": "宁武县"
          },
          {
            "Code": "140926",
            "Name": "静乐县"
          },
          {
            "Code": "140927",
            "Name": "神池县"
          },
          {
            "Code": "140928",
            "Name": "五寨县"
          },
          {
            "Code": "140929",
            "Name": "岢岚县"
          },
          {
            "Code": "140930",
            "Name": "河曲县"
          },
          {
            "Code": "140931",
            "Name": "保德县"
          },
          {
            "Code": "140932",
            "Name": "偏关县"
          },
          {
            "Code": "140981",
            "Name": "原平市"
          }
        ]
      },
      {
        "Code": "141000",
        "Name": "临汾市",
        "level": [
          {
            "Code": "141002",
            "Name": "尧都区"
          },
          {
            "Code": "141021",
            "Name": "曲沃县"
          },
          {
            "Code": "141022",
            "Name": "翼城县"
          },
          {
            "Code": "141023",
            "Name": "襄汾县"
          },
          {
            "Code": "141024",
            "Name": "洪洞县"
          },
          {
            "Code": "141025",
            "Name": "古县"
          },
          {
            "Code": "141026",
            "Name": "安泽县"
          },
          {
            "Code": "141027",
            "Name": "浮山县"
          },
          {
            "Code": "141028",
            "Name": "吉县"
          },
          {
            "Code": "141029",
            "Name": "乡宁县"
          },
          {
            "Code": "141030",
            "Name": "大宁县"
          },
          {
            "Code": "141031",
            "Name": "隰县"
          },
          {
            "Code": "141032",
            "Name": "永和县"
          },
          {
            "Code": "141033",
            "Name": "蒲县"
          },
          {
            "Code": "141034",
            "Name": "汾西县"
          },
          {
            "Code": "141081",
            "Name": "侯马市"
          },
          {
            "Code": "141082",
            "Name": "霍州市"
          }
        ]
      },
      {
        "Code": "141100",
        "Name": "吕梁市",
        "level": [
          {
            "Code": "141102",
            "Name": "离石区"
          },
          {
            "Code": "141121",
            "Name": "文水县"
          },
          {
            "Code": "141122",
            "Name": "交城县"
          },
          {
            "Code": "141123",
            "Name": "兴县"
          },
          {
            "Code": "141124",
            "Name": "临县"
          },
          {
            "Code": "141125",
            "Name": "柳林县"
          },
          {
            "Code": "141126",
            "Name": "石楼县"
          },
          {
            "Code": "141127",
            "Name": "岚县"
          },
          {
            "Code": "141128",
            "Name": "方山县"
          },
          {
            "Code": "141129",
            "Name": "中阳县"
          },
          {
            "Code": "141130",
            "Name": "交口县"
          },
          {
            "Code": "141181",
            "Name": "孝义市"
          },
          {
            "Code": "141182",
            "Name": "汾阳市"
          }
        ]
      }
    ]
  },
  {
    "Code": "150000",
    "Name": "内蒙古自治区",
    "level": [
      {
        "Code": "150100",
        "Name": "呼和浩特市",
        "level": [
          {
            "Code": "150102",
            "Name": "新城区"
          },
          {
            "Code": "150103",
            "Name": "回民区"
          },
          {
            "Code": "150104",
            "Name": "玉泉区"
          },
          {
            "Code": "150105",
            "Name": "赛罕区"
          },
          {
            "Code": "150121",
            "Name": "土默特左旗"
          },
          {
            "Code": "150122",
            "Name": "托克托县"
          },
          {
            "Code": "150123",
            "Name": "和林格尔县"
          },
          {
            "Code": "150124",
            "Name": "清水河县"
          },
          {
            "Code": "150125",
            "Name": "武川县"
          }
        ]
      },
      {
        "Code": "150200",
        "Name": "包头市",
        "level": [
          {
            "Code": "150202",
            "Name": "东河区"
          },
          {
            "Code": "150203",
            "Name": "昆都仑区"
          },
          {
            "Code": "150204",
            "Name": "青山区"
          },
          {
            "Code": "150205",
            "Name": "石拐区"
          },
          {
            "Code": "150206",
            "Name": "白云鄂博矿区"
          },
          {
            "Code": "150207",
            "Name": "九原区"
          },
          {
            "Code": "150221",
            "Name": "土默特右旗"
          },
          {
            "Code": "150222",
            "Name": "固阳县"
          },
          {
            "Code": "150223",
            "Name": "达尔罕茂明安联合旗"
          }
        ]
      },
      {
        "Code": "150300",
        "Name": "乌海市",
        "level": [
          {
            "Code": "150302",
            "Name": "海勃湾区"
          },
          {
            "Code": "150303",
            "Name": "海南区"
          },
          {
            "Code": "150304",
            "Name": "乌达区"
          }
        ]
      },
      {
        "Code": "150400",
        "Name": "赤峰市",
        "level": [
          {
            "Code": "150402",
            "Name": "红山区"
          },
          {
            "Code": "150403",
            "Name": "元宝山区"
          },
          {
            "Code": "150404",
            "Name": "松山区"
          },
          {
            "Code": "150421",
            "Name": "阿鲁科尔沁旗"
          },
          {
            "Code": "150422",
            "Name": "巴林左旗"
          },
          {
            "Code": "150423",
            "Name": "巴林右旗"
          },
          {
            "Code": "150424",
            "Name": "林西县"
          },
          {
            "Code": "150425",
            "Name": "克什克腾旗"
          },
          {
            "Code": "150426",
            "Name": "翁牛特旗"
          },
          {
            "Code": "150428",
            "Name": "喀喇沁旗"
          },
          {
            "Code": "150429",
            "Name": "宁城县"
          },
          {
            "Code": "150430",
            "Name": "敖汉旗"
          }
        ]
      },
      {
        "Code": "150500",
        "Name": "通辽市",
        "level": [
          {
            "Code": "150502",
            "Name": "科尔沁区"
          },
          {
            "Code": "150521",
            "Name": "科尔沁左翼中旗"
          },
          {
            "Code": "150522",
            "Name": "科尔沁左翼后旗"
          },
          {
            "Code": "150523",
            "Name": "开鲁县"
          },
          {
            "Code": "150524",
            "Name": "库伦旗"
          },
          {
            "Code": "150525",
            "Name": "奈曼旗"
          },
          {
            "Code": "150526",
            "Name": "扎鲁特旗"
          },
          {
            "Code": "150581",
            "Name": "霍林郭勒市"
          }
        ]
      },
      {
        "Code": "150600",
        "Name": "鄂尔多斯市",
        "level": [
          {
            "Code": "150602",
            "Name": "东胜区"
          },
          {
            "Code": "150621",
            "Name": "达拉特旗"
          },
          {
            "Code": "150622",
            "Name": "准格尔旗"
          },
          {
            "Code": "150623",
            "Name": "鄂托克前旗"
          },
          {
            "Code": "150624",
            "Name": "鄂托克旗"
          },
          {
            "Code": "150625",
            "Name": "杭锦旗"
          },
          {
            "Code": "150626",
            "Name": "乌审旗"
          },
          {
            "Code": "150627",
            "Name": "伊金霍洛旗"
          }
        ]
      },
      {
        "Code": "150700",
        "Name": "呼伦贝尔市",
        "level": [
          {
            "Code": "150702",
            "Name": "海拉尔区"
          },
          {
            "Code": "150703",
            "Name": "扎赉诺尔区"
          },
          {
            "Code": "150721",
            "Name": "阿荣旗"
          },
          {
            "Code": "150722",
            "Name": "莫力达瓦达斡尔族自治旗"
          },
          {
            "Code": "150723",
            "Name": "鄂伦春自治旗"
          },
          {
            "Code": "150724",
            "Name": "鄂温克族自治旗"
          },
          {
            "Code": "150725",
            "Name": "陈巴尔虎旗"
          },
          {
            "Code": "150726",
            "Name": "新巴尔虎左旗"
          },
          {
            "Code": "150727",
            "Name": "新巴尔虎右旗"
          },
          {
            "Code": "150781",
            "Name": "满洲里市"
          },
          {
            "Code": "150782",
            "Name": "牙克石市"
          },
          {
            "Code": "150783",
            "Name": "扎兰屯市"
          },
          {
            "Code": "150784",
            "Name": "额尔古纳市"
          },
          {
            "Code": "150785",
            "Name": "根河市"
          }
        ]
      },
      {
        "Code": "150800",
        "Name": "巴彦淖尔市",
        "level": [
          {
            "Code": "150802",
            "Name": "临河区"
          },
          {
            "Code": "150821",
            "Name": "五原县"
          },
          {
            "Code": "150822",
            "Name": "磴口县"
          },
          {
            "Code": "150823",
            "Name": "乌拉特前旗"
          },
          {
            "Code": "150824",
            "Name": "乌拉特中旗"
          },
          {
            "Code": "150825",
            "Name": "乌拉特后旗"
          },
          {
            "Code": "150826",
            "Name": "杭锦后旗"
          }
        ]
      },
      {
        "Code": "150900",
        "Name": "乌兰察布市",
        "level": [
          {
            "Code": "150902",
            "Name": "集宁区"
          },
          {
            "Code": "150921",
            "Name": "卓资县"
          },
          {
            "Code": "150922",
            "Name": "化德县"
          },
          {
            "Code": "150923",
            "Name": "商都县"
          },
          {
            "Code": "150924",
            "Name": "兴和县"
          },
          {
            "Code": "150925",
            "Name": "凉城县"
          },
          {
            "Code": "150926",
            "Name": "察哈尔右翼前旗"
          },
          {
            "Code": "150927",
            "Name": "察哈尔右翼中旗"
          },
          {
            "Code": "150928",
            "Name": "察哈尔右翼后旗"
          },
          {
            "Code": "150929",
            "Name": "四子王旗"
          },
          {
            "Code": "150981",
            "Name": "丰镇市"
          }
        ]
      },
      {
        "Code": "152200",
        "Name": "兴安盟",
        "level": [
          {
            "Code": "152201",
            "Name": "乌兰浩特市"
          },
          {
            "Code": "152202",
            "Name": "阿尔山市"
          },
          {
            "Code": "152221",
            "Name": "科尔沁右翼前旗"
          },
          {
            "Code": "152222",
            "Name": "科尔沁右翼中旗"
          },
          {
            "Code": "152223",
            "Name": "扎赉特旗"
          },
          {
            "Code": "152224",
            "Name": "突泉县"
          }
        ]
      },
      {
        "Code": "152500",
        "Name": "锡林郭勒盟",
        "level": [
          {
            "Code": "152501",
            "Name": "二连浩特市"
          },
          {
            "Code": "152502",
            "Name": "锡林浩特市"
          },
          {
            "Code": "152522",
            "Name": "阿巴嘎旗"
          },
          {
            "Code": "152523",
            "Name": "苏尼特左旗"
          },
          {
            "Code": "152524",
            "Name": "苏尼特右旗"
          },
          {
            "Code": "152525",
            "Name": "东乌珠穆沁旗"
          },
          {
            "Code": "152526",
            "Name": "西乌珠穆沁旗"
          },
          {
            "Code": "152527",
            "Name": "太仆寺旗"
          },
          {
            "Code": "152528",
            "Name": "镶黄旗"
          },
          {
            "Code": "152529",
            "Name": "正镶白旗"
          },
          {
            "Code": "152530",
            "Name": "正蓝旗"
          },
          {
            "Code": "152531",
            "Name": "多伦县"
          }
        ]
      },
      {
        "Code": "152900",
        "Name": "阿拉善盟",
        "level": [
          {
            "Code": "152921",
            "Name": "阿拉善左旗"
          },
          {
            "Code": "152922",
            "Name": "阿拉善右旗"
          },
          {
            "Code": "152923",
            "Name": "额济纳旗"
          }
        ]
      }
    ]
  },
  {
    "Code": "210000",
    "Name": "辽宁省",
    "level": [
      {
        "Code": "210100",
        "Name": "沈阳市",
        "level": [
          {
            "Code": "210102",
            "Name": "和平区"
          },
          {
            "Code": "210103",
            "Name": "沈河区"
          },
          {
            "Code": "210104",
            "Name": "大东区"
          },
          {
            "Code": "210105",
            "Name": "皇姑区"
          },
          {
            "Code": "210106",
            "Name": "铁西区"
          },
          {
            "Code": "210111",
            "Name": "苏家屯区"
          },
          {
            "Code": "210112",
            "Name": "东陵区"
          },
          {
            "Code": "210114",
            "Name": "于洪区"
          },
          {
            "Code": "210122",
            "Name": "辽中县"
          },
          {
            "Code": "210123",
            "Name": "康平县"
          },
          {
            "Code": "210124",
            "Name": "法库县"
          },
          {
            "Code": "210181",
            "Name": "新民市"
          },
          {
            "Code": "210184",
            "Name": "沈北新区"
          }
        ]
      },
      {
        "Code": "210200",
        "Name": "大连市",
        "level": [
          {
            "Code": "210202",
            "Name": "中山区"
          },
          {
            "Code": "210203",
            "Name": "西岗区"
          },
          {
            "Code": "210204",
            "Name": "沙河口区"
          },
          {
            "Code": "210211",
            "Name": "甘井子区"
          },
          {
            "Code": "210212",
            "Name": "旅顺口区"
          },
          {
            "Code": "210213",
            "Name": "金州区"
          },
          {
            "Code": "210224",
            "Name": "长海县"
          },
          {
            "Code": "210281",
            "Name": "瓦房店市"
          },
          {
            "Code": "210282",
            "Name": "普兰店市"
          },
          {
            "Code": "210283",
            "Name": "庄河市"
          }
        ]
      },
      {
        "Code": "210300",
        "Name": "鞍山市",
        "level": [
          {
            "Code": "210302",
            "Name": "铁东区"
          },
          {
            "Code": "210303",
            "Name": "铁西区"
          },
          {
            "Code": "210304",
            "Name": "立山区"
          },
          {
            "Code": "210311",
            "Name": "千山区"
          },
          {
            "Code": "210321",
            "Name": "台安县"
          },
          {
            "Code": "210323",
            "Name": "岫岩满族自治县"
          },
          {
            "Code": "210381",
            "Name": "海城市"
          }
        ]
      },
      {
        "Code": "210400",
        "Name": "抚顺市",
        "level": [
          {
            "Code": "210402",
            "Name": "新抚区"
          },
          {
            "Code": "210403",
            "Name": "东洲区"
          },
          {
            "Code": "210404",
            "Name": "望花区"
          },
          {
            "Code": "210411",
            "Name": "顺城区"
          },
          {
            "Code": "210421",
            "Name": "抚顺县"
          },
          {
            "Code": "210422",
            "Name": "新宾满族自治县"
          },
          {
            "Code": "210423",
            "Name": "清原满族自治县"
          }
        ]
      },
      {
        "Code": "210500",
        "Name": "本溪市",
        "level": [
          {
            "Code": "210502",
            "Name": "平山区"
          },
          {
            "Code": "210503",
            "Name": "溪湖区"
          },
          {
            "Code": "210504",
            "Name": "明山区"
          },
          {
            "Code": "210505",
            "Name": "南芬区"
          },
          {
            "Code": "210521",
            "Name": "本溪满族自治县"
          },
          {
            "Code": "210522",
            "Name": "桓仁满族自治县"
          }
        ]
      },
      {
        "Code": "210600",
        "Name": "丹东市",
        "level": [
          {
            "Code": "210602",
            "Name": "元宝区"
          },
          {
            "Code": "210603",
            "Name": "振兴区"
          },
          {
            "Code": "210604",
            "Name": "振安区"
          },
          {
            "Code": "210624",
            "Name": "宽甸满族自治县"
          },
          {
            "Code": "210681",
            "Name": "东港市"
          },
          {
            "Code": "210682",
            "Name": "凤城市"
          }
        ]
      },
      {
        "Code": "210700",
        "Name": "锦州市",
        "level": [
          {
            "Code": "210702",
            "Name": "古塔区"
          },
          {
            "Code": "210703",
            "Name": "凌河区"
          },
          {
            "Code": "210711",
            "Name": "太和区"
          },
          {
            "Code": "210726",
            "Name": "黑山县"
          },
          {
            "Code": "210727",
            "Name": "义县"
          },
          {
            "Code": "210781",
            "Name": "凌海市"
          },
          {
            "Code": "210782",
            "Name": "北镇市"
          }
        ]
      },
      {
        "Code": "210800",
        "Name": "营口市",
        "level": [
          {
            "Code": "210802",
            "Name": "站前区"
          },
          {
            "Code": "210803",
            "Name": "西市区"
          },
          {
            "Code": "210804",
            "Name": "鲅鱼圈区"
          },
          {
            "Code": "210811",
            "Name": "老边区"
          },
          {
            "Code": "210881",
            "Name": "盖州市"
          },
          {
            "Code": "210882",
            "Name": "大石桥市"
          }
        ]
      },
      {
        "Code": "210900",
        "Name": "阜新市",
        "level": [
          {
            "Code": "210902",
            "Name": "海州区"
          },
          {
            "Code": "210903",
            "Name": "新邱区"
          },
          {
            "Code": "210904",
            "Name": "太平区"
          },
          {
            "Code": "210905",
            "Name": "清河门区"
          },
          {
            "Code": "210911",
            "Name": "细河区"
          },
          {
            "Code": "210921",
            "Name": "阜新蒙古族自治县"
          },
          {
            "Code": "210922",
            "Name": "彰武县"
          }
        ]
      },
      {
        "Code": "211000",
        "Name": "辽阳市",
        "level": [
          {
            "Code": "211002",
            "Name": "白塔区"
          },
          {
            "Code": "211003",
            "Name": "文圣区"
          },
          {
            "Code": "211004",
            "Name": "宏伟区"
          },
          {
            "Code": "211005",
            "Name": "弓长岭区"
          },
          {
            "Code": "211011",
            "Name": "太子河区"
          },
          {
            "Code": "211021",
            "Name": "辽阳县"
          },
          {
            "Code": "211081",
            "Name": "灯塔市"
          }
        ]
      },
      {
        "Code": "211100",
        "Name": "盘锦市",
        "level": [
          {
            "Code": "211102",
            "Name": "双台子区"
          },
          {
            "Code": "211103",
            "Name": "兴隆台区"
          },
          {
            "Code": "211121",
            "Name": "大洼县"
          },
          {
            "Code": "211122",
            "Name": "盘山县"
          }
        ]
      },
      {
        "Code": "211200",
        "Name": "铁岭市",
        "level": [
          {
            "Code": "211202",
            "Name": "银州区"
          },
          {
            "Code": "211204",
            "Name": "清河区"
          },
          {
            "Code": "211221",
            "Name": "铁岭县"
          },
          {
            "Code": "211223",
            "Name": "西丰县"
          },
          {
            "Code": "211224",
            "Name": "昌图县"
          },
          {
            "Code": "211281",
            "Name": "调兵山市"
          },
          {
            "Code": "211282",
            "Name": "开原市"
          }
        ]
      },
      {
        "Code": "211300",
        "Name": "朝阳市",
        "level": [
          {
            "Code": "211302",
            "Name": "双塔区"
          },
          {
            "Code": "211303",
            "Name": "龙城区"
          },
          {
            "Code": "211321",
            "Name": "朝阳县"
          },
          {
            "Code": "211322",
            "Name": "建平县"
          },
          {
            "Code": "211324",
            "Name": "喀喇沁左翼蒙古族自治县"
          },
          {
            "Code": "211381",
            "Name": "北票市"
          },
          {
            "Code": "211382",
            "Name": "凌源市"
          }
        ]
      },
      {
        "Code": "211400",
        "Name": "葫芦岛市",
        "level": [
          {
            "Code": "211402",
            "Name": "连山区"
          },
          {
            "Code": "211403",
            "Name": "龙港区"
          },
          {
            "Code": "211404",
            "Name": "南票区"
          },
          {
            "Code": "211421",
            "Name": "绥中县"
          },
          {
            "Code": "211422",
            "Name": "建昌县"
          },
          {
            "Code": "211481",
            "Name": "兴城市"
          }
        ]
      }
    ]
  },
  {
    "Code": "220000",
    "Name": "吉林省",
    "level": [
      {
        "Code": "220100",
        "Name": "长春市",
        "level": [
          {
            "Code": "220102",
            "Name": "南关区"
          },
          {
            "Code": "220103",
            "Name": "宽城区"
          },
          {
            "Code": "220104",
            "Name": "朝阳区"
          },
          {
            "Code": "220105",
            "Name": "二道区"
          },
          {
            "Code": "220106",
            "Name": "绿园区"
          },
          {
            "Code": "220112",
            "Name": "双阳区"
          },
          {
            "Code": "220122",
            "Name": "农安县"
          },
          {
            "Code": "220181",
            "Name": "九台市"
          },
          {
            "Code": "220182",
            "Name": "榆树市"
          },
          {
            "Code": "220183",
            "Name": "德惠市"
          }
        ]
      },
      {
        "Code": "220200",
        "Name": "吉林市",
        "level": [
          {
            "Code": "220202",
            "Name": "昌邑区"
          },
          {
            "Code": "220203",
            "Name": "龙潭区"
          },
          {
            "Code": "220204",
            "Name": "船营区"
          },
          {
            "Code": "220211",
            "Name": "丰满区"
          },
          {
            "Code": "220221",
            "Name": "永吉县"
          },
          {
            "Code": "220281",
            "Name": "蛟河市"
          },
          {
            "Code": "220282",
            "Name": "桦甸市"
          },
          {
            "Code": "220283",
            "Name": "舒兰市"
          },
          {
            "Code": "220284",
            "Name": "磐石市"
          }
        ]
      },
      {
        "Code": "220300",
        "Name": "四平市",
        "level": [
          {
            "Code": "220302",
            "Name": "铁西区"
          },
          {
            "Code": "220303",
            "Name": "铁东区"
          },
          {
            "Code": "220322",
            "Name": "梨树县"
          },
          {
            "Code": "220323",
            "Name": "伊通满族自治县"
          },
          {
            "Code": "220381",
            "Name": "公主岭市"
          },
          {
            "Code": "220382",
            "Name": "双辽市"
          }
        ]
      },
      {
        "Code": "220400",
        "Name": "辽源市",
        "level": [
          {
            "Code": "220402",
            "Name": "龙山区"
          },
          {
            "Code": "220403",
            "Name": "西安区"
          },
          {
            "Code": "220421",
            "Name": "东丰县"
          },
          {
            "Code": "220422",
            "Name": "东辽县"
          }
        ]
      },
      {
        "Code": "220500",
        "Name": "通化市",
        "level": [
          {
            "Code": "220502",
            "Name": "东昌区"
          },
          {
            "Code": "220503",
            "Name": "二道江区"
          },
          {
            "Code": "220521",
            "Name": "通化县"
          },
          {
            "Code": "220523",
            "Name": "辉南县"
          },
          {
            "Code": "220524",
            "Name": "柳河县"
          },
          {
            "Code": "220581",
            "Name": "梅河口市"
          },
          {
            "Code": "220582",
            "Name": "集安市"
          }
        ]
      },
      {
        "Code": "220600",
        "Name": "白山市",
        "level": [
          {
            "Code": "220602",
            "Name": "浑江区"
          },
          {
            "Code": "220621",
            "Name": "抚松县"
          },
          {
            "Code": "220622",
            "Name": "靖宇县"
          },
          {
            "Code": "220623",
            "Name": "长白朝鲜族自治县"
          },
          {
            "Code": "220625",
            "Name": "江源区"
          },
          {
            "Code": "220681",
            "Name": "临江市"
          }
        ]
      },
      {
        "Code": "220700",
        "Name": "松原市",
        "level": [
          {
            "Code": "220702",
            "Name": "宁江区"
          },
          {
            "Code": "220721",
            "Name": "前郭尔罗斯蒙古族自治县"
          },
          {
            "Code": "220722",
            "Name": "长岭县"
          },
          {
            "Code": "220723",
            "Name": "乾安县"
          },
          {
            "Code": "220724",
            "Name": "扶余市"
          }
        ]
      },
      {
        "Code": "220800",
        "Name": "白城市",
        "level": [
          {
            "Code": "220802",
            "Name": "洮北区"
          },
          {
            "Code": "220821",
            "Name": "镇赉县"
          },
          {
            "Code": "220822",
            "Name": "通榆县"
          },
          {
            "Code": "220881",
            "Name": "洮南市"
          },
          {
            "Code": "220882",
            "Name": "大安市"
          }
        ]
      },
      {
        "Code": "222400",
        "Name": "延边朝鲜族自治州",
        "level": [
          {
            "Code": "222401",
            "Name": "延吉市"
          },
          {
            "Code": "222402",
            "Name": "图们市"
          },
          {
            "Code": "222403",
            "Name": "敦化市"
          },
          {
            "Code": "222404",
            "Name": "珲春市"
          },
          {
            "Code": "222405",
            "Name": "龙井市"
          },
          {
            "Code": "222406",
            "Name": "和龙市"
          },
          {
            "Code": "222424",
            "Name": "汪清县"
          },
          {
            "Code": "222426",
            "Name": "安图县"
          }
        ]
      }
    ]
  },
  {
    "Code": "230000",
    "Name": "黑龙江省",
    "level": [
      {
        "Code": "230100",
        "Name": "哈尔滨市",
        "level": [
          {
            "Code": "230102",
            "Name": "道里区"
          },
          {
            "Code": "230103",
            "Name": "南岗区"
          },
          {
            "Code": "230104",
            "Name": "道外区"
          },
          {
            "Code": "230106",
            "Name": "香坊区"
          },
          {
            "Code": "230108",
            "Name": "平房区"
          },
          {
            "Code": "230109",
            "Name": "松北区"
          },
          {
            "Code": "230111",
            "Name": "呼兰区"
          },
          {
            "Code": "230123",
            "Name": "依兰县"
          },
          {
            "Code": "230124",
            "Name": "方正县"
          },
          {
            "Code": "230125",
            "Name": "宾县"
          },
          {
            "Code": "230126",
            "Name": "巴彦县"
          },
          {
            "Code": "230127",
            "Name": "木兰县"
          },
          {
            "Code": "230128",
            "Name": "通河县"
          },
          {
            "Code": "230129",
            "Name": "延寿县"
          },
          {
            "Code": "230181",
            "Name": "阿城区"
          },
          {
            "Code": "230182",
            "Name": "双城市"
          },
          {
            "Code": "230183",
            "Name": "尚志市"
          },
          {
            "Code": "230184",
            "Name": "五常市"
          }
        ]
      },
      {
        "Code": "230200",
        "Name": "齐齐哈尔市",
        "level": [
          {
            "Code": "230202",
            "Name": "龙沙区"
          },
          {
            "Code": "230203",
            "Name": "建华区"
          },
          {
            "Code": "230204",
            "Name": "铁锋区"
          },
          {
            "Code": "230205",
            "Name": "昂昂溪区"
          },
          {
            "Code": "230206",
            "Name": "富拉尔基区"
          },
          {
            "Code": "230207",
            "Name": "碾子山区"
          },
          {
            "Code": "230208",
            "Name": "梅里斯达斡尔族区"
          },
          {
            "Code": "230221",
            "Name": "龙江县"
          },
          {
            "Code": "230223",
            "Name": "依安县"
          },
          {
            "Code": "230224",
            "Name": "泰来县"
          },
          {
            "Code": "230225",
            "Name": "甘南县"
          },
          {
            "Code": "230227",
            "Name": "富裕县"
          },
          {
            "Code": "230229",
            "Name": "克山县"
          },
          {
            "Code": "230230",
            "Name": "克东县"
          },
          {
            "Code": "230231",
            "Name": "拜泉县"
          },
          {
            "Code": "230281",
            "Name": "讷河市"
          }
        ]
      },
      {
        "Code": "230300",
        "Name": "鸡西市",
        "level": [
          {
            "Code": "230302",
            "Name": "鸡冠区"
          },
          {
            "Code": "230303",
            "Name": "恒山区"
          },
          {
            "Code": "230304",
            "Name": "滴道区"
          },
          {
            "Code": "230305",
            "Name": "梨树区"
          },
          {
            "Code": "230306",
            "Name": "城子河区"
          },
          {
            "Code": "230307",
            "Name": "麻山区"
          },
          {
            "Code": "230321",
            "Name": "鸡东县"
          },
          {
            "Code": "230381",
            "Name": "虎林市"
          },
          {
            "Code": "230382",
            "Name": "密山市"
          }
        ]
      },
      {
        "Code": "230400",
        "Name": "鹤岗市",
        "level": [
          {
            "Code": "230402",
            "Name": "向阳区"
          },
          {
            "Code": "230403",
            "Name": "工农区"
          },
          {
            "Code": "230404",
            "Name": "南山区"
          },
          {
            "Code": "230405",
            "Name": "兴安区"
          },
          {
            "Code": "230406",
            "Name": "东山区"
          },
          {
            "Code": "230407",
            "Name": "兴山区"
          },
          {
            "Code": "230421",
            "Name": "萝北县"
          },
          {
            "Code": "230422",
            "Name": "绥滨县"
          }
        ]
      },
      {
        "Code": "230500",
        "Name": "双鸭山市",
        "level": [
          {
            "Code": "230502",
            "Name": "尖山区"
          },
          {
            "Code": "230503",
            "Name": "岭东区"
          },
          {
            "Code": "230505",
            "Name": "四方台区"
          },
          {
            "Code": "230506",
            "Name": "宝山区"
          },
          {
            "Code": "230521",
            "Name": "集贤县"
          },
          {
            "Code": "230522",
            "Name": "友谊县"
          },
          {
            "Code": "230523",
            "Name": "宝清县"
          },
          {
            "Code": "230524",
            "Name": "饶河县"
          }
        ]
      },
      {
        "Code": "230600",
        "Name": "大庆市",
        "level": [
          {
            "Code": "230602",
            "Name": "萨尔图区"
          },
          {
            "Code": "230603",
            "Name": "龙凤区"
          },
          {
            "Code": "230604",
            "Name": "让胡路区"
          },
          {
            "Code": "230605",
            "Name": "红岗区"
          },
          {
            "Code": "230606",
            "Name": "大同区"
          },
          {
            "Code": "230621",
            "Name": "肇州县"
          },
          {
            "Code": "230622",
            "Name": "肇源县"
          },
          {
            "Code": "230623",
            "Name": "林甸县"
          },
          {
            "Code": "230624",
            "Name": "杜尔伯特蒙古族自治县"
          }
        ]
      },
      {
        "Code": "230700",
        "Name": "伊春市",
        "level": [
          {
            "Code": "230702",
            "Name": "伊春区"
          },
          {
            "Code": "230703",
            "Name": "南岔区"
          },
          {
            "Code": "230704",
            "Name": "友好区"
          },
          {
            "Code": "230705",
            "Name": "西林区"
          },
          {
            "Code": "230706",
            "Name": "翠峦区"
          },
          {
            "Code": "230707",
            "Name": "新青区"
          },
          {
            "Code": "230708",
            "Name": "美溪区"
          },
          {
            "Code": "230709",
            "Name": "金山屯区"
          },
          {
            "Code": "230710",
            "Name": "五营区"
          },
          {
            "Code": "230711",
            "Name": "乌马河区"
          },
          {
            "Code": "230712",
            "Name": "汤旺河区"
          },
          {
            "Code": "230713",
            "Name": "带岭区"
          },
          {
            "Code": "230714",
            "Name": "乌伊岭区"
          },
          {
            "Code": "230715",
            "Name": "红星区"
          },
          {
            "Code": "230716",
            "Name": "上甘岭区"
          },
          {
            "Code": "230722",
            "Name": "嘉荫县"
          },
          {
            "Code": "230781",
            "Name": "铁力市"
          }
        ]
      },
      {
        "Code": "230800",
        "Name": "佳木斯市",
        "level": [
          {
            "Code": "230803",
            "Name": "向阳区"
          },
          {
            "Code": "230804",
            "Name": "前进区"
          },
          {
            "Code": "230805",
            "Name": "东风区"
          },
          {
            "Code": "230811",
            "Name": "郊区"
          },
          {
            "Code": "230822",
            "Name": "桦南县"
          },
          {
            "Code": "230826",
            "Name": "桦川县"
          },
          {
            "Code": "230828",
            "Name": "汤原县"
          },
          {
            "Code": "230833",
            "Name": "抚远县"
          },
          {
            "Code": "230881",
            "Name": "同江市"
          },
          {
            "Code": "230882",
            "Name": "富锦市"
          }
        ]
      },
      {
        "Code": "230900",
        "Name": "七台河市",
        "level": [
          {
            "Code": "230902",
            "Name": "新兴区"
          },
          {
            "Code": "230903",
            "Name": "桃山区"
          },
          {
            "Code": "230904",
            "Name": "茄子河区"
          },
          {
            "Code": "230921",
            "Name": "勃利县"
          }
        ]
      },
      {
        "Code": "231000",
        "Name": "牡丹江市",
        "level": [
          {
            "Code": "231002",
            "Name": "东安区"
          },
          {
            "Code": "231003",
            "Name": "阳明区"
          },
          {
            "Code": "231004",
            "Name": "爱民区"
          },
          {
            "Code": "231005",
            "Name": "西安区"
          },
          {
            "Code": "231024",
            "Name": "东宁县"
          },
          {
            "Code": "231025",
            "Name": "林口县"
          },
          {
            "Code": "231081",
            "Name": "绥芬河市"
          },
          {
            "Code": "231083",
            "Name": "海林市"
          },
          {
            "Code": "231084",
            "Name": "宁安市"
          },
          {
            "Code": "231085",
            "Name": "穆棱市"
          }
        ]
      },
      {
        "Code": "231100",
        "Name": "黑河市",
        "level": [
          {
            "Code": "231102",
            "Name": "爱辉区"
          },
          {
            "Code": "231121",
            "Name": "嫩江县"
          },
          {
            "Code": "231123",
            "Name": "逊克县"
          },
          {
            "Code": "231124",
            "Name": "孙吴县"
          },
          {
            "Code": "231181",
            "Name": "北安市"
          },
          {
            "Code": "231182",
            "Name": "五大连池市"
          }
        ]
      },
      {
        "Code": "231200",
        "Name": "绥化市",
        "level": [
          {
            "Code": "231202",
            "Name": "北林区"
          },
          {
            "Code": "231221",
            "Name": "望奎县"
          },
          {
            "Code": "231222",
            "Name": "兰西县"
          },
          {
            "Code": "231223",
            "Name": "青冈县"
          },
          {
            "Code": "231224",
            "Name": "庆安县"
          },
          {
            "Code": "231225",
            "Name": "明水县"
          },
          {
            "Code": "231226",
            "Name": "绥棱县"
          },
          {
            "Code": "231281",
            "Name": "安达市"
          },
          {
            "Code": "231282",
            "Name": "肇东市"
          },
          {
            "Code": "231283",
            "Name": "海伦市"
          }
        ]
      },
      {
        "Code": "232700",
        "Name": "大兴安岭地区",
        "level": [
          {
            "Code": "232702",
            "Name": "松岭区"
          },
          {
            "Code": "232703",
            "Name": "新林区"
          },
          {
            "Code": "232704",
            "Name": "呼中区"
          },
          {
            "Code": "232721",
            "Name": "呼玛县"
          },
          {
            "Code": "232722",
            "Name": "塔河县"
          },
          {
            "Code": "232723",
            "Name": "漠河县"
          },
          {
            "Code": "232724",
            "Name": "加格达奇区"
          }
        ]
      }
    ]
  },
  {
    "Code": "310000",
    "Name": "上海",
    "level": [
      {
        "Code": "310100",
        "Name": "上海市",
        "level": [
          {
            "Code": "310101",
            "Name": "黄浦区"
          },
          {
            "Code": "310104",
            "Name": "徐汇区"
          },
          {
            "Code": "310105",
            "Name": "长宁区"
          },
          {
            "Code": "310106",
            "Name": "静安区"
          },
          {
            "Code": "310107",
            "Name": "普陀区"
          },
          {
            "Code": "310108",
            "Name": "闸北区"
          },
          {
            "Code": "310109",
            "Name": "虹口区"
          },
          {
            "Code": "310110",
            "Name": "杨浦区"
          },
          {
            "Code": "310112",
            "Name": "闵行区"
          },
          {
            "Code": "310113",
            "Name": "宝山区"
          },
          {
            "Code": "310114",
            "Name": "嘉定区"
          },
          {
            "Code": "310115",
            "Name": "浦东新区"
          },
          {
            "Code": "310116",
            "Name": "金山区"
          },
          {
            "Code": "310117",
            "Name": "松江区"
          },
          {
            "Code": "310118",
            "Name": "青浦区"
          },
          {
            "Code": "310120",
            "Name": "奉贤区"
          },
          {
            "Code": "310230",
            "Name": "崇明县"
          }
        ]
      }
    ]
  },
  {
    "Code": "320000",
    "Name": "江苏省",
    "level": [
      {
        "Code": "320100",
        "Name": "南京市",
        "level": [
          {
            "Code": "320102",
            "Name": "玄武区"
          },
          {
            "Code": "320104",
            "Name": "秦淮区"
          },
          {
            "Code": "320105",
            "Name": "建邺区"
          },
          {
            "Code": "320106",
            "Name": "鼓楼区"
          },
          {
            "Code": "320111",
            "Name": "浦口区"
          },
          {
            "Code": "320113",
            "Name": "栖霞区"
          },
          {
            "Code": "320114",
            "Name": "雨花台区"
          },
          {
            "Code": "320115",
            "Name": "江宁区"
          },
          {
            "Code": "320116",
            "Name": "六合区"
          },
          {
            "Code": "320124",
            "Name": "溧水区"
          },
          {
            "Code": "320125",
            "Name": "高淳区"
          }
        ]
      },
      {
        "Code": "320200",
        "Name": "无锡市",
        "level": [
          {
            "Code": "320202",
            "Name": "崇安区"
          },
          {
            "Code": "320203",
            "Name": "南长区"
          },
          {
            "Code": "320204",
            "Name": "北塘区"
          },
          {
            "Code": "320205",
            "Name": "锡山区"
          },
          {
            "Code": "320206",
            "Name": "惠山区"
          },
          {
            "Code": "320211",
            "Name": "滨湖区"
          },
          {
            "Code": "320281",
            "Name": "江阴市"
          },
          {
            "Code": "320282",
            "Name": "宜兴市"
          }
        ]
      },
      {
        "Code": "320300",
        "Name": "徐州市",
        "level": [
          {
            "Code": "320302",
            "Name": "鼓楼区"
          },
          {
            "Code": "320303",
            "Name": "云龙区"
          },
          {
            "Code": "320305",
            "Name": "贾汪区"
          },
          {
            "Code": "320311",
            "Name": "泉山区"
          },
          {
            "Code": "320321",
            "Name": "丰县"
          },
          {
            "Code": "320322",
            "Name": "沛县"
          },
          {
            "Code": "320323",
            "Name": "铜山区"
          },
          {
            "Code": "320324",
            "Name": "睢宁县"
          },
          {
            "Code": "320381",
            "Name": "新沂市"
          },
          {
            "Code": "320382",
            "Name": "邳州市"
          }
        ]
      },
      {
        "Code": "320400",
        "Name": "常州市",
        "level": [
          {
            "Code": "320402",
            "Name": "天宁区"
          },
          {
            "Code": "320404",
            "Name": "钟楼区"
          },
          {
            "Code": "320405",
            "Name": "戚墅堰区"
          },
          {
            "Code": "320411",
            "Name": "新北区"
          },
          {
            "Code": "320412",
            "Name": "武进区"
          },
          {
            "Code": "320481",
            "Name": "溧阳市"
          },
          {
            "Code": "320482",
            "Name": "金坛市"
          }
        ]
      },
      {
        "Code": "320500",
        "Name": "苏州市",
        "level": [
          {
            "Code": "320505",
            "Name": "虎丘区"
          },
          {
            "Code": "320506",
            "Name": "吴中区"
          },
          {
            "Code": "320507",
            "Name": "相城区"
          },
          {
            "Code": "320508",
            "Name": "姑苏区"
          },
          {
            "Code": "320581",
            "Name": "常熟市"
          },
          {
            "Code": "320582",
            "Name": "张家港市"
          },
          {
            "Code": "320583",
            "Name": "昆山市"
          },
          {
            "Code": "320584",
            "Name": "吴江区"
          },
          {
            "Code": "320585",
            "Name": "太仓市"
          }
        ]
      },
      {
        "Code": "320600",
        "Name": "南通市",
        "level": [
          {
            "Code": "320602",
            "Name": "崇川区"
          },
          {
            "Code": "320611",
            "Name": "港闸区"
          },
          {
            "Code": "320612",
            "Name": "通州区"
          },
          {
            "Code": "320621",
            "Name": "海安县"
          },
          {
            "Code": "320623",
            "Name": "如东县"
          },
          {
            "Code": "320681",
            "Name": "启东市"
          },
          {
            "Code": "320682",
            "Name": "如皋市"
          },
          {
            "Code": "320684",
            "Name": "海门市"
          }
        ]
      },
      {
        "Code": "320700",
        "Name": "连云港市",
        "level": [
          {
            "Code": "320703",
            "Name": "连云区"
          },
          {
            "Code": "320705",
            "Name": "新浦区"
          },
          {
            "Code": "320706",
            "Name": "海州区"
          },
          {
            "Code": "320721",
            "Name": "赣榆县"
          },
          {
            "Code": "320722",
            "Name": "东海县"
          },
          {
            "Code": "320723",
            "Name": "灌云县"
          },
          {
            "Code": "320724",
            "Name": "灌南县"
          }
        ]
      },
      {
        "Code": "320800",
        "Name": "淮安市",
        "level": [
          {
            "Code": "320802",
            "Name": "清河区"
          },
          {
            "Code": "320803",
            "Name": "淮安区"
          },
          {
            "Code": "320804",
            "Name": "淮阴区"
          },
          {
            "Code": "320811",
            "Name": "清浦区"
          },
          {
            "Code": "320826",
            "Name": "涟水县"
          },
          {
            "Code": "320829",
            "Name": "洪泽县"
          },
          {
            "Code": "320830",
            "Name": "盱眙县"
          },
          {
            "Code": "320831",
            "Name": "金湖县"
          }
        ]
      },
      {
        "Code": "320900",
        "Name": "盐城市",
        "level": [
          {
            "Code": "320902",
            "Name": "亭湖区"
          },
          {
            "Code": "320903",
            "Name": "盐都区"
          },
          {
            "Code": "320921",
            "Name": "响水县"
          },
          {
            "Code": "320922",
            "Name": "滨海县"
          },
          {
            "Code": "320923",
            "Name": "阜宁县"
          },
          {
            "Code": "320924",
            "Name": "射阳县"
          },
          {
            "Code": "320925",
            "Name": "建湖县"
          },
          {
            "Code": "320981",
            "Name": "东台市"
          },
          {
            "Code": "320982",
            "Name": "大丰市"
          }
        ]
      },
      {
        "Code": "321000",
        "Name": "扬州市",
        "level": [
          {
            "Code": "321002",
            "Name": "广陵区"
          },
          {
            "Code": "321003",
            "Name": "邗江区"
          },
          {
            "Code": "321023",
            "Name": "宝应县"
          },
          {
            "Code": "321081",
            "Name": "仪征市"
          },
          {
            "Code": "321084",
            "Name": "高邮市"
          },
          {
            "Code": "321088",
            "Name": "江都区"
          }
        ]
      },
      {
        "Code": "321100",
        "Name": "镇江市",
        "level": [
          {
            "Code": "321102",
            "Name": "京口区"
          },
          {
            "Code": "321111",
            "Name": "润州区"
          },
          {
            "Code": "321112",
            "Name": "丹徒区"
          },
          {
            "Code": "321181",
            "Name": "丹阳市"
          },
          {
            "Code": "321182",
            "Name": "扬中市"
          },
          {
            "Code": "321183",
            "Name": "句容市"
          }
        ]
      },
      {
        "Code": "321200",
        "Name": "泰州市",
        "level": [
          {
            "Code": "321202",
            "Name": "海陵区"
          },
          {
            "Code": "321203",
            "Name": "高港区"
          },
          {
            "Code": "321281",
            "Name": "兴化市"
          },
          {
            "Code": "321282",
            "Name": "靖江市"
          },
          {
            "Code": "321283",
            "Name": "泰兴市"
          },
          {
            "Code": "321284",
            "Name": "姜堰区"
          }
        ]
      },
      {
        "Code": "321300",
        "Name": "宿迁市",
        "level": [
          {
            "Code": "321302",
            "Name": "宿城区"
          },
          {
            "Code": "321311",
            "Name": "宿豫区"
          },
          {
            "Code": "321322",
            "Name": "沭阳县"
          },
          {
            "Code": "321323",
            "Name": "泗阳县"
          },
          {
            "Code": "321324",
            "Name": "泗洪县"
          }
        ]
      }
    ]
  },
  {
    "Code": "330000",
    "Name": "浙江省",
    "level": [
      {
        "Code": "330100",
        "Name": "杭州市",
        "level": [
          {
            "Code": "330102",
            "Name": "上城区"
          },
          {
            "Code": "330103",
            "Name": "下城区"
          },
          {
            "Code": "330104",
            "Name": "江干区"
          },
          {
            "Code": "330105",
            "Name": "拱墅区"
          },
          {
            "Code": "330106",
            "Name": "西湖区"
          },
          {
            "Code": "330108",
            "Name": "滨江区"
          },
          {
            "Code": "330109",
            "Name": "萧山区"
          },
          {
            "Code": "330110",
            "Name": "余杭区"
          },
          {
            "Code": "330122",
            "Name": "桐庐县"
          },
          {
            "Code": "330127",
            "Name": "淳安县"
          },
          {
            "Code": "330182",
            "Name": "建德市"
          },
          {
            "Code": "330183",
            "Name": "富阳市"
          },
          {
            "Code": "330185",
            "Name": "临安市"
          }
        ]
      },
      {
        "Code": "330200",
        "Name": "宁波市",
        "level": [
          {
            "Code": "330203",
            "Name": "海曙区"
          },
          {
            "Code": "330204",
            "Name": "江东区"
          },
          {
            "Code": "330205",
            "Name": "江北区"
          },
          {
            "Code": "330206",
            "Name": "北仑区"
          },
          {
            "Code": "330211",
            "Name": "镇海区"
          },
          {
            "Code": "330212",
            "Name": "鄞州区"
          },
          {
            "Code": "330225",
            "Name": "象山县"
          },
          {
            "Code": "330226",
            "Name": "宁海县"
          },
          {
            "Code": "330281",
            "Name": "余姚市"
          },
          {
            "Code": "330282",
            "Name": "慈溪市"
          },
          {
            "Code": "330283",
            "Name": "奉化市"
          }
        ]
      },
      {
        "Code": "330300",
        "Name": "温州市",
        "level": [
          {
            "Code": "330302",
            "Name": "鹿城区"
          },
          {
            "Code": "330303",
            "Name": "龙湾区"
          },
          {
            "Code": "330304",
            "Name": "瓯海区"
          },
          {
            "Code": "330322",
            "Name": "洞头县"
          },
          {
            "Code": "330324",
            "Name": "永嘉县"
          },
          {
            "Code": "330326",
            "Name": "平阳县"
          },
          {
            "Code": "330327",
            "Name": "苍南县"
          },
          {
            "Code": "330328",
            "Name": "文成县"
          },
          {
            "Code": "330329",
            "Name": "泰顺县"
          },
          {
            "Code": "330381",
            "Name": "瑞安市"
          },
          {
            "Code": "330382",
            "Name": "乐清市"
          }
        ]
      },
      {
        "Code": "330400",
        "Name": "嘉兴市",
        "level": [
          {
            "Code": "330402",
            "Name": "南湖区"
          },
          {
            "Code": "330411",
            "Name": "秀洲区"
          },
          {
            "Code": "330421",
            "Name": "嘉善县"
          },
          {
            "Code": "330424",
            "Name": "海盐县"
          },
          {
            "Code": "330481",
            "Name": "海宁市"
          },
          {
            "Code": "330482",
            "Name": "平湖市"
          },
          {
            "Code": "330483",
            "Name": "桐乡市"
          }
        ]
      },
      {
        "Code": "330500",
        "Name": "湖州市",
        "level": [
          {
            "Code": "330502",
            "Name": "吴兴区"
          },
          {
            "Code": "330503",
            "Name": "南浔区"
          },
          {
            "Code": "330521",
            "Name": "德清县"
          },
          {
            "Code": "330522",
            "Name": "长兴县"
          },
          {
            "Code": "330523",
            "Name": "安吉县"
          }
        ]
      },
      {
        "Code": "330600",
        "Name": "绍兴市",
        "level": [
          {
            "Code": "330602",
            "Name": "越城区"
          },
          {
            "Code": "330621",
            "Name": "绍兴县"
          },
          {
            "Code": "330624",
            "Name": "新昌县"
          },
          {
            "Code": "330681",
            "Name": "诸暨市"
          },
          {
            "Code": "330682",
            "Name": "上虞市"
          },
          {
            "Code": "330683",
            "Name": "嵊州市"
          }
        ]
      },
      {
        "Code": "330700",
        "Name": "金华市",
        "level": [
          {
            "Code": "330702",
            "Name": "婺城区"
          },
          {
            "Code": "330703",
            "Name": "金东区"
          },
          {
            "Code": "330723",
            "Name": "武义县"
          },
          {
            "Code": "330726",
            "Name": "浦江县"
          },
          {
            "Code": "330727",
            "Name": "磐安县"
          },
          {
            "Code": "330781",
            "Name": "兰溪市"
          },
          {
            "Code": "330782",
            "Name": "义乌市"
          },
          {
            "Code": "330783",
            "Name": "东阳市"
          },
          {
            "Code": "330784",
            "Name": "永康市"
          }
        ]
      },
      {
        "Code": "330800",
        "Name": "衢州市",
        "level": [
          {
            "Code": "330802",
            "Name": "柯城区"
          },
          {
            "Code": "330803",
            "Name": "衢江区"
          },
          {
            "Code": "330822",
            "Name": "常山县"
          },
          {
            "Code": "330824",
            "Name": "开化县"
          },
          {
            "Code": "330825",
            "Name": "龙游县"
          },
          {
            "Code": "330881",
            "Name": "江山市"
          }
        ]
      },
      {
        "Code": "330900",
        "Name": "舟山市",
        "level": [
          {
            "Code": "330902",
            "Name": "定海区"
          },
          {
            "Code": "330903",
            "Name": "普陀区"
          },
          {
            "Code": "330921",
            "Name": "岱山县"
          },
          {
            "Code": "330922",
            "Name": "嵊泗县"
          }
        ]
      },
      {
        "Code": "331000",
        "Name": "台州市",
        "level": [
          {
            "Code": "331002",
            "Name": "椒江区"
          },
          {
            "Code": "331003",
            "Name": "黄岩区"
          },
          {
            "Code": "331004",
            "Name": "路桥区"
          },
          {
            "Code": "331021",
            "Name": "玉环县"
          },
          {
            "Code": "331022",
            "Name": "三门县"
          },
          {
            "Code": "331023",
            "Name": "天台县"
          },
          {
            "Code": "331024",
            "Name": "仙居县"
          },
          {
            "Code": "331081",
            "Name": "温岭市"
          },
          {
            "Code": "331082",
            "Name": "临海市"
          }
        ]
      },
      {
        "Code": "331100",
        "Name": "丽水市",
        "level": [
          {
            "Code": "331102",
            "Name": "莲都区"
          },
          {
            "Code": "331121",
            "Name": "青田县"
          },
          {
            "Code": "331122",
            "Name": "缙云县"
          },
          {
            "Code": "331123",
            "Name": "遂昌县"
          },
          {
            "Code": "331124",
            "Name": "松阳县"
          },
          {
            "Code": "331125",
            "Name": "云和县"
          },
          {
            "Code": "331126",
            "Name": "庆元县"
          },
          {
            "Code": "331127",
            "Name": "景宁畲族自治县"
          },
          {
            "Code": "331181",
            "Name": "龙泉市"
          }
        ]
      }
    ]
  },
  {
    "Code": "340000",
    "Name": "安徽省",
    "level": [
      {
        "Code": "340100",
        "Name": "合肥市",
        "level": [
          {
            "Code": "340102",
            "Name": "瑶海区"
          },
          {
            "Code": "340103",
            "Name": "庐阳区"
          },
          {
            "Code": "340104",
            "Name": "蜀山区"
          },
          {
            "Code": "340111",
            "Name": "包河区"
          },
          {
            "Code": "340121",
            "Name": "长丰县"
          },
          {
            "Code": "340122",
            "Name": "肥东县"
          },
          {
            "Code": "340123",
            "Name": "肥西县"
          },
          {
            "Code": "341400",
            "Name": "巢湖市"
          },
          {
            "Code": "341421",
            "Name": "庐江县"
          }
        ]
      },
      {
        "Code": "340200",
        "Name": "芜湖市",
        "level": [
          {
            "Code": "340202",
            "Name": "镜湖区"
          },
          {
            "Code": "340203",
            "Name": "弋江区"
          },
          {
            "Code": "340207",
            "Name": "鸠江区"
          },
          {
            "Code": "340208",
            "Name": "三山区"
          },
          {
            "Code": "340221",
            "Name": "芜湖县"
          },
          {
            "Code": "340222",
            "Name": "繁昌县"
          },
          {
            "Code": "340223",
            "Name": "南陵县"
          },
          {
            "Code": "341422",
            "Name": "无为县"
          }
        ]
      },
      {
        "Code": "340300",
        "Name": "蚌埠市",
        "level": [
          {
            "Code": "340302",
            "Name": "龙子湖区"
          },
          {
            "Code": "340303",
            "Name": "蚌山区"
          },
          {
            "Code": "340304",
            "Name": "禹会区"
          },
          {
            "Code": "340311",
            "Name": "淮上区"
          },
          {
            "Code": "340321",
            "Name": "怀远县"
          },
          {
            "Code": "340322",
            "Name": "五河县"
          },
          {
            "Code": "340323",
            "Name": "固镇县"
          }
        ]
      },
      {
        "Code": "340400",
        "Name": "淮南市",
        "level": [
          {
            "Code": "340402",
            "Name": "大通区"
          },
          {
            "Code": "340403",
            "Name": "田家庵区"
          },
          {
            "Code": "340404",
            "Name": "谢家集区"
          },
          {
            "Code": "340405",
            "Name": "八公山区"
          },
          {
            "Code": "340406",
            "Name": "潘集区"
          },
          {
            "Code": "340421",
            "Name": "凤台县"
          }
        ]
      },
      {
        "Code": "340500",
        "Name": "马鞍山市",
        "level": [
          {
            "Code": "340503",
            "Name": "花山区"
          },
          {
            "Code": "340504",
            "Name": "雨山区"
          },
          {
            "Code": "340506",
            "Name": "博望区"
          },
          {
            "Code": "340521",
            "Name": "当涂县"
          },
          {
            "Code": "341423",
            "Name": "含山县"
          },
          {
            "Code": "341424",
            "Name": "和县"
          }
        ]
      },
      {
        "Code": "340600",
        "Name": "淮北市",
        "level": [
          {
            "Code": "340602",
            "Name": "杜集区"
          },
          {
            "Code": "340603",
            "Name": "相山区"
          },
          {
            "Code": "340604",
            "Name": "烈山区"
          },
          {
            "Code": "340621",
            "Name": "濉溪县"
          }
        ]
      },
      {
        "Code": "340700",
        "Name": "铜陵市",
        "level": [
          {
            "Code": "340702",
            "Name": "铜官山区"
          },
          {
            "Code": "340703",
            "Name": "狮子山区"
          },
          {
            "Code": "340711",
            "Name": "郊区"
          },
          {
            "Code": "340721",
            "Name": "铜陵县"
          }
        ]
      },
      {
        "Code": "340800",
        "Name": "安庆市",
        "level": [
          {
            "Code": "340802",
            "Name": "迎江区"
          },
          {
            "Code": "340803",
            "Name": "大观区"
          },
          {
            "Code": "340811",
            "Name": "宜秀区"
          },
          {
            "Code": "340822",
            "Name": "怀宁县"
          },
          {
            "Code": "340823",
            "Name": "枞阳县"
          },
          {
            "Code": "340824",
            "Name": "潜山县"
          },
          {
            "Code": "340825",
            "Name": "太湖县"
          },
          {
            "Code": "340826",
            "Name": "宿松县"
          },
          {
            "Code": "340827",
            "Name": "望江县"
          },
          {
            "Code": "340828",
            "Name": "岳西县"
          },
          {
            "Code": "340881",
            "Name": "桐城市"
          }
        ]
      },
      {
        "Code": "341000",
        "Name": "黄山市",
        "level": [
          {
            "Code": "341002",
            "Name": "屯溪区"
          },
          {
            "Code": "341003",
            "Name": "黄山区"
          },
          {
            "Code": "341004",
            "Name": "徽州区"
          },
          {
            "Code": "341021",
            "Name": "歙县"
          },
          {
            "Code": "341022",
            "Name": "休宁县"
          },
          {
            "Code": "341023",
            "Name": "黟县"
          },
          {
            "Code": "341024",
            "Name": "祁门县"
          }
        ]
      },
      {
        "Code": "341100",
        "Name": "滁州市",
        "level": [
          {
            "Code": "341102",
            "Name": "琅琊区"
          },
          {
            "Code": "341103",
            "Name": "南谯区"
          },
          {
            "Code": "341122",
            "Name": "来安县"
          },
          {
            "Code": "341124",
            "Name": "全椒县"
          },
          {
            "Code": "341125",
            "Name": "定远县"
          },
          {
            "Code": "341126",
            "Name": "凤阳县"
          },
          {
            "Code": "341181",
            "Name": "天长市"
          },
          {
            "Code": "341182",
            "Name": "明光市"
          }
        ]
      },
      {
        "Code": "341200",
        "Name": "阜阳市",
        "level": [
          {
            "Code": "341202",
            "Name": "颍州区"
          },
          {
            "Code": "341203",
            "Name": "颍东区"
          },
          {
            "Code": "341204",
            "Name": "颍泉区"
          },
          {
            "Code": "341221",
            "Name": "临泉县"
          },
          {
            "Code": "341222",
            "Name": "太和县"
          },
          {
            "Code": "341225",
            "Name": "阜南县"
          },
          {
            "Code": "341226",
            "Name": "颍上县"
          },
          {
            "Code": "341282",
            "Name": "界首市"
          }
        ]
      },
      {
        "Code": "341300",
        "Name": "宿州市",
        "level": [
          {
            "Code": "341302",
            "Name": "墉桥区"
          },
          {
            "Code": "341321",
            "Name": "砀山县"
          },
          {
            "Code": "341322",
            "Name": "萧县"
          },
          {
            "Code": "341323",
            "Name": "灵璧县"
          },
          {
            "Code": "341324",
            "Name": "泗县"
          }
        ]
      },
      {
        "Code": "341500",
        "Name": "六安市",
        "level": [
          {
            "Code": "341502",
            "Name": "金安区"
          },
          {
            "Code": "341503",
            "Name": "裕安区"
          },
          {
            "Code": "341521",
            "Name": "寿县"
          },
          {
            "Code": "341522",
            "Name": "霍邱县"
          },
          {
            "Code": "341523",
            "Name": "舒城县"
          },
          {
            "Code": "341524",
            "Name": "金寨县"
          },
          {
            "Code": "341525",
            "Name": "霍山县"
          }
        ]
      },
      {
        "Code": "341600",
        "Name": "亳州市",
        "level": [
          {
            "Code": "341602",
            "Name": "谯城区"
          },
          {
            "Code": "341621",
            "Name": "涡阳县"
          },
          {
            "Code": "341622",
            "Name": "蒙城县"
          },
          {
            "Code": "341623",
            "Name": "利辛县"
          }
        ]
      },
      {
        "Code": "341700",
        "Name": "池州市",
        "level": [
          {
            "Code": "341702",
            "Name": "贵池区"
          },
          {
            "Code": "341721",
            "Name": "东至县"
          },
          {
            "Code": "341722",
            "Name": "石台县"
          },
          {
            "Code": "341723",
            "Name": "青阳县"
          }
        ]
      },
      {
        "Code": "341800",
        "Name": "宣城市",
        "level": [
          {
            "Code": "341802",
            "Name": "宣州区"
          },
          {
            "Code": "341821",
            "Name": "郎溪县"
          },
          {
            "Code": "341822",
            "Name": "广德县"
          },
          {
            "Code": "341823",
            "Name": "泾县"
          },
          {
            "Code": "341824",
            "Name": "绩溪县"
          },
          {
            "Code": "341825",
            "Name": "旌德县"
          },
          {
            "Code": "341881",
            "Name": "宁国市"
          }
        ]
      }
    ]
  },
  {
    "Code": "350000",
    "Name": "福建省",
    "level": [
      {
        "Code": "350100",
        "Name": "福州市",
        "level": [
          {
            "Code": "350102",
            "Name": "鼓楼区"
          },
          {
            "Code": "350103",
            "Name": "台江区"
          },
          {
            "Code": "350104",
            "Name": "仓山区"
          },
          {
            "Code": "350105",
            "Name": "马尾区"
          },
          {
            "Code": "350111",
            "Name": "晋安区"
          },
          {
            "Code": "350121",
            "Name": "闽侯县"
          },
          {
            "Code": "350122",
            "Name": "连江县"
          },
          {
            "Code": "350123",
            "Name": "罗源县"
          },
          {
            "Code": "350124",
            "Name": "闽清县"
          },
          {
            "Code": "350125",
            "Name": "永泰县"
          },
          {
            "Code": "350128",
            "Name": "平潭县"
          },
          {
            "Code": "350181",
            "Name": "福清市"
          },
          {
            "Code": "350182",
            "Name": "长乐市"
          }
        ]
      },
      {
        "Code": "350200",
        "Name": "厦门市",
        "level": [
          {
            "Code": "350203",
            "Name": "思明区"
          },
          {
            "Code": "350205",
            "Name": "海沧区"
          },
          {
            "Code": "350206",
            "Name": "湖里区"
          },
          {
            "Code": "350211",
            "Name": "集美区"
          },
          {
            "Code": "350212",
            "Name": "同安区"
          },
          {
            "Code": "350213",
            "Name": "翔安区"
          }
        ]
      },
      {
        "Code": "350300",
        "Name": "莆田市",
        "level": [
          {
            "Code": "350302",
            "Name": "城厢区"
          },
          {
            "Code": "350303",
            "Name": "涵江区"
          },
          {
            "Code": "350304",
            "Name": "荔城区"
          },
          {
            "Code": "350305",
            "Name": "秀屿区"
          },
          {
            "Code": "350322",
            "Name": "仙游县"
          }
        ]
      },
      {
        "Code": "350400",
        "Name": "三明市",
        "level": [
          {
            "Code": "350402",
            "Name": "梅列区"
          },
          {
            "Code": "350403",
            "Name": "三元区"
          },
          {
            "Code": "350421",
            "Name": "明溪县"
          },
          {
            "Code": "350423",
            "Name": "清流县"
          },
          {
            "Code": "350424",
            "Name": "宁化县"
          },
          {
            "Code": "350425",
            "Name": "大田县"
          },
          {
            "Code": "350426",
            "Name": "尤溪县"
          },
          {
            "Code": "350427",
            "Name": "沙县"
          },
          {
            "Code": "350428",
            "Name": "将乐县"
          },
          {
            "Code": "350429",
            "Name": "泰宁县"
          },
          {
            "Code": "350430",
            "Name": "建宁县"
          },
          {
            "Code": "350481",
            "Name": "永安市"
          }
        ]
      },
      {
        "Code": "350500",
        "Name": "泉州市",
        "level": [
          {
            "Code": "350502",
            "Name": "鲤城区"
          },
          {
            "Code": "350503",
            "Name": "丰泽区"
          },
          {
            "Code": "350504",
            "Name": "洛江区"
          },
          {
            "Code": "350505",
            "Name": "泉港区"
          },
          {
            "Code": "350521",
            "Name": "惠安县"
          },
          {
            "Code": "350524",
            "Name": "安溪县"
          },
          {
            "Code": "350525",
            "Name": "永春县"
          },
          {
            "Code": "350526",
            "Name": "德化县"
          },
          {
            "Code": "350527",
            "Name": "金门县"
          },
          {
            "Code": "350581",
            "Name": "石狮市"
          },
          {
            "Code": "350582",
            "Name": "晋江市"
          },
          {
            "Code": "350583",
            "Name": "南安市"
          }
        ]
      },
      {
        "Code": "350600",
        "Name": "漳州市",
        "level": [
          {
            "Code": "350602",
            "Name": "芗城区"
          },
          {
            "Code": "350603",
            "Name": "龙文区"
          },
          {
            "Code": "350622",
            "Name": "云霄县"
          },
          {
            "Code": "350623",
            "Name": "漳浦县"
          },
          {
            "Code": "350624",
            "Name": "诏安县"
          },
          {
            "Code": "350625",
            "Name": "长泰县"
          },
          {
            "Code": "350626",
            "Name": "东山县"
          },
          {
            "Code": "350627",
            "Name": "南靖县"
          },
          {
            "Code": "350628",
            "Name": "平和县"
          },
          {
            "Code": "350629",
            "Name": "华安县"
          },
          {
            "Code": "350681",
            "Name": "龙海市"
          }
        ]
      },
      {
        "Code": "350700",
        "Name": "南平市",
        "level": [
          {
            "Code": "350702",
            "Name": "延平区"
          },
          {
            "Code": "350721",
            "Name": "顺昌县"
          },
          {
            "Code": "350722",
            "Name": "浦城县"
          },
          {
            "Code": "350723",
            "Name": "光泽县"
          },
          {
            "Code": "350724",
            "Name": "松溪县"
          },
          {
            "Code": "350725",
            "Name": "政和县"
          },
          {
            "Code": "350781",
            "Name": "邵武市"
          },
          {
            "Code": "350782",
            "Name": "武夷山市"
          },
          {
            "Code": "350783",
            "Name": "建瓯市"
          },
          {
            "Code": "350784",
            "Name": "建阳市"
          }
        ]
      },
      {
        "Code": "350800",
        "Name": "龙岩市",
        "level": [
          {
            "Code": "350802",
            "Name": "新罗区"
          },
          {
            "Code": "350821",
            "Name": "长汀县"
          },
          {
            "Code": "350822",
            "Name": "永定县"
          },
          {
            "Code": "350823",
            "Name": "上杭县"
          },
          {
            "Code": "350824",
            "Name": "武平县"
          },
          {
            "Code": "350825",
            "Name": "连城县"
          },
          {
            "Code": "350881",
            "Name": "漳平市"
          }
        ]
      },
      {
        "Code": "350900",
        "Name": "宁德市",
        "level": [
          {
            "Code": "350902",
            "Name": "蕉城区"
          },
          {
            "Code": "350921",
            "Name": "霞浦县"
          },
          {
            "Code": "350922",
            "Name": "古田县"
          },
          {
            "Code": "350923",
            "Name": "屏南县"
          },
          {
            "Code": "350924",
            "Name": "寿宁县"
          },
          {
            "Code": "350925",
            "Name": "周宁县"
          },
          {
            "Code": "350926",
            "Name": "柘荣县"
          },
          {
            "Code": "350981",
            "Name": "福安市"
          },
          {
            "Code": "350982",
            "Name": "福鼎市"
          }
        ]
      }
    ]
  },
  {
    "Code": "360000",
    "Name": "江西省",
    "level": [
      {
        "Code": "360100",
        "Name": "南昌市",
        "level": [
          {
            "Code": "360102",
            "Name": "东湖区"
          },
          {
            "Code": "360103",
            "Name": "西湖区"
          },
          {
            "Code": "360104",
            "Name": "青云谱区"
          },
          {
            "Code": "360105",
            "Name": "湾里区"
          },
          {
            "Code": "360111",
            "Name": "青山湖区"
          },
          {
            "Code": "360121",
            "Name": "南昌县"
          },
          {
            "Code": "360122",
            "Name": "新建县"
          },
          {
            "Code": "360123",
            "Name": "安义县"
          },
          {
            "Code": "360124",
            "Name": "进贤县"
          }
        ]
      },
      {
        "Code": "360200",
        "Name": "景德镇市",
        "level": [
          {
            "Code": "360202",
            "Name": "昌江区"
          },
          {
            "Code": "360203",
            "Name": "珠山区"
          },
          {
            "Code": "360222",
            "Name": "浮梁县"
          },
          {
            "Code": "360281",
            "Name": "乐平市"
          }
        ]
      },
      {
        "Code": "360300",
        "Name": "萍乡市",
        "level": [
          {
            "Code": "360302",
            "Name": "安源区"
          },
          {
            "Code": "360313",
            "Name": "湘东区"
          },
          {
            "Code": "360321",
            "Name": "莲花县"
          },
          {
            "Code": "360322",
            "Name": "上栗县"
          },
          {
            "Code": "360323",
            "Name": "芦溪县"
          }
        ]
      },
      {
        "Code": "360400",
        "Name": "九江市",
        "level": [
          {
            "Code": "360402",
            "Name": "庐山区"
          },
          {
            "Code": "360403",
            "Name": "浔阳区"
          },
          {
            "Code": "360421",
            "Name": "九江县"
          },
          {
            "Code": "360423",
            "Name": "武宁县"
          },
          {
            "Code": "360424",
            "Name": "修水县"
          },
          {
            "Code": "360425",
            "Name": "永修县"
          },
          {
            "Code": "360426",
            "Name": "德安县"
          },
          {
            "Code": "360427",
            "Name": "星子县"
          },
          {
            "Code": "360428",
            "Name": "都昌县"
          },
          {
            "Code": "360429",
            "Name": "湖口县"
          },
          {
            "Code": "360430",
            "Name": "彭泽县"
          },
          {
            "Code": "360481",
            "Name": "瑞昌市"
          },
          {
            "Code": "360483",
            "Name": "共青城市"
          }
        ]
      },
      {
        "Code": "360500",
        "Name": "新余市",
        "level": [
          {
            "Code": "360502",
            "Name": "渝水区"
          },
          {
            "Code": "360521",
            "Name": "分宜县"
          }
        ]
      },
      {
        "Code": "360600",
        "Name": "鹰潭市",
        "level": [
          {
            "Code": "360602",
            "Name": "月湖区"
          },
          {
            "Code": "360622",
            "Name": "余江县"
          },
          {
            "Code": "360681",
            "Name": "贵溪市"
          }
        ]
      },
      {
        "Code": "360700",
        "Name": "赣州市",
        "level": [
          {
            "Code": "360702",
            "Name": "章贡区"
          },
          {
            "Code": "360721",
            "Name": "赣县"
          },
          {
            "Code": "360722",
            "Name": "信丰县"
          },
          {
            "Code": "360723",
            "Name": "大余县"
          },
          {
            "Code": "360724",
            "Name": "上犹县"
          },
          {
            "Code": "360725",
            "Name": "崇义县"
          },
          {
            "Code": "360726",
            "Name": "安远县"
          },
          {
            "Code": "360727",
            "Name": "龙南县"
          },
          {
            "Code": "360728",
            "Name": "定南县"
          },
          {
            "Code": "360729",
            "Name": "全南县"
          },
          {
            "Code": "360730",
            "Name": "宁都县"
          },
          {
            "Code": "360731",
            "Name": "于都县"
          },
          {
            "Code": "360732",
            "Name": "兴国县"
          },
          {
            "Code": "360733",
            "Name": "会昌县"
          },
          {
            "Code": "360734",
            "Name": "寻乌县"
          },
          {
            "Code": "360735",
            "Name": "石城县"
          },
          {
            "Code": "360781",
            "Name": "瑞金市"
          },
          {
            "Code": "360782",
            "Name": "南康市"
          }
        ]
      },
      {
        "Code": "360800",
        "Name": "吉安市",
        "level": [
          {
            "Code": "360802",
            "Name": "吉州区"
          },
          {
            "Code": "360803",
            "Name": "青原区"
          },
          {
            "Code": "360821",
            "Name": "吉安县"
          },
          {
            "Code": "360822",
            "Name": "吉水县"
          },
          {
            "Code": "360823",
            "Name": "峡江县"
          },
          {
            "Code": "360824",
            "Name": "新干县"
          },
          {
            "Code": "360825",
            "Name": "永丰县"
          },
          {
            "Code": "360826",
            "Name": "泰和县"
          },
          {
            "Code": "360827",
            "Name": "遂川县"
          },
          {
            "Code": "360828",
            "Name": "万安县"
          },
          {
            "Code": "360829",
            "Name": "安福县"
          },
          {
            "Code": "360830",
            "Name": "永新县"
          },
          {
            "Code": "360881",
            "Name": "井冈山市"
          }
        ]
      },
      {
        "Code": "360900",
        "Name": "宜春市",
        "level": [
          {
            "Code": "360902",
            "Name": "袁州区"
          },
          {
            "Code": "360921",
            "Name": "奉新县"
          },
          {
            "Code": "360922",
            "Name": "万载县"
          },
          {
            "Code": "360923",
            "Name": "上高县"
          },
          {
            "Code": "360924",
            "Name": "宜丰县"
          },
          {
            "Code": "360925",
            "Name": "靖安县"
          },
          {
            "Code": "360926",
            "Name": "铜鼓县"
          },
          {
            "Code": "360981",
            "Name": "丰城市"
          },
          {
            "Code": "360982",
            "Name": "樟树市"
          },
          {
            "Code": "360983",
            "Name": "高安市"
          }
        ]
      },
      {
        "Code": "361000",
        "Name": "抚州市",
        "level": [
          {
            "Code": "361002",
            "Name": "临川区"
          },
          {
            "Code": "361021",
            "Name": "南城县"
          },
          {
            "Code": "361022",
            "Name": "黎川县"
          },
          {
            "Code": "361023",
            "Name": "南丰县"
          },
          {
            "Code": "361024",
            "Name": "崇仁县"
          },
          {
            "Code": "361025",
            "Name": "乐安县"
          },
          {
            "Code": "361026",
            "Name": "宜黄县"
          },
          {
            "Code": "361027",
            "Name": "金溪县"
          },
          {
            "Code": "361028",
            "Name": "资溪县"
          },
          {
            "Code": "361029",
            "Name": "东乡县"
          },
          {
            "Code": "361030",
            "Name": "广昌县"
          }
        ]
      },
      {
        "Code": "361100",
        "Name": "上饶市",
        "level": [
          {
            "Code": "361102",
            "Name": "信州区"
          },
          {
            "Code": "361121",
            "Name": "上饶县"
          },
          {
            "Code": "361122",
            "Name": "广丰县"
          },
          {
            "Code": "361123",
            "Name": "玉山县"
          },
          {
            "Code": "361124",
            "Name": "铅山县"
          },
          {
            "Code": "361125",
            "Name": "横峰县"
          },
          {
            "Code": "361126",
            "Name": "弋阳县"
          },
          {
            "Code": "361127",
            "Name": "余干县"
          },
          {
            "Code": "361128",
            "Name": "鄱阳县"
          },
          {
            "Code": "361129",
            "Name": "万年县"
          },
          {
            "Code": "361130",
            "Name": "婺源县"
          },
          {
            "Code": "361181",
            "Name": "德兴市"
          }
        ]
      }
    ]
  },
  {
    "Code": "370000",
    "Name": "山东省",
    "level": [
      {
        "Code": "370100",
        "Name": "济南市",
        "level": [
          {
            "Code": "370102",
            "Name": "历下区"
          },
          {
            "Code": "370103",
            "Name": "市中区"
          },
          {
            "Code": "370104",
            "Name": "槐荫区"
          },
          {
            "Code": "370105",
            "Name": "天桥区"
          },
          {
            "Code": "370112",
            "Name": "历城区"
          },
          {
            "Code": "370113",
            "Name": "长清区"
          },
          {
            "Code": "370124",
            "Name": "平阴县"
          },
          {
            "Code": "370125",
            "Name": "济阳县"
          },
          {
            "Code": "370126",
            "Name": "商河县"
          },
          {
            "Code": "370181",
            "Name": "章丘市"
          }
        ]
      },
      {
        "Code": "370200",
        "Name": "青岛市",
        "level": [
          {
            "Code": "370202",
            "Name": "市南区"
          },
          {
            "Code": "370203",
            "Name": "市北区"
          },
          {
            "Code": "370211",
            "Name": "黄岛区"
          },
          {
            "Code": "370212",
            "Name": "崂山区"
          },
          {
            "Code": "370213",
            "Name": "李沧区"
          },
          {
            "Code": "370214",
            "Name": "城阳区"
          },
          {
            "Code": "370281",
            "Name": "胶州市"
          },
          {
            "Code": "370282",
            "Name": "即墨市"
          },
          {
            "Code": "370283",
            "Name": "平度市"
          },
          {
            "Code": "370285",
            "Name": "莱西市"
          }
        ]
      },
      {
        "Code": "370300",
        "Name": "淄博市",
        "level": [
          {
            "Code": "370302",
            "Name": "淄川区"
          },
          {
            "Code": "370303",
            "Name": "张店区"
          },
          {
            "Code": "370304",
            "Name": "博山区"
          },
          {
            "Code": "370305",
            "Name": "临淄区"
          },
          {
            "Code": "370306",
            "Name": "周村区"
          },
          {
            "Code": "370321",
            "Name": "桓台县"
          },
          {
            "Code": "370322",
            "Name": "高青县"
          },
          {
            "Code": "370323",
            "Name": "沂源县"
          }
        ]
      },
      {
        "Code": "370400",
        "Name": "枣庄市",
        "level": [
          {
            "Code": "370402",
            "Name": "市中区"
          },
          {
            "Code": "370403",
            "Name": "薛城区"
          },
          {
            "Code": "370404",
            "Name": "峄城区"
          },
          {
            "Code": "370405",
            "Name": "台儿庄区"
          },
          {
            "Code": "370406",
            "Name": "山亭区"
          },
          {
            "Code": "370481",
            "Name": "滕州市"
          }
        ]
      },
      {
        "Code": "370500",
        "Name": "东营市",
        "level": [
          {
            "Code": "370502",
            "Name": "东营区"
          },
          {
            "Code": "370503",
            "Name": "河口区"
          },
          {
            "Code": "370521",
            "Name": "垦利县"
          },
          {
            "Code": "370522",
            "Name": "利津县"
          },
          {
            "Code": "370523",
            "Name": "广饶县"
          }
        ]
      },
      {
        "Code": "370600",
        "Name": "烟台市",
        "level": [
          {
            "Code": "370602",
            "Name": "芝罘区"
          },
          {
            "Code": "370611",
            "Name": "福山区"
          },
          {
            "Code": "370612",
            "Name": "牟平区"
          },
          {
            "Code": "370613",
            "Name": "莱山区"
          },
          {
            "Code": "370634",
            "Name": "长岛县"
          },
          {
            "Code": "370681",
            "Name": "龙口市"
          },
          {
            "Code": "370682",
            "Name": "莱阳市"
          },
          {
            "Code": "370683",
            "Name": "莱州市"
          },
          {
            "Code": "370684",
            "Name": "蓬莱市"
          },
          {
            "Code": "370685",
            "Name": "招远市"
          },
          {
            "Code": "370686",
            "Name": "栖霞市"
          },
          {
            "Code": "370687",
            "Name": "海阳市"
          }
        ]
      },
      {
        "Code": "370700",
        "Name": "潍坊市",
        "level": [
          {
            "Code": "370702",
            "Name": "潍城区"
          },
          {
            "Code": "370703",
            "Name": "寒亭区"
          },
          {
            "Code": "370704",
            "Name": "坊子区"
          },
          {
            "Code": "370705",
            "Name": "奎文区"
          },
          {
            "Code": "370724",
            "Name": "临朐县"
          },
          {
            "Code": "370725",
            "Name": "昌乐县"
          },
          {
            "Code": "370781",
            "Name": "青州市"
          },
          {
            "Code": "370782",
            "Name": "诸城市"
          },
          {
            "Code": "370783",
            "Name": "寿光市"
          },
          {
            "Code": "370784",
            "Name": "安丘市"
          },
          {
            "Code": "370785",
            "Name": "高密市"
          },
          {
            "Code": "370786",
            "Name": "昌邑市"
          }
        ]
      },
      {
        "Code": "370800",
        "Name": "济宁市",
        "level": [
          {
            "Code": "370802",
            "Name": "市中区"
          },
          {
            "Code": "370811",
            "Name": "任城区"
          },
          {
            "Code": "370826",
            "Name": "微山县"
          },
          {
            "Code": "370827",
            "Name": "鱼台县"
          },
          {
            "Code": "370828",
            "Name": "金乡县"
          },
          {
            "Code": "370829",
            "Name": "嘉祥县"
          },
          {
            "Code": "370830",
            "Name": "汶上县"
          },
          {
            "Code": "370831",
            "Name": "泗水县"
          },
          {
            "Code": "370832",
            "Name": "梁山县"
          },
          {
            "Code": "370881",
            "Name": "曲阜市"
          },
          {
            "Code": "370882",
            "Name": "兖州市"
          },
          {
            "Code": "370883",
            "Name": "邹城市"
          }
        ]
      },
      {
        "Code": "370900",
        "Name": "泰安市",
        "level": [
          {
            "Code": "370902",
            "Name": "泰山区"
          },
          {
            "Code": "370903",
            "Name": "岱岳区"
          },
          {
            "Code": "370921",
            "Name": "宁阳县"
          },
          {
            "Code": "370923",
            "Name": "东平县"
          },
          {
            "Code": "370982",
            "Name": "新泰市"
          },
          {
            "Code": "370983",
            "Name": "肥城市"
          }
        ]
      },
      {
        "Code": "371000",
        "Name": "威海市",
        "level": [
          {
            "Code": "371002",
            "Name": "环翠区"
          },
          {
            "Code": "371081",
            "Name": "文登市"
          },
          {
            "Code": "371082",
            "Name": "荣成市"
          },
          {
            "Code": "371083",
            "Name": "乳山市"
          }
        ]
      },
      {
        "Code": "371100",
        "Name": "日照市",
        "level": [
          {
            "Code": "371102",
            "Name": "东港区"
          },
          {
            "Code": "371103",
            "Name": "岚山区"
          },
          {
            "Code": "371121",
            "Name": "五莲县"
          },
          {
            "Code": "371122",
            "Name": "莒县"
          }
        ]
      },
      {
        "Code": "371200",
        "Name": "莱芜市",
        "level": [
          {
            "Code": "371202",
            "Name": "莱城区"
          },
          {
            "Code": "371203",
            "Name": "钢城区"
          }
        ]
      },
      {
        "Code": "371300",
        "Name": "临沂市",
        "level": [
          {
            "Code": "371302",
            "Name": "兰山区"
          },
          {
            "Code": "371311",
            "Name": "罗庄区"
          },
          {
            "Code": "371312",
            "Name": "河东区"
          },
          {
            "Code": "371321",
            "Name": "沂南县"
          },
          {
            "Code": "371322",
            "Name": "郯城县"
          },
          {
            "Code": "371323",
            "Name": "沂水县"
          },
          {
            "Code": "371324",
            "Name": "苍山县"
          },
          {
            "Code": "371325",
            "Name": "费县"
          },
          {
            "Code": "371326",
            "Name": "平邑县"
          },
          {
            "Code": "371327",
            "Name": "莒南县"
          },
          {
            "Code": "371328",
            "Name": "蒙阴县"
          },
          {
            "Code": "371329",
            "Name": "临沭县"
          }
        ]
      },
      {
        "Code": "371400",
        "Name": "德州市",
        "level": [
          {
            "Code": "371402",
            "Name": "德城区"
          },
          {
            "Code": "371421",
            "Name": "陵县"
          },
          {
            "Code": "371422",
            "Name": "宁津县"
          },
          {
            "Code": "371423",
            "Name": "庆云县"
          },
          {
            "Code": "371424",
            "Name": "临邑县"
          },
          {
            "Code": "371425",
            "Name": "齐河县"
          },
          {
            "Code": "371426",
            "Name": "平原县"
          },
          {
            "Code": "371427",
            "Name": "夏津县"
          },
          {
            "Code": "371428",
            "Name": "武城县"
          },
          {
            "Code": "371481",
            "Name": "乐陵市"
          },
          {
            "Code": "371482",
            "Name": "禹城市"
          }
        ]
      },
      {
        "Code": "371500",
        "Name": "聊城市",
        "level": [
          {
            "Code": "371502",
            "Name": "东昌府区"
          },
          {
            "Code": "371521",
            "Name": "阳谷县"
          },
          {
            "Code": "371522",
            "Name": "莘县"
          },
          {
            "Code": "371523",
            "Name": "茌平县"
          },
          {
            "Code": "371524",
            "Name": "东阿县"
          },
          {
            "Code": "371525",
            "Name": "冠县"
          },
          {
            "Code": "371526",
            "Name": "高唐县"
          },
          {
            "Code": "371581",
            "Name": "临清市"
          }
        ]
      },
      {
        "Code": "371600",
        "Name": "滨州市",
        "level": [
          {
            "Code": "371602",
            "Name": "滨城区"
          },
          {
            "Code": "371621",
            "Name": "惠民县"
          },
          {
            "Code": "371622",
            "Name": "阳信县"
          },
          {
            "Code": "371623",
            "Name": "无棣县"
          },
          {
            "Code": "371624",
            "Name": "沾化县"
          },
          {
            "Code": "371625",
            "Name": "博兴县"
          },
          {
            "Code": "371626",
            "Name": "邹平县"
          }
        ]
      },
      {
        "Code": "371700",
        "Name": "菏泽市",
        "level": [
          {
            "Code": "371702",
            "Name": "牡丹区"
          },
          {
            "Code": "371721",
            "Name": "曹县"
          },
          {
            "Code": "371722",
            "Name": "单县"
          },
          {
            "Code": "371723",
            "Name": "成武县"
          },
          {
            "Code": "371724",
            "Name": "巨野县"
          },
          {
            "Code": "371725",
            "Name": "郓城县"
          },
          {
            "Code": "371726",
            "Name": "鄄城县"
          },
          {
            "Code": "371727",
            "Name": "定陶县"
          },
          {
            "Code": "371728",
            "Name": "东明县"
          }
        ]
      }
    ]
  },
  {
    "Code": "410000",
    "Name": "河南省",
    "level": [
      {
        "Code": "410100",
        "Name": "郑州市",
        "level": [
          {
            "Code": "410102",
            "Name": "中原区"
          },
          {
            "Code": "410103",
            "Name": "二七区"
          },
          {
            "Code": "410104",
            "Name": "管城回族区"
          },
          {
            "Code": "410105",
            "Name": "金水区"
          },
          {
            "Code": "410106",
            "Name": "上街区"
          },
          {
            "Code": "410108",
            "Name": "惠济区"
          },
          {
            "Code": "410122",
            "Name": "中牟县"
          },
          {
            "Code": "410181",
            "Name": "巩义市"
          },
          {
            "Code": "410182",
            "Name": "荥阳市"
          },
          {
            "Code": "410183",
            "Name": "新密市"
          },
          {
            "Code": "410184",
            "Name": "新郑市"
          },
          {
            "Code": "410185",
            "Name": "登封市"
          }
        ]
      },
      {
        "Code": "410200",
        "Name": "开封市",
        "level": [
          {
            "Code": "410202",
            "Name": "龙亭区"
          },
          {
            "Code": "410203",
            "Name": "顺河回族区"
          },
          {
            "Code": "410204",
            "Name": "鼓楼区"
          },
          {
            "Code": "410205",
            "Name": "禹王台区"
          },
          {
            "Code": "410211",
            "Name": "金明区"
          },
          {
            "Code": "410221",
            "Name": "杞县"
          },
          {
            "Code": "410222",
            "Name": "通许县"
          },
          {
            "Code": "410223",
            "Name": "尉氏县"
          },
          {
            "Code": "410224",
            "Name": "开封县"
          },
          {
            "Code": "410225",
            "Name": "兰考县"
          }
        ]
      },
      {
        "Code": "410300",
        "Name": "洛阳市",
        "level": [
          {
            "Code": "410302",
            "Name": "老城区"
          },
          {
            "Code": "410303",
            "Name": "西工区"
          },
          {
            "Code": "410304",
            "Name": "e河回族区"
          },
          {
            "Code": "410305",
            "Name": "涧西区"
          },
          {
            "Code": "410306",
            "Name": "吉利区"
          },
          {
            "Code": "410307",
            "Name": "洛龙区"
          },
          {
            "Code": "410322",
            "Name": "孟津县"
          },
          {
            "Code": "410323",
            "Name": "新安县"
          },
          {
            "Code": "410324",
            "Name": "栾川县"
          },
          {
            "Code": "410325",
            "Name": "嵩县"
          },
          {
            "Code": "410326",
            "Name": "汝阳县"
          },
          {
            "Code": "410327",
            "Name": "宜阳县"
          },
          {
            "Code": "410328",
            "Name": "洛宁县"
          },
          {
            "Code": "410329",
            "Name": "伊川县"
          },
          {
            "Code": "410381",
            "Name": "偃师市"
          }
        ]
      },
      {
        "Code": "410400",
        "Name": "平顶山市",
        "level": [
          {
            "Code": "410402",
            "Name": "新华区"
          },
          {
            "Code": "410403",
            "Name": "卫东区"
          },
          {
            "Code": "410404",
            "Name": "石龙区"
          },
          {
            "Code": "410411",
            "Name": "湛河区"
          },
          {
            "Code": "410421",
            "Name": "宝丰县"
          },
          {
            "Code": "410422",
            "Name": "叶县"
          },
          {
            "Code": "410423",
            "Name": "鲁山县"
          },
          {
            "Code": "410425",
            "Name": "郏县"
          },
          {
            "Code": "410481",
            "Name": "舞钢市"
          },
          {
            "Code": "410482",
            "Name": "汝州市"
          }
        ]
      },
      {
        "Code": "410500",
        "Name": "安阳市",
        "level": [
          {
            "Code": "410502",
            "Name": "文峰区"
          },
          {
            "Code": "410503",
            "Name": "北关区"
          },
          {
            "Code": "410505",
            "Name": "殷都区"
          },
          {
            "Code": "410506",
            "Name": "龙安区"
          },
          {
            "Code": "410522",
            "Name": "安阳县"
          },
          {
            "Code": "410523",
            "Name": "汤阴县"
          },
          {
            "Code": "410526",
            "Name": "滑县"
          },
          {
            "Code": "410527",
            "Name": "内黄县"
          },
          {
            "Code": "410581",
            "Name": "林州市"
          }
        ]
      },
      {
        "Code": "410600",
        "Name": "鹤壁市",
        "level": [
          {
            "Code": "410602",
            "Name": "鹤山区"
          },
          {
            "Code": "410603",
            "Name": "山城区"
          },
          {
            "Code": "410611",
            "Name": "淇滨区"
          },
          {
            "Code": "410621",
            "Name": "浚县"
          },
          {
            "Code": "410622",
            "Name": "淇县"
          }
        ]
      },
      {
        "Code": "410700",
        "Name": "新乡市",
        "level": [
          {
            "Code": "410702",
            "Name": "红旗区"
          },
          {
            "Code": "410703",
            "Name": "卫滨区"
          },
          {
            "Code": "410704",
            "Name": "凤泉区"
          },
          {
            "Code": "410711",
            "Name": "牧野区"
          },
          {
            "Code": "410721",
            "Name": "新乡县"
          },
          {
            "Code": "410724",
            "Name": "获嘉县"
          },
          {
            "Code": "410725",
            "Name": "原阳县"
          },
          {
            "Code": "410726",
            "Name": "延津县"
          },
          {
            "Code": "410727",
            "Name": "封丘县"
          },
          {
            "Code": "410728",
            "Name": "长垣县"
          },
          {
            "Code": "410781",
            "Name": "卫辉市"
          },
          {
            "Code": "410782",
            "Name": "辉县市"
          }
        ]
      },
      {
        "Code": "410800",
        "Name": "焦作市",
        "level": [
          {
            "Code": "410802",
            "Name": "解放区"
          },
          {
            "Code": "410803",
            "Name": "中站区"
          },
          {
            "Code": "410804",
            "Name": "马村区"
          },
          {
            "Code": "410811",
            "Name": "山阳区"
          },
          {
            "Code": "410821",
            "Name": "修武县"
          },
          {
            "Code": "410822",
            "Name": "博爱县"
          },
          {
            "Code": "410823",
            "Name": "武陟县"
          },
          {
            "Code": "410825",
            "Name": "温县"
          },
          {
            "Code": "410882",
            "Name": "沁阳市"
          },
          {
            "Code": "410883",
            "Name": "孟州市"
          }
        ]
      },
      {
        "Code": "410881",
        "Name": "济源市",
        "level": [
          {
            "Code": "419001001",
            "Name": "沁园街道"
          },
          {
            "Code": "419001002",
            "Name": "济水街道"
          },
          {
            "Code": "419001003",
            "Name": "北海街道"
          },
          {
            "Code": "419001004",
            "Name": "天坛街道"
          },
          {
            "Code": "419001005",
            "Name": "玉泉街道"
          },
          {
            "Code": "419001100",
            "Name": "克井镇"
          },
          {
            "Code": "419001101",
            "Name": "五龙口镇"
          },
          {
            "Code": "419001102",
            "Name": "轵城镇"
          },
          {
            "Code": "419001103",
            "Name": "承留镇"
          },
          {
            "Code": "419001104",
            "Name": "邵原镇"
          },
          {
            "Code": "419001105",
            "Name": "坡头镇"
          },
          {
            "Code": "419001106",
            "Name": "梨林镇"
          },
          {
            "Code": "419001107",
            "Name": "大峪镇"
          },
          {
            "Code": "419001108",
            "Name": "思礼镇"
          },
          {
            "Code": "419001109",
            "Name": "王屋镇"
          },
          {
            "Code": "419001110",
            "Name": "下冶镇"
          }
        ]
      },
      {
        "Code": "410900",
        "Name": "濮阳市",
        "level": [
          {
            "Code": "410902",
            "Name": "华龙区"
          },
          {
            "Code": "410922",
            "Name": "清丰县"
          },
          {
            "Code": "410923",
            "Name": "南乐县"
          },
          {
            "Code": "410926",
            "Name": "范县"
          },
          {
            "Code": "410927",
            "Name": "台前县"
          },
          {
            "Code": "410928",
            "Name": "濮阳县"
          }
        ]
      },
      {
        "Code": "411000",
        "Name": "许昌市",
        "level": [
          {
            "Code": "411002",
            "Name": "魏都区"
          },
          {
            "Code": "411023",
            "Name": "许昌县"
          },
          {
            "Code": "411024",
            "Name": "鄢陵县"
          },
          {
            "Code": "411025",
            "Name": "襄城县"
          },
          {
            "Code": "411081",
            "Name": "禹州市"
          },
          {
            "Code": "411082",
            "Name": "长葛市"
          }
        ]
      },
      {
        "Code": "411100",
        "Name": "漯河市",
        "level": [
          {
            "Code": "411102",
            "Name": "源汇区"
          },
          {
            "Code": "411103",
            "Name": "郾城区"
          },
          {
            "Code": "411104",
            "Name": "召陵区"
          },
          {
            "Code": "411121",
            "Name": "舞阳县"
          },
          {
            "Code": "411122",
            "Name": "临颍县"
          }
        ]
      },
      {
        "Code": "411200",
        "Name": "三门峡市",
        "level": [
          {
            "Code": "411202",
            "Name": "湖滨区"
          },
          {
            "Code": "411221",
            "Name": "渑池县"
          },
          {
            "Code": "411222",
            "Name": "陕县"
          },
          {
            "Code": "411224",
            "Name": "卢氏县"
          },
          {
            "Code": "411281",
            "Name": "义马市"
          },
          {
            "Code": "411282",
            "Name": "灵宝市"
          }
        ]
      },
      {
        "Code": "411300",
        "Name": "南阳市",
        "level": [
          {
            "Code": "411302",
            "Name": "宛城区"
          },
          {
            "Code": "411303",
            "Name": "卧龙区"
          },
          {
            "Code": "411321",
            "Name": "南召县"
          },
          {
            "Code": "411322",
            "Name": "方城县"
          },
          {
            "Code": "411323",
            "Name": "西峡县"
          },
          {
            "Code": "411324",
            "Name": "镇平县"
          },
          {
            "Code": "411325",
            "Name": "内乡县"
          },
          {
            "Code": "411326",
            "Name": "淅川县"
          },
          {
            "Code": "411327",
            "Name": "社旗县"
          },
          {
            "Code": "411328",
            "Name": "唐河县"
          },
          {
            "Code": "411329",
            "Name": "新野县"
          },
          {
            "Code": "411330",
            "Name": "桐柏县"
          },
          {
            "Code": "411381",
            "Name": "邓州市"
          }
        ]
      },
      {
        "Code": "411400",
        "Name": "商丘市",
        "level": [
          {
            "Code": "411402",
            "Name": "梁园区"
          },
          {
            "Code": "411403",
            "Name": "睢阳区"
          },
          {
            "Code": "411421",
            "Name": "民权县"
          },
          {
            "Code": "411422",
            "Name": "睢县"
          },
          {
            "Code": "411423",
            "Name": "宁陵县"
          },
          {
            "Code": "411424",
            "Name": "柘城县"
          },
          {
            "Code": "411425",
            "Name": "虞城县"
          },
          {
            "Code": "411426",
            "Name": "夏邑县"
          },
          {
            "Code": "411481",
            "Name": "永城市"
          }
        ]
      },
      {
        "Code": "411500",
        "Name": "信阳市",
        "level": [
          {
            "Code": "411502",
            "Name": "浉河区"
          },
          {
            "Code": "411503",
            "Name": "平桥区"
          },
          {
            "Code": "411521",
            "Name": "罗山县"
          },
          {
            "Code": "411522",
            "Name": "光山县"
          },
          {
            "Code": "411523",
            "Name": "新县"
          },
          {
            "Code": "411524",
            "Name": "商城县"
          },
          {
            "Code": "411525",
            "Name": "固始县"
          },
          {
            "Code": "411526",
            "Name": "潢川县"
          },
          {
            "Code": "411527",
            "Name": "淮滨县"
          },
          {
            "Code": "411528",
            "Name": "息县"
          }
        ]
      },
      {
        "Code": "411600",
        "Name": "周口市",
        "level": [
          {
            "Code": "411602",
            "Name": "川汇区"
          },
          {
            "Code": "411621",
            "Name": "扶沟县"
          },
          {
            "Code": "411622",
            "Name": "西华县"
          },
          {
            "Code": "411623",
            "Name": "商水县"
          },
          {
            "Code": "411624",
            "Name": "沈丘县"
          },
          {
            "Code": "411625",
            "Name": "郸城县"
          },
          {
            "Code": "411626",
            "Name": "淮阳县"
          },
          {
            "Code": "411627",
            "Name": "太康县"
          },
          {
            "Code": "411628",
            "Name": "鹿邑县"
          },
          {
            "Code": "411681",
            "Name": "项城市"
          }
        ]
      },
      {
        "Code": "411700",
        "Name": "驻马店市",
        "level": [
          {
            "Code": "411702",
            "Name": "驿城区"
          },
          {
            "Code": "411721",
            "Name": "西平县"
          },
          {
            "Code": "411722",
            "Name": "上蔡县"
          },
          {
            "Code": "411723",
            "Name": "平舆县"
          },
          {
            "Code": "411724",
            "Name": "正阳县"
          },
          {
            "Code": "411725",
            "Name": "确山县"
          },
          {
            "Code": "411726",
            "Name": "泌阳县"
          },
          {
            "Code": "411727",
            "Name": "汝南县"
          },
          {
            "Code": "411728",
            "Name": "遂平县"
          },
          {
            "Code": "411729",
            "Name": "新蔡县"
          }
        ]
      }
    ]
  },
  {
    "Code": "420000",
    "Name": "湖北省",
    "level": [
      {
        "Code": "420100",
        "Name": "武汉市",
        "level": [
          {
            "Code": "420102",
            "Name": "江岸区"
          },
          {
            "Code": "420103",
            "Name": "江汉区"
          },
          {
            "Code": "420104",
            "Name": "硚口区"
          },
          {
            "Code": "420105",
            "Name": "汉阳区"
          },
          {
            "Code": "420106",
            "Name": "武昌区"
          },
          {
            "Code": "420107",
            "Name": "青山区"
          },
          {
            "Code": "420111",
            "Name": "洪山区"
          },
          {
            "Code": "420112",
            "Name": "东西湖区"
          },
          {
            "Code": "420113",
            "Name": "汉南区"
          },
          {
            "Code": "420114",
            "Name": "蔡甸区"
          },
          {
            "Code": "420115",
            "Name": "江夏区"
          },
          {
            "Code": "420116",
            "Name": "黄陂区"
          },
          {
            "Code": "420117",
            "Name": "新洲区"
          }
        ]
      },
      {
        "Code": "420200",
        "Name": "黄石市",
        "level": [
          {
            "Code": "420202",
            "Name": "黄石港区"
          },
          {
            "Code": "420203",
            "Name": "西塞山区"
          },
          {
            "Code": "420204",
            "Name": "下陆区"
          },
          {
            "Code": "420205",
            "Name": "铁山区"
          },
          {
            "Code": "420222",
            "Name": "阳新县"
          },
          {
            "Code": "420281",
            "Name": "大冶市"
          }
        ]
      },
      {
        "Code": "420300",
        "Name": "十堰市",
        "level": [
          {
            "Code": "420302",
            "Name": "茅箭区"
          },
          {
            "Code": "420303",
            "Name": "张湾区"
          },
          {
            "Code": "420321",
            "Name": "郧县"
          },
          {
            "Code": "420322",
            "Name": "郧西县"
          },
          {
            "Code": "420323",
            "Name": "竹山县"
          },
          {
            "Code": "420324",
            "Name": "竹溪县"
          },
          {
            "Code": "420325",
            "Name": "房县"
          },
          {
            "Code": "420381",
            "Name": "丹江口市"
          }
        ]
      },
      {
        "Code": "420500",
        "Name": "宜昌市",
        "level": [
          {
            "Code": "420502",
            "Name": "西陵区"
          },
          {
            "Code": "420503",
            "Name": "伍家岗区"
          },
          {
            "Code": "420504",
            "Name": "点军区"
          },
          {
            "Code": "420505",
            "Name": "猇亭区"
          },
          {
            "Code": "420506",
            "Name": "夷陵区"
          },
          {
            "Code": "420525",
            "Name": "远安县"
          },
          {
            "Code": "420526",
            "Name": "兴山县"
          },
          {
            "Code": "420527",
            "Name": "秭归县"
          },
          {
            "Code": "420528",
            "Name": "长阳土家族自治县"
          },
          {
            "Code": "420529",
            "Name": "五峰土家族自治县"
          },
          {
            "Code": "420581",
            "Name": "宜都市"
          },
          {
            "Code": "420582",
            "Name": "当阳市"
          },
          {
            "Code": "420583",
            "Name": "枝江市"
          }
        ]
      },
      {
        "Code": "420600",
        "Name": "襄阳市",
        "level": [
          {
            "Code": "420602",
            "Name": "襄城区"
          },
          {
            "Code": "420606",
            "Name": "樊城区"
          },
          {
            "Code": "420607",
            "Name": "襄州区"
          },
          {
            "Code": "420624",
            "Name": "南漳县"
          },
          {
            "Code": "420625",
            "Name": "谷城县"
          },
          {
            "Code": "420626",
            "Name": "保康县"
          },
          {
            "Code": "420682",
            "Name": "老河口市"
          },
          {
            "Code": "420683",
            "Name": "枣阳市"
          },
          {
            "Code": "420684",
            "Name": "宜城市"
          }
        ]
      },
      {
        "Code": "420700",
        "Name": "鄂州市",
        "level": [
          {
            "Code": "420702",
            "Name": "梁子湖区"
          },
          {
            "Code": "420703",
            "Name": "华容区"
          },
          {
            "Code": "420704",
            "Name": "鄂城区"
          }
        ]
      },
      {
        "Code": "420800",
        "Name": "荆门市",
        "level": [
          {
            "Code": "420802",
            "Name": "东宝区"
          },
          {
            "Code": "420804",
            "Name": "掇刀区"
          },
          {
            "Code": "420821",
            "Name": "京山县"
          },
          {
            "Code": "420822",
            "Name": "沙洋县"
          },
          {
            "Code": "420881",
            "Name": "钟祥市"
          }
        ]
      },
      {
        "Code": "420900",
        "Name": "孝感市",
        "level": [
          {
            "Code": "420902",
            "Name": "孝南区"
          },
          {
            "Code": "420921",
            "Name": "孝昌县"
          },
          {
            "Code": "420922",
            "Name": "大悟县"
          },
          {
            "Code": "420923",
            "Name": "云梦县"
          },
          {
            "Code": "420981",
            "Name": "应城市"
          },
          {
            "Code": "420982",
            "Name": "安陆市"
          },
          {
            "Code": "420984",
            "Name": "汉川市"
          }
        ]
      },
      {
        "Code": "421000",
        "Name": "荆州市",
        "level": [
          {
            "Code": "421002",
            "Name": "沙市区"
          },
          {
            "Code": "421003",
            "Name": "荆州区"
          },
          {
            "Code": "421022",
            "Name": "公安县"
          },
          {
            "Code": "421023",
            "Name": "监利县"
          },
          {
            "Code": "421024",
            "Name": "江陵县"
          },
          {
            "Code": "421081",
            "Name": "石首市"
          },
          {
            "Code": "421083",
            "Name": "洪湖市"
          },
          {
            "Code": "421087",
            "Name": "松滋市"
          }
        ]
      },
      {
        "Code": "421100",
        "Name": "黄冈市",
        "level": [
          {
            "Code": "421102",
            "Name": "黄州区"
          },
          {
            "Code": "421121",
            "Name": "团风县"
          },
          {
            "Code": "421122",
            "Name": "红安县"
          },
          {
            "Code": "421123",
            "Name": "罗田县"
          },
          {
            "Code": "421124",
            "Name": "英山县"
          },
          {
            "Code": "421125",
            "Name": "浠水县"
          },
          {
            "Code": "421126",
            "Name": "蕲春县"
          },
          {
            "Code": "421127",
            "Name": "黄梅县"
          },
          {
            "Code": "421181",
            "Name": "麻城市"
          },
          {
            "Code": "421182",
            "Name": "武穴市"
          }
        ]
      },
      {
        "Code": "421200",
        "Name": "咸宁市",
        "level": [
          {
            "Code": "421202",
            "Name": "咸安区"
          },
          {
            "Code": "421221",
            "Name": "嘉鱼县"
          },
          {
            "Code": "421222",
            "Name": "通城县"
          },
          {
            "Code": "421223",
            "Name": "崇阳县"
          },
          {
            "Code": "421224",
            "Name": "通山县"
          },
          {
            "Code": "421281",
            "Name": "赤壁市"
          }
        ]
      },
      {
        "Code": "421300",
        "Name": "随州市",
        "level": [
          {
            "Code": "421302",
            "Name": "曾都区"
          },
          {
            "Code": "421321",
            "Name": "随县"
          },
          {
            "Code": "421381",
            "Name": "广水市"
          }
        ]
      },
      {
        "Code": "422800",
        "Name": "恩施土家族苗族自治州",
        "level": [
          {
            "Code": "422801",
            "Name": "恩施市"
          },
          {
            "Code": "422802",
            "Name": "利川市"
          },
          {
            "Code": "422822",
            "Name": "建始县"
          },
          {
            "Code": "422823",
            "Name": "巴东县"
          },
          {
            "Code": "422825",
            "Name": "宣恩县"
          },
          {
            "Code": "422826",
            "Name": "咸丰县"
          },
          {
            "Code": "422827",
            "Name": "来凤县"
          },
          {
            "Code": "422828",
            "Name": "鹤峰县"
          }
        ]
      },
      {
        "Code": "429004",
        "Name": "仙桃市",
        "level": [
          {
            "Code": "429004001",
            "Name": "沙嘴街道"
          },
          {
            "Code": "429004002",
            "Name": "干河街道"
          },
          {
            "Code": "429004003",
            "Name": "龙华山办事处"
          },
          {
            "Code": "429004100",
            "Name": "郑场镇"
          },
          {
            "Code": "429004101",
            "Name": "毛嘴镇"
          },
          {
            "Code": "429004102",
            "Name": "豆河镇"
          },
          {
            "Code": "429004103",
            "Name": "三伏潭镇"
          },
          {
            "Code": "429004104",
            "Name": "胡场镇"
          },
          {
            "Code": "429004105",
            "Name": "长倘口镇"
          },
          {
            "Code": "429004106",
            "Name": "西流河镇"
          },
          {
            "Code": "429004107",
            "Name": "沙湖镇"
          },
          {
            "Code": "429004108",
            "Name": "杨林尾镇"
          },
          {
            "Code": "429004109",
            "Name": "彭场镇"
          },
          {
            "Code": "429004110",
            "Name": "张沟镇"
          },
          {
            "Code": "429004111",
            "Name": "郭河镇"
          },
          {
            "Code": "429004112",
            "Name": "沔城回族镇"
          },
          {
            "Code": "429004113",
            "Name": "通海口镇"
          },
          {
            "Code": "429004114",
            "Name": "陈场镇"
          },
          {
            "Code": "429004400",
            "Name": "工业园区"
          },
          {
            "Code": "429004401",
            "Name": "九合垸原种场"
          },
          {
            "Code": "429004402",
            "Name": "沙湖原种场"
          },
          {
            "Code": "429004404",
            "Name": "五湖渔场"
          },
          {
            "Code": "429004405",
            "Name": "赵西垸林场"
          },
          {
            "Code": "429004407",
            "Name": "畜禽良种场"
          },
          {
            "Code": "429004408",
            "Name": "排湖风景区"
          }
        ]
      },
      {
        "Code": "429005",
        "Name": "潜江市",
        "level": [
          {
            "Code": "429005001",
            "Name": "园林办事处"
          },
          {
            "Code": "429005002",
            "Name": "杨市办事处"
          },
          {
            "Code": "429005003",
            "Name": "周矶办事处"
          },
          {
            "Code": "429005004",
            "Name": "广华办事处"
          },
          {
            "Code": "429005005",
            "Name": "泰丰办事处"
          },
          {
            "Code": "429005006",
            "Name": "高场办事处"
          },
          {
            "Code": "429005100",
            "Name": "竹根滩镇"
          },
          {
            "Code": "429005101",
            "Name": "渔洋镇"
          },
          {
            "Code": "429005102",
            "Name": "王场镇"
          },
          {
            "Code": "429005103",
            "Name": "高石碑镇"
          },
          {
            "Code": "429005104",
            "Name": "熊口镇"
          },
          {
            "Code": "429005105",
            "Name": "老新镇"
          },
          {
            "Code": "429005106",
            "Name": "浩口镇"
          },
          {
            "Code": "429005107",
            "Name": "积玉口镇"
          },
          {
            "Code": "429005108",
            "Name": "张金镇"
          },
          {
            "Code": "429005109",
            "Name": "龙湾镇"
          },
          {
            "Code": "429005400",
            "Name": "江汉石油管理局"
          },
          {
            "Code": "429005401",
            "Name": "潜江经济开发区"
          },
          {
            "Code": "429005450",
            "Name": "周矶管理区"
          },
          {
            "Code": "429005451",
            "Name": "后湖管理区"
          },
          {
            "Code": "429005452",
            "Name": "熊口管理区"
          },
          {
            "Code": "429005453",
            "Name": "总口管理区"
          },
          {
            "Code": "429005454",
            "Name": "白鹭湖管理区"
          },
          {
            "Code": "429005455",
            "Name": "运粮湖管理区"
          },
          {
            "Code": "429005457",
            "Name": "浩口原种场"
          }
        ]
      },
      {
        "Code": "429006",
        "Name": "天门市",
        "level": [
          {
            "Code": "429006001",
            "Name": "竟陵街道"
          },
          {
            "Code": "429006002",
            "Name": "侨乡街道开发区"
          },
          {
            "Code": "429006003",
            "Name": "杨林街道"
          },
          {
            "Code": "429006100",
            "Name": "多宝镇"
          },
          {
            "Code": "429006101",
            "Name": "拖市镇"
          },
          {
            "Code": "429006102",
            "Name": "张港镇"
          },
          {
            "Code": "429006103",
            "Name": "蒋场镇"
          },
          {
            "Code": "429006104",
            "Name": "汪场镇"
          },
          {
            "Code": "429006105",
            "Name": "渔薪镇"
          },
          {
            "Code": "429006106",
            "Name": "黄潭镇"
          },
          {
            "Code": "429006107",
            "Name": "岳口镇"
          },
          {
            "Code": "429006108",
            "Name": "横林镇"
          },
          {
            "Code": "429006109",
            "Name": "彭市镇"
          },
          {
            "Code": "429006110",
            "Name": "麻洋镇"
          },
          {
            "Code": "429006111",
            "Name": "多祥镇"
          },
          {
            "Code": "429006112",
            "Name": "干驿镇"
          },
          {
            "Code": "429006113",
            "Name": "马湾镇"
          },
          {
            "Code": "429006114",
            "Name": "卢市镇"
          },
          {
            "Code": "429006115",
            "Name": "小板镇"
          },
          {
            "Code": "429006116",
            "Name": "九真镇"
          },
          {
            "Code": "429006118",
            "Name": "皂市镇"
          },
          {
            "Code": "429006119",
            "Name": "胡市镇"
          },
          {
            "Code": "429006120",
            "Name": "石河镇"
          },
          {
            "Code": "429006121",
            "Name": "佛子山镇"
          },
          {
            "Code": "429006201",
            "Name": "净潭乡"
          },
          {
            "Code": "429006450",
            "Name": "蒋湖农场"
          },
          {
            "Code": "429006451",
            "Name": "白茅湖农场"
          },
          {
            "Code": "429006452",
            "Name": "沉湖管委会"
          }
        ]
      },
      {
        "Code": "429021",
        "Name": "神农架林区",
        "level": [
          {
            "Code": "429021100",
            "Name": "松柏镇"
          },
          {
            "Code": "429021101",
            "Name": "阳日镇"
          },
          {
            "Code": "429021102",
            "Name": "木鱼镇"
          },
          {
            "Code": "429021103",
            "Name": "红坪镇"
          },
          {
            "Code": "429021104",
            "Name": "新华镇"
          },
          {
            "Code": "429021105",
            "Name": "九湖镇"
          },
          {
            "Code": "429021200",
            "Name": "宋洛乡"
          },
          {
            "Code": "429021202",
            "Name": "下谷坪土家族乡"
          }
        ]
      }
    ]
  },
  {
    "Code": "430000",
    "Name": "湖南省",
    "level": [
      {
        "Code": "430100",
        "Name": "长沙市",
        "level": [
          {
            "Code": "430102",
            "Name": "芙蓉区"
          },
          {
            "Code": "430103",
            "Name": "天心区"
          },
          {
            "Code": "430104",
            "Name": "岳麓区"
          },
          {
            "Code": "430105",
            "Name": "开福区"
          },
          {
            "Code": "430111",
            "Name": "雨花区"
          },
          {
            "Code": "430121",
            "Name": "长沙县"
          },
          {
            "Code": "430122",
            "Name": "望城区"
          },
          {
            "Code": "430124",
            "Name": "宁乡县"
          },
          {
            "Code": "430181",
            "Name": "浏阳市"
          }
        ]
      },
      {
        "Code": "430200",
        "Name": "株洲市",
        "level": [
          {
            "Code": "430202",
            "Name": "荷塘区"
          },
          {
            "Code": "430203",
            "Name": "芦淞区"
          },
          {
            "Code": "430204",
            "Name": "石峰区"
          },
          {
            "Code": "430211",
            "Name": "天元区"
          },
          {
            "Code": "430221",
            "Name": "株洲县"
          },
          {
            "Code": "430223",
            "Name": "攸县"
          },
          {
            "Code": "430224",
            "Name": "茶陵县"
          },
          {
            "Code": "430225",
            "Name": "炎陵县"
          },
          {
            "Code": "430281",
            "Name": "醴陵市"
          }
        ]
      },
      {
        "Code": "430300",
        "Name": "湘潭市",
        "level": [
          {
            "Code": "430302",
            "Name": "雨湖区"
          },
          {
            "Code": "430304",
            "Name": "岳塘区"
          },
          {
            "Code": "430321",
            "Name": "湘潭县"
          },
          {
            "Code": "430381",
            "Name": "湘乡市"
          },
          {
            "Code": "430382",
            "Name": "韶山市"
          }
        ]
      },
      {
        "Code": "430400",
        "Name": "衡阳市",
        "level": [
          {
            "Code": "430405",
            "Name": "珠晖区"
          },
          {
            "Code": "430406",
            "Name": "雁峰区"
          },
          {
            "Code": "430407",
            "Name": "石鼓区"
          },
          {
            "Code": "430408",
            "Name": "蒸湘区"
          },
          {
            "Code": "430412",
            "Name": "南岳区"
          },
          {
            "Code": "430421",
            "Name": "衡阳县"
          },
          {
            "Code": "430422",
            "Name": "衡南县"
          },
          {
            "Code": "430423",
            "Name": "衡山县"
          },
          {
            "Code": "430424",
            "Name": "衡东县"
          },
          {
            "Code": "430426",
            "Name": "祁东县"
          },
          {
            "Code": "430481",
            "Name": "耒阳市"
          },
          {
            "Code": "430482",
            "Name": "常宁市"
          }
        ]
      },
      {
        "Code": "430500",
        "Name": "邵阳市",
        "level": [
          {
            "Code": "430502",
            "Name": "双清区"
          },
          {
            "Code": "430503",
            "Name": "大祥区"
          },
          {
            "Code": "430511",
            "Name": "北塔区"
          },
          {
            "Code": "430521",
            "Name": "邵东县"
          },
          {
            "Code": "430522",
            "Name": "新邵县"
          },
          {
            "Code": "430523",
            "Name": "邵阳县"
          },
          {
            "Code": "430524",
            "Name": "隆回县"
          },
          {
            "Code": "430525",
            "Name": "洞口县"
          },
          {
            "Code": "430527",
            "Name": "绥宁县"
          },
          {
            "Code": "430528",
            "Name": "新宁县"
          },
          {
            "Code": "430529",
            "Name": "城步苗族自治县"
          },
          {
            "Code": "430581",
            "Name": "武冈市"
          }
        ]
      },
      {
        "Code": "430600",
        "Name": "岳阳市",
        "level": [
          {
            "Code": "430602",
            "Name": "岳阳楼区"
          },
          {
            "Code": "430603",
            "Name": "云溪区"
          },
          {
            "Code": "430611",
            "Name": "君山区"
          },
          {
            "Code": "430621",
            "Name": "岳阳县"
          },
          {
            "Code": "430623",
            "Name": "华容县"
          },
          {
            "Code": "430624",
            "Name": "湘阴县"
          },
          {
            "Code": "430626",
            "Name": "平江县"
          },
          {
            "Code": "430681",
            "Name": "汨罗市"
          },
          {
            "Code": "430682",
            "Name": "临湘市"
          }
        ]
      },
      {
        "Code": "430700",
        "Name": "常德市",
        "level": [
          {
            "Code": "430702",
            "Name": "武陵区"
          },
          {
            "Code": "430703",
            "Name": "鼎城区"
          },
          {
            "Code": "430721",
            "Name": "安乡县"
          },
          {
            "Code": "430722",
            "Name": "汉寿县"
          },
          {
            "Code": "430723",
            "Name": "澧县"
          },
          {
            "Code": "430724",
            "Name": "临澧县"
          },
          {
            "Code": "430725",
            "Name": "桃源县"
          },
          {
            "Code": "430726",
            "Name": "石门县"
          },
          {
            "Code": "430781",
            "Name": "津市市"
          }
        ]
      },
      {
        "Code": "430800",
        "Name": "张家界市",
        "level": [
          {
            "Code": "430802",
            "Name": "永定区"
          },
          {
            "Code": "430811",
            "Name": "武陵源区"
          },
          {
            "Code": "430821",
            "Name": "慈利县"
          },
          {
            "Code": "430822",
            "Name": "桑植县"
          }
        ]
      },
      {
        "Code": "430900",
        "Name": "益阳市",
        "level": [
          {
            "Code": "430902",
            "Name": "资阳区"
          },
          {
            "Code": "430903",
            "Name": "赫山区"
          },
          {
            "Code": "430921",
            "Name": "南县"
          },
          {
            "Code": "430922",
            "Name": "桃江县"
          },
          {
            "Code": "430923",
            "Name": "安化县"
          },
          {
            "Code": "430981",
            "Name": "沅江市"
          }
        ]
      },
      {
        "Code": "431000",
        "Name": "郴州市",
        "level": [
          {
            "Code": "431002",
            "Name": "北湖区"
          },
          {
            "Code": "431003",
            "Name": "苏仙区"
          },
          {
            "Code": "431021",
            "Name": "桂阳县"
          },
          {
            "Code": "431022",
            "Name": "宜章县"
          },
          {
            "Code": "431023",
            "Name": "永兴县"
          },
          {
            "Code": "431024",
            "Name": "嘉禾县"
          },
          {
            "Code": "431025",
            "Name": "临武县"
          },
          {
            "Code": "431026",
            "Name": "汝城县"
          },
          {
            "Code": "431027",
            "Name": "桂东县"
          },
          {
            "Code": "431028",
            "Name": "安仁县"
          },
          {
            "Code": "431081",
            "Name": "资兴市"
          }
        ]
      },
      {
        "Code": "431100",
        "Name": "永州市",
        "level": [
          {
            "Code": "431102",
            "Name": "零陵区"
          },
          {
            "Code": "431103",
            "Name": "冷水滩区"
          },
          {
            "Code": "431121",
            "Name": "祁阳县"
          },
          {
            "Code": "431122",
            "Name": "东安县"
          },
          {
            "Code": "431123",
            "Name": "双牌县"
          },
          {
            "Code": "431124",
            "Name": "道县"
          },
          {
            "Code": "431125",
            "Name": "江永县"
          },
          {
            "Code": "431126",
            "Name": "宁远县"
          },
          {
            "Code": "431127",
            "Name": "蓝山县"
          },
          {
            "Code": "431128",
            "Name": "新田县"
          },
          {
            "Code": "431129",
            "Name": "江华瑶族自治县"
          }
        ]
      },
      {
        "Code": "431200",
        "Name": "怀化市",
        "level": [
          {
            "Code": "431202",
            "Name": "鹤城区"
          },
          {
            "Code": "431221",
            "Name": "中方县"
          },
          {
            "Code": "431222",
            "Name": "沅陵县"
          },
          {
            "Code": "431223",
            "Name": "辰溪县"
          },
          {
            "Code": "431224",
            "Name": "溆浦县"
          },
          {
            "Code": "431225",
            "Name": "会同县"
          },
          {
            "Code": "431226",
            "Name": "麻阳苗族自治县"
          },
          {
            "Code": "431227",
            "Name": "新晃侗族自治县"
          },
          {
            "Code": "431228",
            "Name": "芷江侗族自治县"
          },
          {
            "Code": "431229",
            "Name": "靖州苗族侗族自治县"
          },
          {
            "Code": "431230",
            "Name": "通道侗族自治县"
          },
          {
            "Code": "431281",
            "Name": "洪江市"
          }
        ]
      },
      {
        "Code": "431300",
        "Name": "娄底市",
        "level": [
          {
            "Code": "431302",
            "Name": "娄星区"
          },
          {
            "Code": "431321",
            "Name": "双峰县"
          },
          {
            "Code": "431322",
            "Name": "新化县"
          },
          {
            "Code": "431381",
            "Name": "冷水江市"
          },
          {
            "Code": "431382",
            "Name": "涟源市"
          }
        ]
      },
      {
        "Code": "433100",
        "Name": "湘西土家族苗族自治州",
        "level": [
          {
            "Code": "433101",
            "Name": "吉首市"
          },
          {
            "Code": "433122",
            "Name": "泸溪县"
          },
          {
            "Code": "433123",
            "Name": "凤凰县"
          },
          {
            "Code": "433124",
            "Name": "花垣县"
          },
          {
            "Code": "433125",
            "Name": "保靖县"
          },
          {
            "Code": "433126",
            "Name": "古丈县"
          },
          {
            "Code": "433127",
            "Name": "永顺县"
          },
          {
            "Code": "433130",
            "Name": "龙山县"
          }
        ]
      }
    ]
  },
  {
    "Code": "440000",
    "Name": "广东省",
    "level": [
      {
        "Code": "440100",
        "Name": "广州市",
        "level": [
          {
            "Code": "440103",
            "Name": "荔湾区"
          },
          {
            "Code": "440104",
            "Name": "越秀区"
          },
          {
            "Code": "440105",
            "Name": "海珠区"
          },
          {
            "Code": "440106",
            "Name": "天河区"
          },
          {
            "Code": "440111",
            "Name": "白云区"
          },
          {
            "Code": "440112",
            "Name": "黄埔区"
          },
          {
            "Code": "440113",
            "Name": "番禺区"
          },
          {
            "Code": "440114",
            "Name": "花都区"
          },
          {
            "Code": "440115",
            "Name": "南沙区"
          },
          {
            "Code": "440116",
            "Name": "萝岗区"
          },
          {
            "Code": "440183",
            "Name": "增城市"
          },
          {
            "Code": "440184",
            "Name": "从化市"
          }
        ]
      },
      {
        "Code": "440200",
        "Name": "韶关市",
        "level": [
          {
            "Code": "440203",
            "Name": "武江区"
          },
          {
            "Code": "440204",
            "Name": "浈江区"
          },
          {
            "Code": "440205",
            "Name": "曲江区"
          },
          {
            "Code": "440222",
            "Name": "始兴县"
          },
          {
            "Code": "440224",
            "Name": "仁化县"
          },
          {
            "Code": "440229",
            "Name": "翁源县"
          },
          {
            "Code": "440232",
            "Name": "乳源瑶族自治县"
          },
          {
            "Code": "440233",
            "Name": "新丰县"
          },
          {
            "Code": "440281",
            "Name": "乐昌市"
          },
          {
            "Code": "440282",
            "Name": "南雄市"
          }
        ]
      },
      {
        "Code": "440300",
        "Name": "深圳市",
        "level": [
          {
            "Code": "440303",
            "Name": "罗湖区"
          },
          {
            "Code": "440304",
            "Name": "福田区"
          },
          {
            "Code": "440305",
            "Name": "南山区"
          },
          {
            "Code": "440306",
            "Name": "宝安区"
          },
          {
            "Code": "440307",
            "Name": "龙岗区"
          },
          {
            "Code": "440308",
            "Name": "盐田区"
          },
          {
            "Code": "440320",
            "Name": "光明新区"
          },
          {
            "Code": "440321",
            "Name": "坪山新区"
          },
          {
            "Code": "440322",
            "Name": "大鹏新区"
          },
          {
            "Code": "440323",
            "Name": "龙华新区"
          }
        ]
      },
      {
        "Code": "440400",
        "Name": "珠海市",
        "level": [
          {
            "Code": "440402",
            "Name": "香洲区"
          },
          {
            "Code": "440403",
            "Name": "斗门区"
          },
          {
            "Code": "440404",
            "Name": "金湾区"
          }
        ]
      },
      {
        "Code": "440500",
        "Name": "汕头市",
        "level": [
          {
            "Code": "440507",
            "Name": "龙湖区"
          },
          {
            "Code": "440511",
            "Name": "金平区"
          },
          {
            "Code": "440512",
            "Name": "濠江区"
          },
          {
            "Code": "440513",
            "Name": "潮阳区"
          },
          {
            "Code": "440514",
            "Name": "潮南区"
          },
          {
            "Code": "440515",
            "Name": "澄海区"
          },
          {
            "Code": "440523",
            "Name": "南澳县"
          }
        ]
      },
      {
        "Code": "440600",
        "Name": "佛山市",
        "level": [
          {
            "Code": "440604",
            "Name": "禅城区"
          },
          {
            "Code": "440605",
            "Name": "南海区"
          },
          {
            "Code": "440606",
            "Name": "顺德区"
          },
          {
            "Code": "440607",
            "Name": "三水区"
          },
          {
            "Code": "440608",
            "Name": "高明区"
          }
        ]
      },
      {
        "Code": "440700",
        "Name": "江门市",
        "level": [
          {
            "Code": "440703",
            "Name": "蓬江区"
          },
          {
            "Code": "440704",
            "Name": "江海区"
          },
          {
            "Code": "440705",
            "Name": "新会区"
          },
          {
            "Code": "440781",
            "Name": "台山市"
          },
          {
            "Code": "440783",
            "Name": "开平市"
          },
          {
            "Code": "440784",
            "Name": "鹤山市"
          },
          {
            "Code": "440785",
            "Name": "恩平市"
          }
        ]
      },
      {
        "Code": "440800",
        "Name": "湛江市",
        "level": [
          {
            "Code": "440802",
            "Name": "赤坎区"
          },
          {
            "Code": "440803",
            "Name": "霞山区"
          },
          {
            "Code": "440804",
            "Name": "坡头区"
          },
          {
            "Code": "440811",
            "Name": "麻章区"
          },
          {
            "Code": "440823",
            "Name": "遂溪县"
          },
          {
            "Code": "440825",
            "Name": "徐闻县"
          },
          {
            "Code": "440881",
            "Name": "廉江市"
          },
          {
            "Code": "440882",
            "Name": "雷州市"
          },
          {
            "Code": "440883",
            "Name": "吴川市"
          }
        ]
      },
      {
        "Code": "440900",
        "Name": "茂名市",
        "level": [
          {
            "Code": "440902",
            "Name": "茂南区"
          },
          {
            "Code": "440903",
            "Name": "茂港区"
          },
          {
            "Code": "440923",
            "Name": "电白县"
          },
          {
            "Code": "440981",
            "Name": "高州市"
          },
          {
            "Code": "440982",
            "Name": "化州市"
          },
          {
            "Code": "440983",
            "Name": "信宜市"
          }
        ]
      },
      {
        "Code": "441200",
        "Name": "肇庆市",
        "level": [
          {
            "Code": "441202",
            "Name": "端州区"
          },
          {
            "Code": "441203",
            "Name": "鼎湖区"
          },
          {
            "Code": "441223",
            "Name": "广宁县"
          },
          {
            "Code": "441224",
            "Name": "怀集县"
          },
          {
            "Code": "441225",
            "Name": "封开县"
          },
          {
            "Code": "441226",
            "Name": "德庆县"
          },
          {
            "Code": "441283",
            "Name": "高要市"
          },
          {
            "Code": "441284",
            "Name": "四会市"
          }
        ]
      },
      {
        "Code": "441300",
        "Name": "惠州市",
        "level": [
          {
            "Code": "441302",
            "Name": "惠城区"
          },
          {
            "Code": "441303",
            "Name": "惠阳区"
          },
          {
            "Code": "441322",
            "Name": "博罗县"
          },
          {
            "Code": "441323",
            "Name": "惠东县"
          },
          {
            "Code": "441324",
            "Name": "龙门县"
          }
        ]
      },
      {
        "Code": "441400",
        "Name": "梅州市",
        "level": [
          {
            "Code": "441402",
            "Name": "梅江区"
          },
          {
            "Code": "441421",
            "Name": "梅县"
          },
          {
            "Code": "441422",
            "Name": "大埔县"
          },
          {
            "Code": "441423",
            "Name": "丰顺县"
          },
          {
            "Code": "441424",
            "Name": "五华县"
          },
          {
            "Code": "441426",
            "Name": "平远县"
          },
          {
            "Code": "441427",
            "Name": "蕉岭县"
          },
          {
            "Code": "441481",
            "Name": "兴宁市"
          }
        ]
      },
      {
        "Code": "441500",
        "Name": "汕尾市",
        "level": [
          {
            "Code": "441502",
            "Name": "城区"
          },
          {
            "Code": "441521",
            "Name": "海丰县"
          },
          {
            "Code": "441523",
            "Name": "陆河县"
          },
          {
            "Code": "441581",
            "Name": "陆丰市"
          }
        ]
      },
      {
        "Code": "441600",
        "Name": "河源市",
        "level": [
          {
            "Code": "441602",
            "Name": "源城区"
          },
          {
            "Code": "441621",
            "Name": "紫金县"
          },
          {
            "Code": "441622",
            "Name": "龙川县"
          },
          {
            "Code": "441623",
            "Name": "连平县"
          },
          {
            "Code": "441624",
            "Name": "和平县"
          },
          {
            "Code": "441625",
            "Name": "东源县"
          }
        ]
      },
      {
        "Code": "441700",
        "Name": "阳江市",
        "level": [
          {
            "Code": "441702",
            "Name": "江城区"
          },
          {
            "Code": "441721",
            "Name": "阳西县"
          },
          {
            "Code": "441723",
            "Name": "阳东县"
          },
          {
            "Code": "441781",
            "Name": "阳春市"
          }
        ]
      },
      {
        "Code": "441800",
        "Name": "清远市",
        "level": [
          {
            "Code": "441802",
            "Name": "清城区"
          },
          {
            "Code": "441821",
            "Name": "佛冈县"
          },
          {
            "Code": "441823",
            "Name": "阳山县"
          },
          {
            "Code": "441825",
            "Name": "连山壮族瑶族自治县"
          },
          {
            "Code": "441826",
            "Name": "连南瑶族自治县"
          },
          {
            "Code": "441827",
            "Name": "清新区"
          },
          {
            "Code": "441881",
            "Name": "英德市"
          },
          {
            "Code": "441882",
            "Name": "连州市"
          }
        ]
      },
      {
        "Code": "441900",
        "Name": "东莞市",
        "level": [
          {
            "Code": "441901003",
            "Name": "东城街道"
          },
          {
            "Code": "441901004",
            "Name": "南城街道"
          },
          {
            "Code": "441901005",
            "Name": "万江街道"
          },
          {
            "Code": "441901006",
            "Name": "莞城街道"
          },
          {
            "Code": "441901101",
            "Name": "石碣镇"
          },
          {
            "Code": "441901102",
            "Name": "石龙镇"
          },
          {
            "Code": "441901103",
            "Name": "茶山镇"
          },
          {
            "Code": "441901104",
            "Name": "石排镇"
          },
          {
            "Code": "441901105",
            "Name": "企石镇"
          },
          {
            "Code": "441901106",
            "Name": "横沥镇"
          },
          {
            "Code": "441901107",
            "Name": "桥头镇"
          },
          {
            "Code": "441901108",
            "Name": "谢岗镇"
          },
          {
            "Code": "441901109",
            "Name": "东坑镇"
          },
          {
            "Code": "441901110",
            "Name": "常平镇"
          },
          {
            "Code": "441901111",
            "Name": "寮步镇"
          },
          {
            "Code": "441901112",
            "Name": "樟木头镇"
          },
          {
            "Code": "441901113",
            "Name": "大朗镇"
          },
          {
            "Code": "441901114",
            "Name": "黄江镇"
          },
          {
            "Code": "441901115",
            "Name": "清溪镇"
          },
          {
            "Code": "441901116",
            "Name": "塘厦镇"
          },
          {
            "Code": "441901117",
            "Name": "凤岗镇"
          },
          {
            "Code": "441901118",
            "Name": "大岭山镇"
          },
          {
            "Code": "441901119",
            "Name": "长安镇"
          },
          {
            "Code": "441901121",
            "Name": "虎门镇"
          },
          {
            "Code": "441901122",
            "Name": "厚街镇"
          },
          {
            "Code": "441901123",
            "Name": "沙田镇"
          },
          {
            "Code": "441901124",
            "Name": "道滘镇"
          },
          {
            "Code": "441901125",
            "Name": "洪梅镇"
          },
          {
            "Code": "441901126",
            "Name": "麻涌镇"
          },
          {
            "Code": "441901127",
            "Name": "望牛墩镇"
          },
          {
            "Code": "441901128",
            "Name": "中堂镇"
          },
          {
            "Code": "441901129",
            "Name": "高埗镇"
          },
          {
            "Code": "441901401",
            "Name": "松山湖管委会"
          },
          {
            "Code": "441901402",
            "Name": "虎门港管委会"
          },
          {
            "Code": "441901403",
            "Name": "东莞生态园"
          }
        ]
      },
      {
        "Code": "442000",
        "Name": "中山市",
        "level": [
          {
            "Code": "442001001",
            "Name": "石岐区街道"
          },
          {
            "Code": "442001002",
            "Name": "东区街道"
          },
          {
            "Code": "442001003",
            "Name": "火炬开发区街道"
          },
          {
            "Code": "442001004",
            "Name": "西区街道"
          },
          {
            "Code": "442001005",
            "Name": "南区街道"
          },
          {
            "Code": "442001006",
            "Name": "五桂山街道"
          },
          {
            "Code": "442001100",
            "Name": "小榄镇"
          },
          {
            "Code": "442001101",
            "Name": "黄圃镇"
          },
          {
            "Code": "442001102",
            "Name": "民众镇"
          },
          {
            "Code": "442001103",
            "Name": "东凤镇"
          },
          {
            "Code": "442001104",
            "Name": "东升镇"
          },
          {
            "Code": "442001105",
            "Name": "古镇镇"
          },
          {
            "Code": "442001106",
            "Name": "沙溪镇"
          },
          {
            "Code": "442001107",
            "Name": "坦洲镇"
          },
          {
            "Code": "442001108",
            "Name": "港口镇"
          },
          {
            "Code": "442001109",
            "Name": "三角镇"
          },
          {
            "Code": "442001110",
            "Name": "横栏镇"
          },
          {
            "Code": "442001111",
            "Name": "南头镇"
          },
          {
            "Code": "442001112",
            "Name": "阜沙镇"
          },
          {
            "Code": "442001113",
            "Name": "南朗镇"
          },
          {
            "Code": "442001114",
            "Name": "三乡镇"
          },
          {
            "Code": "442001115",
            "Name": "板芙镇"
          },
          {
            "Code": "442001116",
            "Name": "大涌镇"
          },
          {
            "Code": "442001117",
            "Name": "神湾镇"
          }
        ]
      },
      {
        "Code": "442101",
        "Name": "东沙群岛",
        "level": []
      },
      {
        "Code": "445100",
        "Name": "潮州市",
        "level": [
          {
            "Code": "445102",
            "Name": "湘桥区"
          },
          {
            "Code": "445121",
            "Name": "潮安区"
          },
          {
            "Code": "445122",
            "Name": "饶平县"
          }
        ]
      },
      {
        "Code": "445200",
        "Name": "揭阳市",
        "level": [
          {
            "Code": "445202",
            "Name": "榕城区"
          },
          {
            "Code": "445221",
            "Name": "揭东区"
          },
          {
            "Code": "445222",
            "Name": "揭西县"
          },
          {
            "Code": "445224",
            "Name": "惠来县"
          },
          {
            "Code": "445281",
            "Name": "普宁市"
          }
        ]
      },
      {
        "Code": "445300",
        "Name": "云浮市",
        "level": [
          {
            "Code": "445302",
            "Name": "云城区"
          },
          {
            "Code": "445321",
            "Name": "新兴县"
          },
          {
            "Code": "445322",
            "Name": "郁南县"
          },
          {
            "Code": "445323",
            "Name": "云安县"
          },
          {
            "Code": "445381",
            "Name": "罗定市"
          }
        ]
      }
    ]
  },
  {
    "Code": "450000",
    "Name": "广西壮族自治区",
    "level": [
      {
        "Code": "450100",
        "Name": "南宁市",
        "level": [
          {
            "Code": "450102",
            "Name": "兴宁区"
          },
          {
            "Code": "450103",
            "Name": "青秀区"
          },
          {
            "Code": "450105",
            "Name": "江南区"
          },
          {
            "Code": "450107",
            "Name": "西乡塘区"
          },
          {
            "Code": "450108",
            "Name": "良庆区"
          },
          {
            "Code": "450109",
            "Name": "邕宁区"
          },
          {
            "Code": "450122",
            "Name": "武鸣县"
          },
          {
            "Code": "450123",
            "Name": "隆安县"
          },
          {
            "Code": "450124",
            "Name": "马山县"
          },
          {
            "Code": "450125",
            "Name": "上林县"
          },
          {
            "Code": "450126",
            "Name": "宾阳县"
          },
          {
            "Code": "450127",
            "Name": "横县"
          }
        ]
      },
      {
        "Code": "450200",
        "Name": "柳州市",
        "level": [
          {
            "Code": "450202",
            "Name": "城中区"
          },
          {
            "Code": "450203",
            "Name": "鱼峰区"
          },
          {
            "Code": "450204",
            "Name": "柳南区"
          },
          {
            "Code": "450205",
            "Name": "柳北区"
          },
          {
            "Code": "450221",
            "Name": "柳江县"
          },
          {
            "Code": "450222",
            "Name": "柳城县"
          },
          {
            "Code": "450223",
            "Name": "鹿寨县"
          },
          {
            "Code": "450224",
            "Name": "融安县"
          },
          {
            "Code": "450225",
            "Name": "融水苗族自治县"
          },
          {
            "Code": "450226",
            "Name": "三江侗族自治县"
          }
        ]
      },
      {
        "Code": "450300",
        "Name": "桂林市",
        "level": [
          {
            "Code": "450302",
            "Name": "秀峰区"
          },
          {
            "Code": "450303",
            "Name": "叠彩区"
          },
          {
            "Code": "450304",
            "Name": "象山区"
          },
          {
            "Code": "450305",
            "Name": "七星区"
          },
          {
            "Code": "450311",
            "Name": "雁山区"
          },
          {
            "Code": "450321",
            "Name": "阳朔县"
          },
          {
            "Code": "450322",
            "Name": "临桂区"
          },
          {
            "Code": "450323",
            "Name": "灵川县"
          },
          {
            "Code": "450324",
            "Name": "全州县"
          },
          {
            "Code": "450325",
            "Name": "兴安县"
          },
          {
            "Code": "450326",
            "Name": "永福县"
          },
          {
            "Code": "450327",
            "Name": "灌阳县"
          },
          {
            "Code": "450328",
            "Name": "龙胜各族自治县"
          },
          {
            "Code": "450329",
            "Name": "资源县"
          },
          {
            "Code": "450330",
            "Name": "平乐县"
          },
          {
            "Code": "450331",
            "Name": "荔浦县"
          },
          {
            "Code": "450332",
            "Name": "恭城瑶族自治县"
          }
        ]
      },
      {
        "Code": "450400",
        "Name": "梧州市",
        "level": [
          {
            "Code": "450403",
            "Name": "万秀区"
          },
          {
            "Code": "450405",
            "Name": "长洲区"
          },
          {
            "Code": "450406",
            "Name": "龙圩区"
          },
          {
            "Code": "450421",
            "Name": "苍梧县"
          },
          {
            "Code": "450422",
            "Name": "藤县"
          },
          {
            "Code": "450423",
            "Name": "蒙山县"
          },
          {
            "Code": "450481",
            "Name": "岑溪市"
          }
        ]
      },
      {
        "Code": "450500",
        "Name": "北海市",
        "level": [
          {
            "Code": "450502",
            "Name": "海城区"
          },
          {
            "Code": "450503",
            "Name": "银海区"
          },
          {
            "Code": "450512",
            "Name": "铁山港区"
          },
          {
            "Code": "450521",
            "Name": "合浦县"
          }
        ]
      },
      {
        "Code": "450600",
        "Name": "防城港市",
        "level": [
          {
            "Code": "450602",
            "Name": "港口区"
          },
          {
            "Code": "450603",
            "Name": "防城区"
          },
          {
            "Code": "450621",
            "Name": "上思县"
          },
          {
            "Code": "450681",
            "Name": "东兴市"
          }
        ]
      },
      {
        "Code": "450700",
        "Name": "钦州市",
        "level": [
          {
            "Code": "450702",
            "Name": "钦南区"
          },
          {
            "Code": "450703",
            "Name": "钦北区"
          },
          {
            "Code": "450721",
            "Name": "灵山县"
          },
          {
            "Code": "450722",
            "Name": "浦北县"
          }
        ]
      },
      {
        "Code": "450800",
        "Name": "贵港市",
        "level": [
          {
            "Code": "450802",
            "Name": "港北区"
          },
          {
            "Code": "450803",
            "Name": "港南区"
          },
          {
            "Code": "450804",
            "Name": "覃塘区"
          },
          {
            "Code": "450821",
            "Name": "平南县"
          },
          {
            "Code": "450881",
            "Name": "桂平市"
          }
        ]
      },
      {
        "Code": "450900",
        "Name": "玉林市",
        "level": [
          {
            "Code": "450902",
            "Name": "玉州区"
          },
          {
            "Code": "450903",
            "Name": "福绵区"
          },
          {
            "Code": "450921",
            "Name": "容县"
          },
          {
            "Code": "450922",
            "Name": "陆川县"
          },
          {
            "Code": "450923",
            "Name": "博白县"
          },
          {
            "Code": "450924",
            "Name": "兴业县"
          },
          {
            "Code": "450981",
            "Name": "北流市"
          }
        ]
      },
      {
        "Code": "451000",
        "Name": "百色市",
        "level": [
          {
            "Code": "451002",
            "Name": "右江区"
          },
          {
            "Code": "451021",
            "Name": "田阳县"
          },
          {
            "Code": "451022",
            "Name": "田东县"
          },
          {
            "Code": "451023",
            "Name": "平果县"
          },
          {
            "Code": "451024",
            "Name": "德保县"
          },
          {
            "Code": "451025",
            "Name": "靖西县"
          },
          {
            "Code": "451026",
            "Name": "那坡县"
          },
          {
            "Code": "451027",
            "Name": "凌云县"
          },
          {
            "Code": "451028",
            "Name": "乐业县"
          },
          {
            "Code": "451029",
            "Name": "田林县"
          },
          {
            "Code": "451030",
            "Name": "西林县"
          },
          {
            "Code": "451031",
            "Name": "隆林各族自治县"
          }
        ]
      },
      {
        "Code": "451100",
        "Name": "贺州市",
        "level": [
          {
            "Code": "451102",
            "Name": "八步区"
          },
          {
            "Code": "451119",
            "Name": "平桂管理区"
          },
          {
            "Code": "451121",
            "Name": "昭平县"
          },
          {
            "Code": "451122",
            "Name": "钟山县"
          },
          {
            "Code": "451123",
            "Name": "富川瑶族自治县"
          }
        ]
      },
      {
        "Code": "451200",
        "Name": "河池市",
        "level": [
          {
            "Code": "451202",
            "Name": "金城江区"
          },
          {
            "Code": "451221",
            "Name": "南丹县"
          },
          {
            "Code": "451222",
            "Name": "天峨县"
          },
          {
            "Code": "451223",
            "Name": "凤山县"
          },
          {
            "Code": "451224",
            "Name": "东兰县"
          },
          {
            "Code": "451225",
            "Name": "罗城仫佬族自治县"
          },
          {
            "Code": "451226",
            "Name": "环江毛南族自治县"
          },
          {
            "Code": "451227",
            "Name": "巴马瑶族自治县"
          },
          {
            "Code": "451228",
            "Name": "都安瑶族自治县"
          },
          {
            "Code": "451229",
            "Name": "大化瑶族自治县"
          },
          {
            "Code": "451281",
            "Name": "宜州市"
          }
        ]
      },
      {
        "Code": "451300",
        "Name": "来宾市",
        "level": [
          {
            "Code": "451302",
            "Name": "兴宾区"
          },
          {
            "Code": "451321",
            "Name": "忻城县"
          },
          {
            "Code": "451322",
            "Name": "象州县"
          },
          {
            "Code": "451323",
            "Name": "武宣县"
          },
          {
            "Code": "451324",
            "Name": "金秀瑶族自治县"
          },
          {
            "Code": "451381",
            "Name": "合山市"
          }
        ]
      },
      {
        "Code": "451400",
        "Name": "崇左市",
        "level": [
          {
            "Code": "451402",
            "Name": "江州区"
          },
          {
            "Code": "451421",
            "Name": "扶绥县"
          },
          {
            "Code": "451422",
            "Name": "宁明县"
          },
          {
            "Code": "451423",
            "Name": "龙州县"
          },
          {
            "Code": "451424",
            "Name": "大新县"
          },
          {
            "Code": "451425",
            "Name": "天等县"
          },
          {
            "Code": "451481",
            "Name": "凭祥市"
          }
        ]
      }
    ]
  },
  {
    "Code": "460000",
    "Name": "海南省",
    "level": [
      {
        "Code": "460100",
        "Name": "海口市",
        "level": [
          {
            "Code": "460105",
            "Name": "秀英区"
          },
          {
            "Code": "460106",
            "Name": "龙华区"
          },
          {
            "Code": "460107",
            "Name": "琼山区"
          },
          {
            "Code": "460108",
            "Name": "美兰区"
          }
        ]
      },
      {
        "Code": "460200",
        "Name": "三亚市",
        "level": [
          {
            "Code": "460201100",
            "Name": "海棠湾镇"
          },
          {
            "Code": "460201101",
            "Name": "吉阳镇"
          },
          {
            "Code": "460201102",
            "Name": "凤凰镇"
          },
          {
            "Code": "460201103",
            "Name": "崖城镇"
          },
          {
            "Code": "460201104",
            "Name": "天涯镇"
          },
          {
            "Code": "460201105",
            "Name": "育才镇"
          },
          {
            "Code": "460201400",
            "Name": "国营南田农场"
          },
          {
            "Code": "460201401",
            "Name": "国营南新农场"
          },
          {
            "Code": "460201403",
            "Name": "国营立才农场"
          },
          {
            "Code": "460201404",
            "Name": "国营南滨农场"
          },
          {
            "Code": "460201451",
            "Name": "河西区街道"
          },
          {
            "Code": "460201452",
            "Name": "河东区街道"
          }
        ]
      },
      {
        "Code": "460300",
        "Name": "三沙市",
        "level": [
          {
            "Code": "460321",
            "Name": "西沙群岛"
          },
          {
            "Code": "460322",
            "Name": "南沙群岛"
          },
          {
            "Code": "460323",
            "Name": "中沙群岛的岛礁及其海域"
          }
        ]
      },
      {
        "Code": "469001",
        "Name": "五指山市",
        "level": [
          {
            "Code": "469001100",
            "Name": "通什镇"
          },
          {
            "Code": "469001101",
            "Name": "南圣镇"
          },
          {
            "Code": "469001102",
            "Name": "毛阳镇"
          },
          {
            "Code": "469001103",
            "Name": "番阳镇"
          },
          {
            "Code": "469001200",
            "Name": "畅好乡"
          },
          {
            "Code": "469001201",
            "Name": "毛道乡"
          },
          {
            "Code": "469001202",
            "Name": "水满乡"
          },
          {
            "Code": "469001400",
            "Name": "国营畅好农场"
          }
        ]
      },
      {
        "Code": "469002",
        "Name": "琼海市",
        "level": [
          {
            "Code": "469002100",
            "Name": "嘉积镇"
          },
          {
            "Code": "469002101",
            "Name": "万泉镇"
          },
          {
            "Code": "469002102",
            "Name": "石壁镇"
          },
          {
            "Code": "469002103",
            "Name": "中原镇"
          },
          {
            "Code": "469002104",
            "Name": "博鳌镇"
          },
          {
            "Code": "469002105",
            "Name": "阳江镇"
          },
          {
            "Code": "469002106",
            "Name": "龙江镇"
          },
          {
            "Code": "469002107",
            "Name": "潭门镇"
          },
          {
            "Code": "469002108",
            "Name": "塔洋镇"
          },
          {
            "Code": "469002109",
            "Name": "长坡镇"
          },
          {
            "Code": "469002110",
            "Name": "大路镇"
          },
          {
            "Code": "469002111",
            "Name": "会山镇"
          },
          {
            "Code": "469002400",
            "Name": "国营东太农场"
          },
          {
            "Code": "469002402",
            "Name": "国营东红农场"
          },
          {
            "Code": "469002403",
            "Name": "国营东升农场"
          },
          {
            "Code": "469002500",
            "Name": "彬村山华侨农场"
          }
        ]
      },
      {
        "Code": "469003",
        "Name": "儋州市",
        "level": [
          {
            "Code": "469003100",
            "Name": "那大镇"
          },
          {
            "Code": "469003101",
            "Name": "和庆镇"
          },
          {
            "Code": "469003102",
            "Name": "南丰镇"
          },
          {
            "Code": "469003103",
            "Name": "大成镇"
          },
          {
            "Code": "469003104",
            "Name": "雅星镇"
          },
          {
            "Code": "469003105",
            "Name": "兰洋镇"
          },
          {
            "Code": "469003106",
            "Name": "光村镇"
          },
          {
            "Code": "469003107",
            "Name": "木棠镇"
          },
          {
            "Code": "469003108",
            "Name": "海头镇"
          },
          {
            "Code": "469003109",
            "Name": "峨蔓镇"
          },
          {
            "Code": "469003110",
            "Name": "三都镇"
          },
          {
            "Code": "469003111",
            "Name": "王五镇"
          },
          {
            "Code": "469003112",
            "Name": "白马井镇"
          },
          {
            "Code": "469003113",
            "Name": "中和镇"
          },
          {
            "Code": "469003114",
            "Name": "排浦镇"
          },
          {
            "Code": "469003115",
            "Name": "东成镇"
          },
          {
            "Code": "469003116",
            "Name": "新州镇"
          },
          {
            "Code": "469003400",
            "Name": "国营西培农场"
          },
          {
            "Code": "469003404",
            "Name": "国营西联农场"
          },
          {
            "Code": "469003405",
            "Name": "国营蓝洋农场"
          },
          {
            "Code": "469003407",
            "Name": "国营八一农场"
          },
          {
            "Code": "469003499",
            "Name": "洋浦经济开发区"
          },
          {
            "Code": "469003500",
            "Name": "华南热作学院"
          }
        ]
      },
      {
        "Code": "469005",
        "Name": "文昌市",
        "level": [
          {
            "Code": "469005100",
            "Name": "文城镇"
          },
          {
            "Code": "469005101",
            "Name": "重兴镇"
          },
          {
            "Code": "469005102",
            "Name": "蓬莱镇"
          },
          {
            "Code": "469005103",
            "Name": "会文镇"
          },
          {
            "Code": "469005104",
            "Name": "东路镇"
          },
          {
            "Code": "469005105",
            "Name": "潭牛镇"
          },
          {
            "Code": "469005106",
            "Name": "东阁镇"
          },
          {
            "Code": "469005107",
            "Name": "文教镇"
          },
          {
            "Code": "469005108",
            "Name": "东郊镇"
          },
          {
            "Code": "469005109",
            "Name": "龙楼镇"
          },
          {
            "Code": "469005110",
            "Name": "昌洒镇"
          },
          {
            "Code": "469005111",
            "Name": "翁田镇"
          },
          {
            "Code": "469005112",
            "Name": "抱罗镇"
          },
          {
            "Code": "469005113",
            "Name": "冯坡镇"
          },
          {
            "Code": "469005114",
            "Name": "锦山镇"
          },
          {
            "Code": "469005115",
            "Name": "铺前镇"
          },
          {
            "Code": "469005116",
            "Name": "公坡镇"
          },
          {
            "Code": "469005400",
            "Name": "国营东路农场"
          },
          {
            "Code": "469005401",
            "Name": "国营南阳农场"
          },
          {
            "Code": "469005402",
            "Name": "国营罗豆农场"
          }
        ]
      },
      {
        "Code": "469006",
        "Name": "万宁市",
        "level": [
          {
            "Code": "469006100",
            "Name": "万城镇"
          },
          {
            "Code": "469006101",
            "Name": "龙滚镇"
          },
          {
            "Code": "469006102",
            "Name": "和乐镇"
          },
          {
            "Code": "469006103",
            "Name": "后安镇"
          },
          {
            "Code": "469006104",
            "Name": "大茂镇"
          },
          {
            "Code": "469006105",
            "Name": "东澳镇"
          },
          {
            "Code": "469006106",
            "Name": "礼纪镇"
          },
          {
            "Code": "469006107",
            "Name": "长丰镇"
          },
          {
            "Code": "469006108",
            "Name": "山根镇"
          },
          {
            "Code": "469006109",
            "Name": "北大镇"
          },
          {
            "Code": "469006110",
            "Name": "南桥镇"
          },
          {
            "Code": "469006111",
            "Name": "三更罗镇"
          },
          {
            "Code": "469006400",
            "Name": "国营东兴农场"
          },
          {
            "Code": "469006401",
            "Name": "国营东和农场"
          },
          {
            "Code": "469006404",
            "Name": "国营新中农场"
          },
          {
            "Code": "469006500",
            "Name": "兴隆华侨农场"
          },
          {
            "Code": "469006501",
            "Name": "地方国营六连林场"
          }
        ]
      },
      {
        "Code": "469007",
        "Name": "东方市",
        "level": [
          {
            "Code": "469007100",
            "Name": "八所镇"
          },
          {
            "Code": "469007101",
            "Name": "东河镇"
          },
          {
            "Code": "469007102",
            "Name": "大田镇"
          },
          {
            "Code": "469007103",
            "Name": "感城镇"
          },
          {
            "Code": "469007104",
            "Name": "板桥镇"
          },
          {
            "Code": "469007105",
            "Name": "三家镇"
          },
          {
            "Code": "469007106",
            "Name": "四更镇"
          },
          {
            "Code": "469007107",
            "Name": "新龙镇"
          },
          {
            "Code": "469007200",
            "Name": "天安乡"
          },
          {
            "Code": "469007201",
            "Name": "江边乡"
          },
          {
            "Code": "469007400",
            "Name": "国营广坝农场"
          },
          {
            "Code": "469007500",
            "Name": "东方华侨农场"
          }
        ]
      },
      {
        "Code": "469025",
        "Name": "定安县",
        "level": [
          {
            "Code": "469021100",
            "Name": "定城镇"
          },
          {
            "Code": "469021101",
            "Name": "新竹镇"
          },
          {
            "Code": "469021102",
            "Name": "龙湖镇"
          },
          {
            "Code": "469021103",
            "Name": "黄竹镇"
          },
          {
            "Code": "469021104",
            "Name": "雷鸣镇"
          },
          {
            "Code": "469021105",
            "Name": "龙门镇"
          },
          {
            "Code": "469021106",
            "Name": "龙河镇"
          },
          {
            "Code": "469021107",
            "Name": "岭口镇"
          },
          {
            "Code": "469021108",
            "Name": "翰林镇"
          },
          {
            "Code": "469021109",
            "Name": "富文镇"
          },
          {
            "Code": "469021400",
            "Name": "国营中瑞农场"
          },
          {
            "Code": "469021401",
            "Name": "国营南海农场"
          },
          {
            "Code": "469021402",
            "Name": "国营金鸡岭农场"
          }
        ]
      },
      {
        "Code": "469026",
        "Name": "屯昌县",
        "level": [
          {
            "Code": "469022100",
            "Name": "屯城镇"
          },
          {
            "Code": "469022101",
            "Name": "新兴镇"
          },
          {
            "Code": "469022102",
            "Name": "枫木镇"
          },
          {
            "Code": "469022103",
            "Name": "乌坡镇"
          },
          {
            "Code": "469022104",
            "Name": "南吕镇"
          },
          {
            "Code": "469022105",
            "Name": "南坤镇"
          },
          {
            "Code": "469022106",
            "Name": "坡心镇"
          },
          {
            "Code": "469022107",
            "Name": "西昌镇"
          },
          {
            "Code": "469022400",
            "Name": "国营中建农场"
          },
          {
            "Code": "469022401",
            "Name": "国营中坤农场"
          }
        ]
      },
      {
        "Code": "469027",
        "Name": "澄迈县",
        "level": [
          {
            "Code": "469023100",
            "Name": "金江镇"
          },
          {
            "Code": "469023101",
            "Name": "老城镇"
          },
          {
            "Code": "469023102",
            "Name": "瑞溪镇"
          },
          {
            "Code": "469023103",
            "Name": "永发镇"
          },
          {
            "Code": "469023104",
            "Name": "加乐镇"
          },
          {
            "Code": "469023105",
            "Name": "文儒镇"
          },
          {
            "Code": "469023106",
            "Name": "中兴镇"
          },
          {
            "Code": "469023107",
            "Name": "仁兴镇"
          },
          {
            "Code": "469023108",
            "Name": "福山镇"
          },
          {
            "Code": "469023109",
            "Name": "桥头镇"
          },
          {
            "Code": "469023110",
            "Name": "大丰镇"
          },
          {
            "Code": "469023400",
            "Name": "国营红光农场"
          },
          {
            "Code": "469023402",
            "Name": "国营西达农场"
          },
          {
            "Code": "469023405",
            "Name": "国营金安农场"
          }
        ]
      },
      {
        "Code": "469028",
        "Name": "临高县",
        "level": [
          {
            "Code": "469024100",
            "Name": "临城镇"
          },
          {
            "Code": "469024101",
            "Name": "波莲镇"
          },
          {
            "Code": "469024102",
            "Name": "东英镇"
          },
          {
            "Code": "469024103",
            "Name": "博厚镇"
          },
          {
            "Code": "469024104",
            "Name": "皇桐镇"
          },
          {
            "Code": "469024105",
            "Name": "多文镇"
          },
          {
            "Code": "469024106",
            "Name": "和舍镇"
          },
          {
            "Code": "469024107",
            "Name": "南宝镇"
          },
          {
            "Code": "469024108",
            "Name": "新盈镇"
          },
          {
            "Code": "469024109",
            "Name": "调楼镇"
          },
          {
            "Code": "469024400",
            "Name": "国营红华农场"
          },
          {
            "Code": "469024401",
            "Name": "国营加来农场"
          }
        ]
      },
      {
        "Code": "469030",
        "Name": "白沙黎族自治县",
        "level": [
          {
            "Code": "469025100",
            "Name": "牙叉镇"
          },
          {
            "Code": "469025101",
            "Name": "七坊镇"
          },
          {
            "Code": "469025102",
            "Name": "邦溪镇"
          },
          {
            "Code": "469025103",
            "Name": "打安镇"
          },
          {
            "Code": "469025200",
            "Name": "细水乡"
          },
          {
            "Code": "469025201",
            "Name": "元门乡"
          },
          {
            "Code": "469025202",
            "Name": "南开乡"
          },
          {
            "Code": "469025203",
            "Name": "阜龙乡"
          },
          {
            "Code": "469025204",
            "Name": "青松乡"
          },
          {
            "Code": "469025205",
            "Name": "金波乡"
          },
          {
            "Code": "469025206",
            "Name": "荣邦乡"
          },
          {
            "Code": "469025401",
            "Name": "国营白沙农场"
          },
          {
            "Code": "469025404",
            "Name": "国营龙江农场"
          },
          {
            "Code": "469025408",
            "Name": "国营邦溪农场"
          }
        ]
      },
      {
        "Code": "469031",
        "Name": "昌江黎族自治县",
        "level": [
          {
            "Code": "469026100",
            "Name": "石碌镇"
          },
          {
            "Code": "469026101",
            "Name": "叉河镇"
          },
          {
            "Code": "469026102",
            "Name": "十月田镇"
          },
          {
            "Code": "469026103",
            "Name": "乌烈镇"
          },
          {
            "Code": "469026104",
            "Name": "昌化镇"
          },
          {
            "Code": "469026105",
            "Name": "海尾镇"
          },
          {
            "Code": "469026106",
            "Name": "七叉镇"
          },
          {
            "Code": "469026200",
            "Name": "王下乡"
          },
          {
            "Code": "469026401",
            "Name": "国营红林农场"
          },
          {
            "Code": "469026500",
            "Name": "国营霸王岭林场"
          },
          {
            "Code": "469026501",
            "Name": "海南矿业联合有限公司"
          }
        ]
      },
      {
        "Code": "469033",
        "Name": "乐东黎族自治县",
        "level": [
          {
            "Code": "469027100",
            "Name": "抱由镇"
          },
          {
            "Code": "469027101",
            "Name": "万冲镇"
          },
          {
            "Code": "469027102",
            "Name": "大安镇"
          },
          {
            "Code": "469027103",
            "Name": "志仲镇"
          },
          {
            "Code": "469027104",
            "Name": "千家镇"
          },
          {
            "Code": "469027105",
            "Name": "九所镇"
          },
          {
            "Code": "469027106",
            "Name": "利国镇"
          },
          {
            "Code": "469027107",
            "Name": "黄流镇"
          },
          {
            "Code": "469027108",
            "Name": "佛罗镇"
          },
          {
            "Code": "469027109",
            "Name": "尖峰镇"
          },
          {
            "Code": "469027110",
            "Name": "莺歌海镇"
          },
          {
            "Code": "469027401",
            "Name": "国营山荣农场"
          },
          {
            "Code": "469027402",
            "Name": "国营乐光农场"
          },
          {
            "Code": "469027405",
            "Name": "国营保国农场"
          },
          {
            "Code": "469027500",
            "Name": "国营尖峰岭林业公司"
          },
          {
            "Code": "469027501",
            "Name": "国营莺歌海盐场"
          }
        ]
      },
      {
        "Code": "469034",
        "Name": "陵水黎族自治县",
        "level": [
          {
            "Code": "469028100",
            "Name": "椰林镇"
          },
          {
            "Code": "469028101",
            "Name": "光坡镇"
          },
          {
            "Code": "469028102",
            "Name": "三才镇"
          },
          {
            "Code": "469028103",
            "Name": "英州镇"
          },
          {
            "Code": "469028104",
            "Name": "隆广镇"
          },
          {
            "Code": "469028105",
            "Name": "文罗镇"
          },
          {
            "Code": "469028106",
            "Name": "本号镇"
          },
          {
            "Code": "469028107",
            "Name": "新村镇"
          },
          {
            "Code": "469028108",
            "Name": "黎安镇"
          },
          {
            "Code": "469028200",
            "Name": "提蒙乡"
          },
          {
            "Code": "469028201",
            "Name": "群英乡"
          },
          {
            "Code": "469028400",
            "Name": "国营岭门农场"
          },
          {
            "Code": "469028401",
            "Name": "国营南平农场"
          },
          {
            "Code": "469028500",
            "Name": "国营吊罗山林业公司"
          }
        ]
      },
      {
        "Code": "469035",
        "Name": "保亭黎族苗族自治县",
        "level": [
          {
            "Code": "469029100",
            "Name": "保城镇"
          },
          {
            "Code": "469029101",
            "Name": "什玲镇"
          },
          {
            "Code": "469029102",
            "Name": "加茂镇"
          },
          {
            "Code": "469029103",
            "Name": "响水镇"
          },
          {
            "Code": "469029104",
            "Name": "新政镇"
          },
          {
            "Code": "469029105",
            "Name": "三道镇"
          },
          {
            "Code": "469029200",
            "Name": "六弓乡"
          },
          {
            "Code": "469029201",
            "Name": "南林乡"
          },
          {
            "Code": "469029202",
            "Name": "毛感乡"
          },
          {
            "Code": "469029401",
            "Name": "国营新星农场"
          },
          {
            "Code": "469029402",
            "Name": "海南保亭热带作物研究所"
          },
          {
            "Code": "469029403",
            "Name": "国营金江农场"
          },
          {
            "Code": "469029405",
            "Name": "国营三道农场"
          }
        ]
      },
      {
        "Code": "469036",
        "Name": "琼中黎族苗族自治县",
        "level": [
          {
            "Code": "469030100",
            "Name": "营根镇"
          },
          {
            "Code": "469030101",
            "Name": "湾岭镇"
          },
          {
            "Code": "469030102",
            "Name": "黎母山镇"
          },
          {
            "Code": "469030103",
            "Name": "和平镇"
          },
          {
            "Code": "469030104",
            "Name": "长征镇"
          },
          {
            "Code": "469030105",
            "Name": "红毛镇"
          },
          {
            "Code": "469030106",
            "Name": "中平镇"
          },
          {
            "Code": "469030200",
            "Name": "吊罗山乡"
          },
          {
            "Code": "469030201",
            "Name": "上安乡"
          },
          {
            "Code": "469030202",
            "Name": "什运乡"
          },
          {
            "Code": "469030402",
            "Name": "国营阳江农场"
          },
          {
            "Code": "469030403",
            "Name": "国营乌石农场"
          },
          {
            "Code": "469030406",
            "Name": "国营加钗农场"
          },
          {
            "Code": "469030407",
            "Name": "国营长征农场"
          },
          {
            "Code": "469030500",
            "Name": "国营黎母山林业公司"
          }
        ]
      }
    ]
  },
  {
    "Code": "500000",
    "Name": "重庆",
    "level": [
      {
        "Code": "500100",
        "Name": "重庆市",
        "level": [
          {
            "Code": "500101",
            "Name": "万州区"
          },
          {
            "Code": "500102",
            "Name": "涪陵区"
          },
          {
            "Code": "500103",
            "Name": "渝中区"
          },
          {
            "Code": "500104",
            "Name": "大渡口区"
          },
          {
            "Code": "500105",
            "Name": "江北区"
          },
          {
            "Code": "500106",
            "Name": "沙坪坝区"
          },
          {
            "Code": "500107",
            "Name": "九龙坡区"
          },
          {
            "Code": "500108",
            "Name": "南岸区"
          },
          {
            "Code": "500109",
            "Name": "北碚区"
          },
          {
            "Code": "500112",
            "Name": "渝北区"
          },
          {
            "Code": "500113",
            "Name": "巴南区"
          },
          {
            "Code": "500114",
            "Name": "黔江区"
          },
          {
            "Code": "500115",
            "Name": "长寿区"
          },
          {
            "Code": "500222",
            "Name": "綦江区"
          },
          {
            "Code": "500223",
            "Name": "潼南县"
          },
          {
            "Code": "500224",
            "Name": "铜梁县"
          },
          {
            "Code": "500225",
            "Name": "大足区"
          },
          {
            "Code": "500226",
            "Name": "荣昌县"
          },
          {
            "Code": "500227",
            "Name": "璧山县"
          },
          {
            "Code": "500228",
            "Name": "梁平县"
          },
          {
            "Code": "500229",
            "Name": "城口县"
          },
          {
            "Code": "500230",
            "Name": "丰都县"
          },
          {
            "Code": "500231",
            "Name": "垫江县"
          },
          {
            "Code": "500232",
            "Name": "武隆县"
          },
          {
            "Code": "500233",
            "Name": "忠县"
          },
          {
            "Code": "500234",
            "Name": "开县"
          },
          {
            "Code": "500235",
            "Name": "云阳县"
          },
          {
            "Code": "500236",
            "Name": "奉节县"
          },
          {
            "Code": "500237",
            "Name": "巫山县"
          },
          {
            "Code": "500238",
            "Name": "巫溪县"
          },
          {
            "Code": "500240",
            "Name": "石柱土家族自治县"
          },
          {
            "Code": "500241",
            "Name": "秀山土家族苗族自治县"
          },
          {
            "Code": "500242",
            "Name": "酉阳土家族苗族自治县"
          },
          {
            "Code": "500243",
            "Name": "彭水苗族土家族自治县"
          },
          {
            "Code": "500381",
            "Name": "江津区"
          },
          {
            "Code": "500382",
            "Name": "合川区"
          },
          {
            "Code": "500383",
            "Name": "永川区"
          },
          {
            "Code": "500384",
            "Name": "南川区"
          }
        ]
      }
    ]
  },
  {
    "Code": "510000",
    "Name": "四川省",
    "level": [
      {
        "Code": "510100",
        "Name": "成都市",
        "level": [
          {
            "Code": "510104",
            "Name": "锦江区"
          },
          {
            "Code": "510105",
            "Name": "青羊区"
          },
          {
            "Code": "510106",
            "Name": "金牛区"
          },
          {
            "Code": "510107",
            "Name": "武侯区"
          },
          {
            "Code": "510108",
            "Name": "成华区"
          },
          {
            "Code": "510112",
            "Name": "龙泉驿区"
          },
          {
            "Code": "510113",
            "Name": "青白江区"
          },
          {
            "Code": "510114",
            "Name": "新都区"
          },
          {
            "Code": "510115",
            "Name": "温江区"
          },
          {
            "Code": "510121",
            "Name": "金堂县"
          },
          {
            "Code": "510122",
            "Name": "双流县"
          },
          {
            "Code": "510124",
            "Name": "郫县"
          },
          {
            "Code": "510129",
            "Name": "大邑县"
          },
          {
            "Code": "510131",
            "Name": "蒲江县"
          },
          {
            "Code": "510132",
            "Name": "新津县"
          },
          {
            "Code": "510181",
            "Name": "都江堰市"
          },
          {
            "Code": "510182",
            "Name": "彭州市"
          },
          {
            "Code": "510183",
            "Name": "邛崃市"
          },
          {
            "Code": "510184",
            "Name": "崇州市"
          }
        ]
      },
      {
        "Code": "510300",
        "Name": "自贡市",
        "level": [
          {
            "Code": "510302",
            "Name": "自流井区"
          },
          {
            "Code": "510303",
            "Name": "贡井区"
          },
          {
            "Code": "510304",
            "Name": "大安区"
          },
          {
            "Code": "510311",
            "Name": "沿滩区"
          },
          {
            "Code": "510321",
            "Name": "荣县"
          },
          {
            "Code": "510322",
            "Name": "富顺县"
          }
        ]
      },
      {
        "Code": "510400",
        "Name": "攀枝花市",
        "level": [
          {
            "Code": "510402",
            "Name": "东区"
          },
          {
            "Code": "510403",
            "Name": "西区"
          },
          {
            "Code": "510411",
            "Name": "仁和区"
          },
          {
            "Code": "510421",
            "Name": "米易县"
          },
          {
            "Code": "510422",
            "Name": "盐边县"
          }
        ]
      },
      {
        "Code": "510500",
        "Name": "泸州市",
        "level": [
          {
            "Code": "510502",
            "Name": "江阳区"
          },
          {
            "Code": "510503",
            "Name": "纳溪区"
          },
          {
            "Code": "510504",
            "Name": "龙马潭区"
          },
          {
            "Code": "510521",
            "Name": "泸县"
          },
          {
            "Code": "510522",
            "Name": "合江县"
          },
          {
            "Code": "510524",
            "Name": "叙永县"
          },
          {
            "Code": "510525",
            "Name": "古蔺县"
          }
        ]
      },
      {
        "Code": "510600",
        "Name": "德阳市",
        "level": [
          {
            "Code": "510603",
            "Name": "旌阳区"
          },
          {
            "Code": "510623",
            "Name": "中江县"
          },
          {
            "Code": "510626",
            "Name": "罗江县"
          },
          {
            "Code": "510681",
            "Name": "广汉市"
          },
          {
            "Code": "510682",
            "Name": "什邡市"
          },
          {
            "Code": "510683",
            "Name": "绵竹市"
          }
        ]
      },
      {
        "Code": "510700",
        "Name": "绵阳市",
        "level": [
          {
            "Code": "510703",
            "Name": "涪城区"
          },
          {
            "Code": "510704",
            "Name": "游仙区"
          },
          {
            "Code": "510722",
            "Name": "三台县"
          },
          {
            "Code": "510723",
            "Name": "盐亭县"
          },
          {
            "Code": "510724",
            "Name": "安县"
          },
          {
            "Code": "510725",
            "Name": "梓潼县"
          },
          {
            "Code": "510726",
            "Name": "北川羌族自治县"
          },
          {
            "Code": "510727",
            "Name": "平武县"
          },
          {
            "Code": "510781",
            "Name": "江油市"
          }
        ]
      },
      {
        "Code": "510800",
        "Name": "广元市",
        "level": [
          {
            "Code": "510802",
            "Name": "利州区"
          },
          {
            "Code": "510811",
            "Name": "昭化区"
          },
          {
            "Code": "510812",
            "Name": "朝天区"
          },
          {
            "Code": "510821",
            "Name": "旺苍县"
          },
          {
            "Code": "510822",
            "Name": "青川县"
          },
          {
            "Code": "510823",
            "Name": "剑阁县"
          },
          {
            "Code": "510824",
            "Name": "苍溪县"
          }
        ]
      },
      {
        "Code": "510900",
        "Name": "遂宁市",
        "level": [
          {
            "Code": "510903",
            "Name": "船山区"
          },
          {
            "Code": "510904",
            "Name": "安居区"
          },
          {
            "Code": "510921",
            "Name": "蓬溪县"
          },
          {
            "Code": "510922",
            "Name": "射洪县"
          },
          {
            "Code": "510923",
            "Name": "大英县"
          }
        ]
      },
      {
        "Code": "511000",
        "Name": "内江市",
        "level": [
          {
            "Code": "511002",
            "Name": "市中区"
          },
          {
            "Code": "511011",
            "Name": "东兴区"
          },
          {
            "Code": "511024",
            "Name": "威远县"
          },
          {
            "Code": "511025",
            "Name": "资中县"
          },
          {
            "Code": "511028",
            "Name": "隆昌县"
          }
        ]
      },
      {
        "Code": "511100",
        "Name": "乐山市",
        "level": [
          {
            "Code": "511102",
            "Name": "市中区"
          },
          {
            "Code": "511111",
            "Name": "沙湾区"
          },
          {
            "Code": "511112",
            "Name": "五通桥区"
          },
          {
            "Code": "511113",
            "Name": "金口河区"
          },
          {
            "Code": "511123",
            "Name": "犍为县"
          },
          {
            "Code": "511124",
            "Name": "井研县"
          },
          {
            "Code": "511126",
            "Name": "夹江县"
          },
          {
            "Code": "511129",
            "Name": "沐川县"
          },
          {
            "Code": "511132",
            "Name": "峨边彝族自治县"
          },
          {
            "Code": "511133",
            "Name": "马边彝族自治县"
          },
          {
            "Code": "511181",
            "Name": "峨眉山市"
          }
        ]
      },
      {
        "Code": "511300",
        "Name": "南充市",
        "level": [
          {
            "Code": "511302",
            "Name": "顺庆区"
          },
          {
            "Code": "511303",
            "Name": "高坪区"
          },
          {
            "Code": "511304",
            "Name": "嘉陵区"
          },
          {
            "Code": "511321",
            "Name": "南部县"
          },
          {
            "Code": "511322",
            "Name": "营山县"
          },
          {
            "Code": "511323",
            "Name": "蓬安县"
          },
          {
            "Code": "511324",
            "Name": "仪陇县"
          },
          {
            "Code": "511325",
            "Name": "西充县"
          },
          {
            "Code": "511381",
            "Name": "阆中市"
          }
        ]
      },
      {
        "Code": "511400",
        "Name": "眉山市",
        "level": [
          {
            "Code": "511402",
            "Name": "东坡区"
          },
          {
            "Code": "511421",
            "Name": "仁寿县"
          },
          {
            "Code": "511422",
            "Name": "彭山县"
          },
          {
            "Code": "511423",
            "Name": "洪雅县"
          },
          {
            "Code": "511424",
            "Name": "丹棱县"
          },
          {
            "Code": "511425",
            "Name": "青神县"
          }
        ]
      },
      {
        "Code": "511500",
        "Name": "宜宾市",
        "level": [
          {
            "Code": "511502",
            "Name": "翠屏区"
          },
          {
            "Code": "511521",
            "Name": "宜宾县"
          },
          {
            "Code": "511522",
            "Name": "南溪区"
          },
          {
            "Code": "511523",
            "Name": "江安县"
          },
          {
            "Code": "511524",
            "Name": "长宁县"
          },
          {
            "Code": "511525",
            "Name": "高县"
          },
          {
            "Code": "511526",
            "Name": "珙县"
          },
          {
            "Code": "511527",
            "Name": "筠连县"
          },
          {
            "Code": "511528",
            "Name": "兴文县"
          },
          {
            "Code": "511529",
            "Name": "屏山县"
          }
        ]
      },
      {
        "Code": "511600",
        "Name": "广安市",
        "level": [
          {
            "Code": "511602",
            "Name": "广安区"
          },
          {
            "Code": "511603",
            "Name": "前锋区"
          },
          {
            "Code": "511621",
            "Name": "岳池县"
          },
          {
            "Code": "511622",
            "Name": "武胜县"
          },
          {
            "Code": "511623",
            "Name": "邻水县"
          },
          {
            "Code": "511681",
            "Name": "华蓥市"
          }
        ]
      },
      {
        "Code": "511700",
        "Name": "达州市",
        "level": [
          {
            "Code": "511702",
            "Name": "通川区"
          },
          {
            "Code": "511721",
            "Name": "达川区"
          },
          {
            "Code": "511722",
            "Name": "宣汉县"
          },
          {
            "Code": "511723",
            "Name": "开江县"
          },
          {
            "Code": "511724",
            "Name": "大竹县"
          },
          {
            "Code": "511725",
            "Name": "渠县"
          },
          {
            "Code": "511781",
            "Name": "万源市"
          }
        ]
      },
      {
        "Code": "511800",
        "Name": "雅安市",
        "level": [
          {
            "Code": "511802",
            "Name": "雨城区"
          },
          {
            "Code": "511821",
            "Name": "名山区"
          },
          {
            "Code": "511822",
            "Name": "荥经县"
          },
          {
            "Code": "511823",
            "Name": "汉源县"
          },
          {
            "Code": "511824",
            "Name": "石棉县"
          },
          {
            "Code": "511825",
            "Name": "天全县"
          },
          {
            "Code": "511826",
            "Name": "芦山县"
          },
          {
            "Code": "511827",
            "Name": "宝兴县"
          }
        ]
      },
      {
        "Code": "511900",
        "Name": "巴中市",
        "level": [
          {
            "Code": "511902",
            "Name": "巴州区"
          },
          {
            "Code": "511903",
            "Name": "恩阳区"
          },
          {
            "Code": "511921",
            "Name": "通江县"
          },
          {
            "Code": "511922",
            "Name": "南江县"
          },
          {
            "Code": "511923",
            "Name": "平昌县"
          }
        ]
      },
      {
        "Code": "512000",
        "Name": "资阳市",
        "level": [
          {
            "Code": "512002",
            "Name": "雁江区"
          },
          {
            "Code": "512021",
            "Name": "安岳县"
          },
          {
            "Code": "512022",
            "Name": "乐至县"
          },
          {
            "Code": "512081",
            "Name": "简阳市"
          }
        ]
      },
      {
        "Code": "513200",
        "Name": "阿坝藏族羌族自治州",
        "level": [
          {
            "Code": "513221",
            "Name": "汶川县"
          },
          {
            "Code": "513222",
            "Name": "理县"
          },
          {
            "Code": "513223",
            "Name": "茂县"
          },
          {
            "Code": "513224",
            "Name": "松潘县"
          },
          {
            "Code": "513225",
            "Name": "九寨沟县"
          },
          {
            "Code": "513226",
            "Name": "金川县"
          },
          {
            "Code": "513227",
            "Name": "小金县"
          },
          {
            "Code": "513228",
            "Name": "黑水县"
          },
          {
            "Code": "513229",
            "Name": "马尔康县"
          },
          {
            "Code": "513230",
            "Name": "壤塘县"
          },
          {
            "Code": "513231",
            "Name": "阿坝县"
          },
          {
            "Code": "513232",
            "Name": "若尔盖县"
          },
          {
            "Code": "513233",
            "Name": "红原县"
          }
        ]
      },
      {
        "Code": "513300",
        "Name": "甘孜藏族自治州",
        "level": [
          {
            "Code": "513321",
            "Name": "康定县"
          },
          {
            "Code": "513322",
            "Name": "泸定县"
          },
          {
            "Code": "513323",
            "Name": "丹巴县"
          },
          {
            "Code": "513324",
            "Name": "九龙县"
          },
          {
            "Code": "513325",
            "Name": "雅江县"
          },
          {
            "Code": "513326",
            "Name": "道孚县"
          },
          {
            "Code": "513327",
            "Name": "炉霍县"
          },
          {
            "Code": "513328",
            "Name": "甘孜县"
          },
          {
            "Code": "513329",
            "Name": "新龙县"
          },
          {
            "Code": "513330",
            "Name": "德格县"
          },
          {
            "Code": "513331",
            "Name": "白玉县"
          },
          {
            "Code": "513332",
            "Name": "石渠县"
          },
          {
            "Code": "513333",
            "Name": "色达县"
          },
          {
            "Code": "513334",
            "Name": "理塘县"
          },
          {
            "Code": "513335",
            "Name": "巴塘县"
          },
          {
            "Code": "513336",
            "Name": "乡城县"
          },
          {
            "Code": "513337",
            "Name": "稻城县"
          },
          {
            "Code": "513338",
            "Name": "得荣县"
          }
        ]
      },
      {
        "Code": "513400",
        "Name": "凉山彝族自治州",
        "level": [
          {
            "Code": "513401",
            "Name": "西昌市"
          },
          {
            "Code": "513422",
            "Name": "木里藏族自治县"
          },
          {
            "Code": "513423",
            "Name": "盐源县"
          },
          {
            "Code": "513424",
            "Name": "德昌县"
          },
          {
            "Code": "513425",
            "Name": "会理县"
          },
          {
            "Code": "513426",
            "Name": "会东县"
          },
          {
            "Code": "513427",
            "Name": "宁南县"
          },
          {
            "Code": "513428",
            "Name": "普格县"
          },
          {
            "Code": "513429",
            "Name": "布拖县"
          },
          {
            "Code": "513430",
            "Name": "金阳县"
          },
          {
            "Code": "513431",
            "Name": "昭觉县"
          },
          {
            "Code": "513432",
            "Name": "喜德县"
          },
          {
            "Code": "513433",
            "Name": "冕宁县"
          },
          {
            "Code": "513434",
            "Name": "越西县"
          },
          {
            "Code": "513435",
            "Name": "甘洛县"
          },
          {
            "Code": "513436",
            "Name": "美姑县"
          },
          {
            "Code": "513437",
            "Name": "雷波县"
          }
        ]
      }
    ]
  },
  {
    "Code": "520000",
    "Name": "贵州省",
    "level": [
      {
        "Code": "520100",
        "Name": "贵阳市",
        "level": [
          {
            "Code": "520102",
            "Name": "南明区"
          },
          {
            "Code": "520103",
            "Name": "云岩区"
          },
          {
            "Code": "520111",
            "Name": "花溪区"
          },
          {
            "Code": "520112",
            "Name": "乌当区"
          },
          {
            "Code": "520113",
            "Name": "白云区"
          },
          {
            "Code": "520121",
            "Name": "开阳县"
          },
          {
            "Code": "520122",
            "Name": "息烽县"
          },
          {
            "Code": "520123",
            "Name": "修文县"
          },
          {
            "Code": "520151",
            "Name": "观山湖区"
          },
          {
            "Code": "520181",
            "Name": "清镇市"
          }
        ]
      },
      {
        "Code": "520200",
        "Name": "六盘水市",
        "level": [
          {
            "Code": "520201",
            "Name": "钟山区"
          },
          {
            "Code": "520203",
            "Name": "六枝特区"
          },
          {
            "Code": "520221",
            "Name": "水城县"
          },
          {
            "Code": "520222",
            "Name": "盘县"
          }
        ]
      },
      {
        "Code": "520300",
        "Name": "遵义市",
        "level": [
          {
            "Code": "520302",
            "Name": "红花岗区"
          },
          {
            "Code": "520303",
            "Name": "汇川区"
          },
          {
            "Code": "520321",
            "Name": "遵义县"
          },
          {
            "Code": "520322",
            "Name": "桐梓县"
          },
          {
            "Code": "520323",
            "Name": "绥阳县"
          },
          {
            "Code": "520324",
            "Name": "正安县"
          },
          {
            "Code": "520325",
            "Name": "道真仡佬族苗族自治县"
          },
          {
            "Code": "520326",
            "Name": "务川仡佬族苗族自治县"
          },
          {
            "Code": "520327",
            "Name": "凤冈县"
          },
          {
            "Code": "520328",
            "Name": "湄潭县"
          },
          {
            "Code": "520329",
            "Name": "余庆县"
          },
          {
            "Code": "520330",
            "Name": "习水县"
          },
          {
            "Code": "520381",
            "Name": "赤水市"
          },
          {
            "Code": "520382",
            "Name": "仁怀市"
          }
        ]
      },
      {
        "Code": "520400",
        "Name": "安顺市",
        "level": [
          {
            "Code": "520402",
            "Name": "西秀区"
          },
          {
            "Code": "520421",
            "Name": "平坝县"
          },
          {
            "Code": "520422",
            "Name": "普定县"
          },
          {
            "Code": "520423",
            "Name": "镇宁布依族苗族自治县"
          },
          {
            "Code": "520424",
            "Name": "关岭布依族苗族自治县"
          },
          {
            "Code": "520425",
            "Name": "紫云苗族布依族自治县"
          }
        ]
      },
      {
        "Code": "522200",
        "Name": "铜仁市",
        "level": [
          {
            "Code": "522201",
            "Name": "碧江区"
          },
          {
            "Code": "522222",
            "Name": "江口县"
          },
          {
            "Code": "522223",
            "Name": "玉屏侗族自治县"
          },
          {
            "Code": "522224",
            "Name": "石阡县"
          },
          {
            "Code": "522225",
            "Name": "思南县"
          },
          {
            "Code": "522226",
            "Name": "印江土家族苗族自治县"
          },
          {
            "Code": "522227",
            "Name": "德江县"
          },
          {
            "Code": "522228",
            "Name": "沿河土家族自治县"
          },
          {
            "Code": "522229",
            "Name": "松桃苗族自治县"
          },
          {
            "Code": "522230",
            "Name": "万山区"
          }
        ]
      },
      {
        "Code": "522300",
        "Name": "黔西南布依族苗族自治州",
        "level": [
          {
            "Code": "522301",
            "Name": "兴义市"
          },
          {
            "Code": "522322",
            "Name": "兴仁县"
          },
          {
            "Code": "522323",
            "Name": "普安县"
          },
          {
            "Code": "522324",
            "Name": "晴隆县"
          },
          {
            "Code": "522325",
            "Name": "贞丰县"
          },
          {
            "Code": "522326",
            "Name": "望谟县"
          },
          {
            "Code": "522327",
            "Name": "册亨县"
          },
          {
            "Code": "522328",
            "Name": "安龙县"
          }
        ]
      },
      {
        "Code": "522400",
        "Name": "毕节市",
        "level": [
          {
            "Code": "522401",
            "Name": "七星关区"
          },
          {
            "Code": "522422",
            "Name": "大方县"
          },
          {
            "Code": "522423",
            "Name": "黔西县"
          },
          {
            "Code": "522424",
            "Name": "金沙县"
          },
          {
            "Code": "522425",
            "Name": "织金县"
          },
          {
            "Code": "522426",
            "Name": "纳雍县"
          },
          {
            "Code": "522427",
            "Name": "威宁彝族回族苗族自治县"
          },
          {
            "Code": "522428",
            "Name": "赫章县"
          }
        ]
      },
      {
        "Code": "522600",
        "Name": "黔东南苗族侗族自治州",
        "level": [
          {
            "Code": "522601",
            "Name": "凯里市"
          },
          {
            "Code": "522622",
            "Name": "黄平县"
          },
          {
            "Code": "522623",
            "Name": "施秉县"
          },
          {
            "Code": "522624",
            "Name": "三穗县"
          },
          {
            "Code": "522625",
            "Name": "镇远县"
          },
          {
            "Code": "522626",
            "Name": "岑巩县"
          },
          {
            "Code": "522627",
            "Name": "天柱县"
          },
          {
            "Code": "522628",
            "Name": "锦屏县"
          },
          {
            "Code": "522629",
            "Name": "剑河县"
          },
          {
            "Code": "522630",
            "Name": "台江县"
          },
          {
            "Code": "522631",
            "Name": "黎平县"
          },
          {
            "Code": "522632",
            "Name": "榕江县"
          },
          {
            "Code": "522633",
            "Name": "从江县"
          },
          {
            "Code": "522634",
            "Name": "雷山县"
          },
          {
            "Code": "522635",
            "Name": "麻江县"
          },
          {
            "Code": "522636",
            "Name": "丹寨县"
          }
        ]
      },
      {
        "Code": "522700",
        "Name": "黔南布依族苗族自治州",
        "level": [
          {
            "Code": "522701",
            "Name": "都匀市"
          },
          {
            "Code": "522702",
            "Name": "福泉市"
          },
          {
            "Code": "522722",
            "Name": "荔波县"
          },
          {
            "Code": "522723",
            "Name": "贵定县"
          },
          {
            "Code": "522725",
            "Name": "瓮安县"
          },
          {
            "Code": "522726",
            "Name": "独山县"
          },
          {
            "Code": "522727",
            "Name": "平塘县"
          },
          {
            "Code": "522728",
            "Name": "罗甸县"
          },
          {
            "Code": "522729",
            "Name": "长顺县"
          },
          {
            "Code": "522730",
            "Name": "龙里县"
          },
          {
            "Code": "522731",
            "Name": "惠水县"
          },
          {
            "Code": "522732",
            "Name": "三都水族自治县"
          }
        ]
      }
    ]
  },
  {
    "Code": "530000",
    "Name": "云南省",
    "level": [
      {
        "Code": "530100",
        "Name": "昆明市",
        "level": [
          {
            "Code": "530102",
            "Name": "五华区"
          },
          {
            "Code": "530103",
            "Name": "盘龙区"
          },
          {
            "Code": "530111",
            "Name": "官渡区"
          },
          {
            "Code": "530112",
            "Name": "西山区"
          },
          {
            "Code": "530113",
            "Name": "东川区"
          },
          {
            "Code": "530121",
            "Name": "呈贡区"
          },
          {
            "Code": "530122",
            "Name": "晋宁县"
          },
          {
            "Code": "530124",
            "Name": "富民县"
          },
          {
            "Code": "530125",
            "Name": "宜良县"
          },
          {
            "Code": "530126",
            "Name": "石林彝族自治县"
          },
          {
            "Code": "530127",
            "Name": "嵩明县"
          },
          {
            "Code": "530128",
            "Name": "禄劝彝族苗族自治县"
          },
          {
            "Code": "530129",
            "Name": "寻甸回族彝族自治县"
          },
          {
            "Code": "530181",
            "Name": "安宁市"
          }
        ]
      },
      {
        "Code": "530300",
        "Name": "曲靖市",
        "level": [
          {
            "Code": "530302",
            "Name": "麒麟区"
          },
          {
            "Code": "530321",
            "Name": "马龙县"
          },
          {
            "Code": "530322",
            "Name": "陆良县"
          },
          {
            "Code": "530323",
            "Name": "师宗县"
          },
          {
            "Code": "530324",
            "Name": "罗平县"
          },
          {
            "Code": "530325",
            "Name": "富源县"
          },
          {
            "Code": "530326",
            "Name": "会泽县"
          },
          {
            "Code": "530328",
            "Name": "沾益县"
          },
          {
            "Code": "530381",
            "Name": "宣威市"
          }
        ]
      },
      {
        "Code": "530400",
        "Name": "玉溪市",
        "level": [
          {
            "Code": "530402",
            "Name": "红塔区"
          },
          {
            "Code": "530421",
            "Name": "江川县"
          },
          {
            "Code": "530422",
            "Name": "澄江县"
          },
          {
            "Code": "530423",
            "Name": "通海县"
          },
          {
            "Code": "530424",
            "Name": "华宁县"
          },
          {
            "Code": "530425",
            "Name": "易门县"
          },
          {
            "Code": "530426",
            "Name": "峨山彝族自治县"
          },
          {
            "Code": "530427",
            "Name": "新平彝族傣族自治县"
          },
          {
            "Code": "530428",
            "Name": "元江哈尼族彝族傣族自治县"
          }
        ]
      },
      {
        "Code": "530500",
        "Name": "保山市",
        "level": [
          {
            "Code": "530502",
            "Name": "隆阳区"
          },
          {
            "Code": "530521",
            "Name": "施甸县"
          },
          {
            "Code": "530522",
            "Name": "腾冲县"
          },
          {
            "Code": "530523",
            "Name": "龙陵县"
          },
          {
            "Code": "530524",
            "Name": "昌宁县"
          }
        ]
      },
      {
        "Code": "530600",
        "Name": "昭通市",
        "level": [
          {
            "Code": "530602",
            "Name": "昭阳区"
          },
          {
            "Code": "530621",
            "Name": "鲁甸县"
          },
          {
            "Code": "530622",
            "Name": "巧家县"
          },
          {
            "Code": "530623",
            "Name": "盐津县"
          },
          {
            "Code": "530624",
            "Name": "大关县"
          },
          {
            "Code": "530625",
            "Name": "永善县"
          },
          {
            "Code": "530626",
            "Name": "绥江县"
          },
          {
            "Code": "530627",
            "Name": "镇雄县"
          },
          {
            "Code": "530628",
            "Name": "彝良县"
          },
          {
            "Code": "530629",
            "Name": "威信县"
          },
          {
            "Code": "530630",
            "Name": "水富县"
          }
        ]
      },
      {
        "Code": "530700",
        "Name": "丽江市",
        "level": [
          {
            "Code": "530702",
            "Name": "古城区"
          },
          {
            "Code": "530721",
            "Name": "玉龙纳西族自治县"
          },
          {
            "Code": "530722",
            "Name": "永胜县"
          },
          {
            "Code": "530723",
            "Name": "华坪县"
          },
          {
            "Code": "530724",
            "Name": "宁蒗彝族自治县"
          }
        ]
      },
      {
        "Code": "530800",
        "Name": "普洱市",
        "level": [
          {
            "Code": "530802",
            "Name": "思茅区"
          },
          {
            "Code": "530821",
            "Name": "宁洱哈尼族彝族自治县"
          },
          {
            "Code": "530822",
            "Name": "墨江哈尼族自治县"
          },
          {
            "Code": "530823",
            "Name": "景东彝族自治县"
          },
          {
            "Code": "530824",
            "Name": "景谷傣族彝族自治县"
          },
          {
            "Code": "530825",
            "Name": "镇沅彝族哈尼族拉祜族自治县"
          },
          {
            "Code": "530826",
            "Name": "江城哈尼族彝族自治县"
          },
          {
            "Code": "530827",
            "Name": "孟连傣族拉祜族佤族自治县"
          },
          {
            "Code": "530828",
            "Name": "澜沧拉祜族自治县"
          },
          {
            "Code": "530829",
            "Name": "西盟佤族自治县"
          }
        ]
      },
      {
        "Code": "530900",
        "Name": "临沧市",
        "level": [
          {
            "Code": "530902",
            "Name": "临翔区"
          },
          {
            "Code": "530921",
            "Name": "凤庆县"
          },
          {
            "Code": "530922",
            "Name": "云县"
          },
          {
            "Code": "530923",
            "Name": "永德县"
          },
          {
            "Code": "530924",
            "Name": "镇康县"
          },
          {
            "Code": "530925",
            "Name": "双江拉祜族佤族布朗族傣族自治县"
          },
          {
            "Code": "530926",
            "Name": "耿马傣族佤族自治县"
          },
          {
            "Code": "530927",
            "Name": "沧源佤族自治县"
          }
        ]
      },
      {
        "Code": "532300",
        "Name": "楚雄彝族自治州",
        "level": [
          {
            "Code": "532301",
            "Name": "楚雄市"
          },
          {
            "Code": "532322",
            "Name": "双柏县"
          },
          {
            "Code": "532323",
            "Name": "牟定县"
          },
          {
            "Code": "532324",
            "Name": "南华县"
          },
          {
            "Code": "532325",
            "Name": "姚安县"
          },
          {
            "Code": "532326",
            "Name": "大姚县"
          },
          {
            "Code": "532327",
            "Name": "永仁县"
          },
          {
            "Code": "532328",
            "Name": "元谋县"
          },
          {
            "Code": "532329",
            "Name": "武定县"
          },
          {
            "Code": "532331",
            "Name": "禄丰县"
          }
        ]
      },
      {
        "Code": "532500",
        "Name": "红河哈尼族彝族自治州",
        "level": [
          {
            "Code": "532501",
            "Name": "个旧市"
          },
          {
            "Code": "532502",
            "Name": "开远市"
          },
          {
            "Code": "532522",
            "Name": "蒙自市"
          },
          {
            "Code": "532523",
            "Name": "屏边苗族自治县"
          },
          {
            "Code": "532524",
            "Name": "建水县"
          },
          {
            "Code": "532525",
            "Name": "石屏县"
          },
          {
            "Code": "532526",
            "Name": "弥勒市"
          },
          {
            "Code": "532527",
            "Name": "泸西县"
          },
          {
            "Code": "532528",
            "Name": "元阳县"
          },
          {
            "Code": "532529",
            "Name": "红河县"
          },
          {
            "Code": "532530",
            "Name": "金平苗族瑶族傣族自治县"
          },
          {
            "Code": "532531",
            "Name": "绿春县"
          },
          {
            "Code": "532532",
            "Name": "河口瑶族自治县"
          }
        ]
      },
      {
        "Code": "532600",
        "Name": "文山壮族苗族自治州",
        "level": [
          {
            "Code": "532621",
            "Name": "文山市"
          },
          {
            "Code": "532622",
            "Name": "砚山县"
          },
          {
            "Code": "532623",
            "Name": "西畴县"
          },
          {
            "Code": "532624",
            "Name": "麻栗坡县"
          },
          {
            "Code": "532625",
            "Name": "马关县"
          },
          {
            "Code": "532626",
            "Name": "丘北县"
          },
          {
            "Code": "532627",
            "Name": "广南县"
          },
          {
            "Code": "532628",
            "Name": "富宁县"
          }
        ]
      },
      {
        "Code": "532800",
        "Name": "西双版纳傣族自治州",
        "level": [
          {
            "Code": "532801",
            "Name": "景洪市"
          },
          {
            "Code": "532822",
            "Name": "勐海县"
          },
          {
            "Code": "532823",
            "Name": "勐腊县"
          }
        ]
      },
      {
        "Code": "532900",
        "Name": "大理白族自治州",
        "level": [
          {
            "Code": "532901",
            "Name": "大理市"
          },
          {
            "Code": "532922",
            "Name": "漾濞彝族自治县"
          },
          {
            "Code": "532923",
            "Name": "祥云县"
          },
          {
            "Code": "532924",
            "Name": "宾川县"
          },
          {
            "Code": "532925",
            "Name": "弥渡县"
          },
          {
            "Code": "532926",
            "Name": "南涧彝族自治县"
          },
          {
            "Code": "532927",
            "Name": "巍山彝族回族自治县"
          },
          {
            "Code": "532928",
            "Name": "永平县"
          },
          {
            "Code": "532929",
            "Name": "云龙县"
          },
          {
            "Code": "532930",
            "Name": "洱源县"
          },
          {
            "Code": "532931",
            "Name": "剑川县"
          },
          {
            "Code": "532932",
            "Name": "鹤庆县"
          }
        ]
      },
      {
        "Code": "533100",
        "Name": "德宏傣族景颇族自治州",
        "level": [
          {
            "Code": "533102",
            "Name": "瑞丽市"
          },
          {
            "Code": "533103",
            "Name": "芒市"
          },
          {
            "Code": "533122",
            "Name": "梁河县"
          },
          {
            "Code": "533123",
            "Name": "盈江县"
          },
          {
            "Code": "533124",
            "Name": "陇川县"
          }
        ]
      },
      {
        "Code": "533300",
        "Name": "怒江傈僳族自治州",
        "level": [
          {
            "Code": "533321",
            "Name": "泸水县"
          },
          {
            "Code": "533323",
            "Name": "福贡县"
          },
          {
            "Code": "533324",
            "Name": "贡山独龙族怒族自治县"
          },
          {
            "Code": "533325",
            "Name": "兰坪白族普米族自治县"
          }
        ]
      },
      {
        "Code": "533400",
        "Name": "迪庆藏族自治州",
        "level": [
          {
            "Code": "533421",
            "Name": "香格里拉县"
          },
          {
            "Code": "533422",
            "Name": "德钦县"
          },
          {
            "Code": "533423",
            "Name": "维西傈僳族自治县"
          }
        ]
      }
    ]
  },
  {
    "Code": "540000",
    "Name": "西藏自治区",
    "level": [
      {
        "Code": "540100",
        "Name": "拉萨市",
        "level": [
          {
            "Code": "540102",
            "Name": "城关区"
          },
          {
            "Code": "540121",
            "Name": "林周县"
          },
          {
            "Code": "540122",
            "Name": "当雄县"
          },
          {
            "Code": "540123",
            "Name": "尼木县"
          },
          {
            "Code": "540124",
            "Name": "曲水县"
          },
          {
            "Code": "540125",
            "Name": "堆龙德庆县"
          },
          {
            "Code": "540126",
            "Name": "达孜县"
          },
          {
            "Code": "540127",
            "Name": "墨竹工卡县"
          }
        ]
      },
      {
        "Code": "542100",
        "Name": "昌都地区",
        "level": [
          {
            "Code": "542121",
            "Name": "昌都县"
          },
          {
            "Code": "542122",
            "Name": "江达县"
          },
          {
            "Code": "542123",
            "Name": "贡觉县"
          },
          {
            "Code": "542124",
            "Name": "类乌齐县"
          },
          {
            "Code": "542125",
            "Name": "丁青县"
          },
          {
            "Code": "542126",
            "Name": "察雅县"
          },
          {
            "Code": "542127",
            "Name": "八宿县"
          },
          {
            "Code": "542128",
            "Name": "左贡县"
          },
          {
            "Code": "542129",
            "Name": "芒康县"
          },
          {
            "Code": "542132",
            "Name": "洛隆县"
          },
          {
            "Code": "542133",
            "Name": "边坝县"
          }
        ]
      },
      {
        "Code": "542200",
        "Name": "山南地区",
        "level": [
          {
            "Code": "542221",
            "Name": "乃东县"
          },
          {
            "Code": "542222",
            "Name": "扎囊县"
          },
          {
            "Code": "542223",
            "Name": "贡嘎县"
          },
          {
            "Code": "542224",
            "Name": "桑日县"
          },
          {
            "Code": "542225",
            "Name": "琼结县"
          },
          {
            "Code": "542226",
            "Name": "曲松县"
          },
          {
            "Code": "542227",
            "Name": "措美县"
          },
          {
            "Code": "542228",
            "Name": "洛扎县"
          },
          {
            "Code": "542229",
            "Name": "加查县"
          },
          {
            "Code": "542231",
            "Name": "隆子县"
          },
          {
            "Code": "542232",
            "Name": "错那县"
          },
          {
            "Code": "542233",
            "Name": "浪卡子县"
          }
        ]
      },
      {
        "Code": "542300",
        "Name": "日喀则地区",
        "level": [
          {
            "Code": "542301",
            "Name": "日喀则市"
          },
          {
            "Code": "542322",
            "Name": "南木林县"
          },
          {
            "Code": "542323",
            "Name": "江孜县"
          },
          {
            "Code": "542324",
            "Name": "定日县"
          },
          {
            "Code": "542325",
            "Name": "萨迦县"
          },
          {
            "Code": "542326",
            "Name": "拉孜县"
          },
          {
            "Code": "542327",
            "Name": "昂仁县"
          },
          {
            "Code": "542328",
            "Name": "谢通门县"
          },
          {
            "Code": "542329",
            "Name": "白朗县"
          },
          {
            "Code": "542330",
            "Name": "仁布县"
          },
          {
            "Code": "542331",
            "Name": "康马县"
          },
          {
            "Code": "542332",
            "Name": "定结县"
          },
          {
            "Code": "542333",
            "Name": "仲巴县"
          },
          {
            "Code": "542334",
            "Name": "亚东县"
          },
          {
            "Code": "542335",
            "Name": "吉隆县"
          },
          {
            "Code": "542336",
            "Name": "聂拉木县"
          },
          {
            "Code": "542337",
            "Name": "萨嘎县"
          },
          {
            "Code": "542338",
            "Name": "岗巴县"
          }
        ]
      },
      {
        "Code": "542400",
        "Name": "那曲地区",
        "level": [
          {
            "Code": "542421",
            "Name": "那曲县"
          },
          {
            "Code": "542422",
            "Name": "嘉黎县"
          },
          {
            "Code": "542423",
            "Name": "比如县"
          },
          {
            "Code": "542424",
            "Name": "聂荣县"
          },
          {
            "Code": "542425",
            "Name": "安多县"
          },
          {
            "Code": "542426",
            "Name": "申扎县"
          },
          {
            "Code": "542427",
            "Name": "索县"
          },
          {
            "Code": "542428",
            "Name": "班戈县"
          },
          {
            "Code": "542429",
            "Name": "巴青县"
          },
          {
            "Code": "542430",
            "Name": "尼玛县"
          },
          {
            "Code": "542432",
            "Name": "双湖县"
          }
        ]
      },
      {
        "Code": "542500",
        "Name": "阿里地区",
        "level": [
          {
            "Code": "542521",
            "Name": "普兰县"
          },
          {
            "Code": "542522",
            "Name": "札达县"
          },
          {
            "Code": "542523",
            "Name": "噶尔县"
          },
          {
            "Code": "542524",
            "Name": "日土县"
          },
          {
            "Code": "542525",
            "Name": "革吉县"
          },
          {
            "Code": "542526",
            "Name": "改则县"
          },
          {
            "Code": "542527",
            "Name": "措勤县"
          }
        ]
      },
      {
        "Code": "542600",
        "Name": "林芝地区",
        "level": [
          {
            "Code": "542621",
            "Name": "林芝县"
          },
          {
            "Code": "542622",
            "Name": "工布江达县"
          },
          {
            "Code": "542623",
            "Name": "米林县"
          },
          {
            "Code": "542624",
            "Name": "墨脱县"
          },
          {
            "Code": "542625",
            "Name": "波密县"
          },
          {
            "Code": "542626",
            "Name": "察隅县"
          },
          {
            "Code": "542627",
            "Name": "朗县"
          }
        ]
      }
    ]
  },
  {
    "Code": "610000",
    "Name": "陕西省",
    "level": [
      {
        "Code": "610100",
        "Name": "西安市",
        "level": [
          {
            "Code": "610102",
            "Name": "新城区"
          },
          {
            "Code": "610103",
            "Name": "碑林区"
          },
          {
            "Code": "610104",
            "Name": "莲湖区"
          },
          {
            "Code": "610111",
            "Name": "灞桥区"
          },
          {
            "Code": "610112",
            "Name": "未央区"
          },
          {
            "Code": "610113",
            "Name": "雁塔区"
          },
          {
            "Code": "610114",
            "Name": "阎良区"
          },
          {
            "Code": "610115",
            "Name": "临潼区"
          },
          {
            "Code": "610116",
            "Name": "长安区"
          },
          {
            "Code": "610122",
            "Name": "蓝田县"
          },
          {
            "Code": "610124",
            "Name": "周至县"
          },
          {
            "Code": "610125",
            "Name": "户县"
          },
          {
            "Code": "610126",
            "Name": "高陵县"
          }
        ]
      },
      {
        "Code": "610200",
        "Name": "铜川市",
        "level": [
          {
            "Code": "610202",
            "Name": "王益区"
          },
          {
            "Code": "610203",
            "Name": "印台区"
          },
          {
            "Code": "610204",
            "Name": "耀州区"
          },
          {
            "Code": "610222",
            "Name": "宜君县"
          }
        ]
      },
      {
        "Code": "610300",
        "Name": "宝鸡市",
        "level": [
          {
            "Code": "610302",
            "Name": "渭滨区"
          },
          {
            "Code": "610303",
            "Name": "金台区"
          },
          {
            "Code": "610304",
            "Name": "陈仓区"
          },
          {
            "Code": "610322",
            "Name": "凤翔县"
          },
          {
            "Code": "610323",
            "Name": "岐山县"
          },
          {
            "Code": "610324",
            "Name": "扶风县"
          },
          {
            "Code": "610326",
            "Name": "眉县"
          },
          {
            "Code": "610327",
            "Name": "陇县"
          },
          {
            "Code": "610328",
            "Name": "千阳县"
          },
          {
            "Code": "610329",
            "Name": "麟游县"
          },
          {
            "Code": "610330",
            "Name": "凤县"
          },
          {
            "Code": "610331",
            "Name": "太白县"
          }
        ]
      },
      {
        "Code": "610400",
        "Name": "咸阳市",
        "level": [
          {
            "Code": "610402",
            "Name": "秦都区"
          },
          {
            "Code": "610403",
            "Name": "杨陵区"
          },
          {
            "Code": "610404",
            "Name": "渭城区"
          },
          {
            "Code": "610422",
            "Name": "三原县"
          },
          {
            "Code": "610423",
            "Name": "泾阳县"
          },
          {
            "Code": "610424",
            "Name": "乾县"
          },
          {
            "Code": "610425",
            "Name": "礼泉县"
          },
          {
            "Code": "610426",
            "Name": "永寿县"
          },
          {
            "Code": "610427",
            "Name": "彬县"
          },
          {
            "Code": "610428",
            "Name": "长武县"
          },
          {
            "Code": "610429",
            "Name": "旬邑县"
          },
          {
            "Code": "610430",
            "Name": "淳化县"
          },
          {
            "Code": "610431",
            "Name": "武功县"
          },
          {
            "Code": "610481",
            "Name": "兴平市"
          }
        ]
      },
      {
        "Code": "610500",
        "Name": "渭南市",
        "level": [
          {
            "Code": "610502",
            "Name": "临渭区"
          },
          {
            "Code": "610521",
            "Name": "华县"
          },
          {
            "Code": "610522",
            "Name": "潼关县"
          },
          {
            "Code": "610523",
            "Name": "大荔县"
          },
          {
            "Code": "610524",
            "Name": "合阳县"
          },
          {
            "Code": "610525",
            "Name": "澄城县"
          },
          {
            "Code": "610526",
            "Name": "蒲城县"
          },
          {
            "Code": "610527",
            "Name": "白水县"
          },
          {
            "Code": "610528",
            "Name": "富平县"
          },
          {
            "Code": "610581",
            "Name": "韩城市"
          },
          {
            "Code": "610582",
            "Name": "华阴市"
          }
        ]
      },
      {
        "Code": "610600",
        "Name": "延安市",
        "level": [
          {
            "Code": "610602",
            "Name": "宝塔区"
          },
          {
            "Code": "610621",
            "Name": "延长县"
          },
          {
            "Code": "610622",
            "Name": "延川县"
          },
          {
            "Code": "610623",
            "Name": "子长县"
          },
          {
            "Code": "610624",
            "Name": "安塞县"
          },
          {
            "Code": "610625",
            "Name": "志丹县"
          },
          {
            "Code": "610626",
            "Name": "吴起县"
          },
          {
            "Code": "610627",
            "Name": "甘泉县"
          },
          {
            "Code": "610628",
            "Name": "富县"
          },
          {
            "Code": "610629",
            "Name": "洛川县"
          },
          {
            "Code": "610630",
            "Name": "宜川县"
          },
          {
            "Code": "610631",
            "Name": "黄龙县"
          },
          {
            "Code": "610632",
            "Name": "黄陵县"
          }
        ]
      },
      {
        "Code": "610700",
        "Name": "汉中市",
        "level": [
          {
            "Code": "610702",
            "Name": "汉台区"
          },
          {
            "Code": "610721",
            "Name": "南郑县"
          },
          {
            "Code": "610722",
            "Name": "城固县"
          },
          {
            "Code": "610723",
            "Name": "洋县"
          },
          {
            "Code": "610724",
            "Name": "西乡县"
          },
          {
            "Code": "610725",
            "Name": "勉县"
          },
          {
            "Code": "610726",
            "Name": "宁强县"
          },
          {
            "Code": "610727",
            "Name": "略阳县"
          },
          {
            "Code": "610728",
            "Name": "镇巴县"
          },
          {
            "Code": "610729",
            "Name": "留坝县"
          },
          {
            "Code": "610730",
            "Name": "佛坪县"
          }
        ]
      },
      {
        "Code": "610800",
        "Name": "榆林市",
        "level": [
          {
            "Code": "610802",
            "Name": "榆阳区"
          },
          {
            "Code": "610821",
            "Name": "神木县"
          },
          {
            "Code": "610822",
            "Name": "府谷县"
          },
          {
            "Code": "610823",
            "Name": "横山县"
          },
          {
            "Code": "610824",
            "Name": "靖边县"
          },
          {
            "Code": "610825",
            "Name": "定边县"
          },
          {
            "Code": "610826",
            "Name": "绥德县"
          },
          {
            "Code": "610827",
            "Name": "米脂县"
          },
          {
            "Code": "610828",
            "Name": "佳县"
          },
          {
            "Code": "610829",
            "Name": "吴堡县"
          },
          {
            "Code": "610830",
            "Name": "清涧县"
          },
          {
            "Code": "610831",
            "Name": "子洲县"
          }
        ]
      },
      {
        "Code": "610900",
        "Name": "安康市",
        "level": [
          {
            "Code": "610902",
            "Name": "汉滨区"
          },
          {
            "Code": "610921",
            "Name": "汉阴县"
          },
          {
            "Code": "610922",
            "Name": "石泉县"
          },
          {
            "Code": "610923",
            "Name": "宁陕县"
          },
          {
            "Code": "610924",
            "Name": "紫阳县"
          },
          {
            "Code": "610925",
            "Name": "岚皋县"
          },
          {
            "Code": "610926",
            "Name": "平利县"
          },
          {
            "Code": "610927",
            "Name": "镇坪县"
          },
          {
            "Code": "610928",
            "Name": "旬阳县"
          },
          {
            "Code": "610929",
            "Name": "白河县"
          }
        ]
      },
      {
        "Code": "611000",
        "Name": "商洛市",
        "level": [
          {
            "Code": "611002",
            "Name": "商州区"
          },
          {
            "Code": "611021",
            "Name": "洛南县"
          },
          {
            "Code": "611022",
            "Name": "丹凤县"
          },
          {
            "Code": "611023",
            "Name": "商南县"
          },
          {
            "Code": "611024",
            "Name": "山阳县"
          },
          {
            "Code": "611025",
            "Name": "镇安县"
          },
          {
            "Code": "611026",
            "Name": "柞水县"
          }
        ]
      }
    ]
  },
  {
    "Code": "620000",
    "Name": "甘肃省",
    "level": [
      {
        "Code": "620100",
        "Name": "兰州市",
        "level": [
          {
            "Code": "620102",
            "Name": "城关区"
          },
          {
            "Code": "620103",
            "Name": "七里河区"
          },
          {
            "Code": "620104",
            "Name": "西固区"
          },
          {
            "Code": "620105",
            "Name": "安宁区"
          },
          {
            "Code": "620111",
            "Name": "红古区"
          },
          {
            "Code": "620121",
            "Name": "永登县"
          },
          {
            "Code": "620122",
            "Name": "皋兰县"
          },
          {
            "Code": "620123",
            "Name": "榆中县"
          }
        ]
      },
      {
        "Code": "620200",
        "Name": "嘉峪关市",
        "level": [
          {
            "Code": "620201100",
            "Name": "新城镇"
          },
          {
            "Code": "620201101",
            "Name": "峪泉镇"
          },
          {
            "Code": "620201102",
            "Name": "文殊镇"
          },
          {
            "Code": "620201401",
            "Name": "雄关区"
          },
          {
            "Code": "620201402",
            "Name": "镜铁区"
          },
          {
            "Code": "620201403",
            "Name": "长城区"
          }
        ]
      },
      {
        "Code": "620300",
        "Name": "金昌市",
        "level": [
          {
            "Code": "620302",
            "Name": "金川区"
          },
          {
            "Code": "620321",
            "Name": "永昌县"
          }
        ]
      },
      {
        "Code": "620400",
        "Name": "白银市",
        "level": [
          {
            "Code": "620402",
            "Name": "白银区"
          },
          {
            "Code": "620403",
            "Name": "平川区"
          },
          {
            "Code": "620421",
            "Name": "靖远县"
          },
          {
            "Code": "620422",
            "Name": "会宁县"
          },
          {
            "Code": "620423",
            "Name": "景泰县"
          }
        ]
      },
      {
        "Code": "620500",
        "Name": "天水市",
        "level": [
          {
            "Code": "620502",
            "Name": "秦州区"
          },
          {
            "Code": "620503",
            "Name": "麦积区"
          },
          {
            "Code": "620521",
            "Name": "清水县"
          },
          {
            "Code": "620522",
            "Name": "秦安县"
          },
          {
            "Code": "620523",
            "Name": "甘谷县"
          },
          {
            "Code": "620524",
            "Name": "武山县"
          },
          {
            "Code": "620525",
            "Name": "张家川回族自治县"
          }
        ]
      },
      {
        "Code": "620600",
        "Name": "武威市",
        "level": [
          {
            "Code": "620602",
            "Name": "凉州区"
          },
          {
            "Code": "620621",
            "Name": "民勤县"
          },
          {
            "Code": "620622",
            "Name": "古浪县"
          },
          {
            "Code": "620623",
            "Name": "天祝藏族自治县"
          }
        ]
      },
      {
        "Code": "620700",
        "Name": "张掖市",
        "level": [
          {
            "Code": "620702",
            "Name": "甘州区"
          },
          {
            "Code": "620721",
            "Name": "肃南裕固族自治县"
          },
          {
            "Code": "620722",
            "Name": "民乐县"
          },
          {
            "Code": "620723",
            "Name": "临泽县"
          },
          {
            "Code": "620724",
            "Name": "高台县"
          },
          {
            "Code": "620725",
            "Name": "山丹县"
          }
        ]
      },
      {
        "Code": "620800",
        "Name": "平凉市",
        "level": [
          {
            "Code": "620802",
            "Name": "崆峒区"
          },
          {
            "Code": "620821",
            "Name": "泾川县"
          },
          {
            "Code": "620822",
            "Name": "灵台县"
          },
          {
            "Code": "620823",
            "Name": "崇信县"
          },
          {
            "Code": "620824",
            "Name": "华亭县"
          },
          {
            "Code": "620825",
            "Name": "庄浪县"
          },
          {
            "Code": "620826",
            "Name": "静宁县"
          }
        ]
      },
      {
        "Code": "620900",
        "Name": "酒泉市",
        "level": [
          {
            "Code": "620902",
            "Name": "肃州区"
          },
          {
            "Code": "620921",
            "Name": "金塔县"
          },
          {
            "Code": "620922",
            "Name": "瓜州县"
          },
          {
            "Code": "620923",
            "Name": "肃北蒙古族自治县"
          },
          {
            "Code": "620924",
            "Name": "阿克塞哈萨克族自治县"
          },
          {
            "Code": "620981",
            "Name": "玉门市"
          },
          {
            "Code": "620982",
            "Name": "敦煌市"
          }
        ]
      },
      {
        "Code": "621000",
        "Name": "庆阳市",
        "level": [
          {
            "Code": "621002",
            "Name": "西峰区"
          },
          {
            "Code": "621021",
            "Name": "庆城县"
          },
          {
            "Code": "621022",
            "Name": "环县"
          },
          {
            "Code": "621023",
            "Name": "华池县"
          },
          {
            "Code": "621024",
            "Name": "合水县"
          },
          {
            "Code": "621025",
            "Name": "正宁县"
          },
          {
            "Code": "621026",
            "Name": "宁县"
          },
          {
            "Code": "621027",
            "Name": "镇原县"
          }
        ]
      },
      {
        "Code": "621100",
        "Name": "定西市",
        "level": [
          {
            "Code": "621102",
            "Name": "安定区"
          },
          {
            "Code": "621121",
            "Name": "通渭县"
          },
          {
            "Code": "621122",
            "Name": "陇西县"
          },
          {
            "Code": "621123",
            "Name": "渭源县"
          },
          {
            "Code": "621124",
            "Name": "临洮县"
          },
          {
            "Code": "621125",
            "Name": "漳县"
          },
          {
            "Code": "621126",
            "Name": "岷县"
          }
        ]
      },
      {
        "Code": "621200",
        "Name": "陇南市",
        "level": [
          {
            "Code": "621202",
            "Name": "武都区"
          },
          {
            "Code": "621221",
            "Name": "成县"
          },
          {
            "Code": "621222",
            "Name": "文县"
          },
          {
            "Code": "621223",
            "Name": "宕昌县"
          },
          {
            "Code": "621224",
            "Name": "康县"
          },
          {
            "Code": "621225",
            "Name": "西和县"
          },
          {
            "Code": "621226",
            "Name": "礼县"
          },
          {
            "Code": "621227",
            "Name": "徽县"
          },
          {
            "Code": "621228",
            "Name": "两当县"
          }
        ]
      },
      {
        "Code": "622900",
        "Name": "临夏回族自治州",
        "level": [
          {
            "Code": "622901",
            "Name": "临夏市"
          },
          {
            "Code": "622921",
            "Name": "临夏县"
          },
          {
            "Code": "622922",
            "Name": "康乐县"
          },
          {
            "Code": "622923",
            "Name": "永靖县"
          },
          {
            "Code": "622924",
            "Name": "广河县"
          },
          {
            "Code": "622925",
            "Name": "和政县"
          },
          {
            "Code": "622926",
            "Name": "东乡族自治县"
          },
          {
            "Code": "622927",
            "Name": "积石山保安族东乡族撒拉族自治县"
          }
        ]
      },
      {
        "Code": "623000",
        "Name": "甘南藏族自治州",
        "level": [
          {
            "Code": "623001",
            "Name": "合作市"
          },
          {
            "Code": "623021",
            "Name": "临潭县"
          },
          {
            "Code": "623022",
            "Name": "卓尼县"
          },
          {
            "Code": "623023",
            "Name": "舟曲县"
          },
          {
            "Code": "623024",
            "Name": "迭部县"
          },
          {
            "Code": "623025",
            "Name": "玛曲县"
          },
          {
            "Code": "623026",
            "Name": "碌曲县"
          },
          {
            "Code": "623027",
            "Name": "夏河县"
          }
        ]
      }
    ]
  },
  {
    "Code": "630000",
    "Name": "青海省",
    "level": [
      {
        "Code": "630100",
        "Name": "西宁市",
        "level": [
          {
            "Code": "630102",
            "Name": "城东区"
          },
          {
            "Code": "630103",
            "Name": "城中区"
          },
          {
            "Code": "630104",
            "Name": "城西区"
          },
          {
            "Code": "630105",
            "Name": "城北区"
          },
          {
            "Code": "630121",
            "Name": "大通回族土族自治县"
          },
          {
            "Code": "630122",
            "Name": "湟中县"
          },
          {
            "Code": "630123",
            "Name": "湟源县"
          }
        ]
      },
      {
        "Code": "632100",
        "Name": "海东市",
        "level": [
          {
            "Code": "632121",
            "Name": "平安县"
          },
          {
            "Code": "632122",
            "Name": "民和回族土族自治县"
          },
          {
            "Code": "632123",
            "Name": "乐都区"
          },
          {
            "Code": "632126",
            "Name": "互助土族自治县"
          },
          {
            "Code": "632127",
            "Name": "化隆回族自治县"
          },
          {
            "Code": "632128",
            "Name": "循化撒拉族自治县"
          }
        ]
      },
      {
        "Code": "632200",
        "Name": "海北藏族自治州",
        "level": [
          {
            "Code": "632221",
            "Name": "门源回族自治县"
          },
          {
            "Code": "632222",
            "Name": "祁连县"
          },
          {
            "Code": "632223",
            "Name": "海晏县"
          },
          {
            "Code": "632224",
            "Name": "刚察县"
          }
        ]
      },
      {
        "Code": "632300",
        "Name": "黄南藏族自治州",
        "level": [
          {
            "Code": "632321",
            "Name": "同仁县"
          },
          {
            "Code": "632322",
            "Name": "尖扎县"
          },
          {
            "Code": "632323",
            "Name": "泽库县"
          },
          {
            "Code": "632324",
            "Name": "河南蒙古族自治县"
          }
        ]
      },
      {
        "Code": "632500",
        "Name": "海南藏族自治州",
        "level": [
          {
            "Code": "632521",
            "Name": "共和县"
          },
          {
            "Code": "632522",
            "Name": "同德县"
          },
          {
            "Code": "632523",
            "Name": "贵德县"
          },
          {
            "Code": "632524",
            "Name": "兴海县"
          },
          {
            "Code": "632525",
            "Name": "贵南县"
          }
        ]
      },
      {
        "Code": "632600",
        "Name": "果洛藏族自治州",
        "level": [
          {
            "Code": "632621",
            "Name": "玛沁县"
          },
          {
            "Code": "632622",
            "Name": "班玛县"
          },
          {
            "Code": "632623",
            "Name": "甘德县"
          },
          {
            "Code": "632624",
            "Name": "达日县"
          },
          {
            "Code": "632625",
            "Name": "久治县"
          },
          {
            "Code": "632626",
            "Name": "玛多县"
          }
        ]
      },
      {
        "Code": "632700",
        "Name": "玉树藏族自治州",
        "level": [
          {
            "Code": "632721",
            "Name": "玉树市"
          },
          {
            "Code": "632722",
            "Name": "杂多县"
          },
          {
            "Code": "632723",
            "Name": "称多县"
          },
          {
            "Code": "632724",
            "Name": "治多县"
          },
          {
            "Code": "632725",
            "Name": "囊谦县"
          },
          {
            "Code": "632726",
            "Name": "曲麻莱县"
          }
        ]
      },
      {
        "Code": "632800",
        "Name": "海西蒙古族藏族自治州",
        "level": [
          {
            "Code": "632801",
            "Name": "格尔木市"
          },
          {
            "Code": "632802",
            "Name": "德令哈市"
          },
          {
            "Code": "632821",
            "Name": "乌兰县"
          },
          {
            "Code": "632822",
            "Name": "都兰县"
          },
          {
            "Code": "632823",
            "Name": "天峻县"
          }
        ]
      }
    ]
  },
  {
    "Code": "640000",
    "Name": "宁夏回族自治区",
    "level": [
      {
        "Code": "640100",
        "Name": "银川市",
        "level": [
          {
            "Code": "640104",
            "Name": "兴庆区"
          },
          {
            "Code": "640105",
            "Name": "西夏区"
          },
          {
            "Code": "640106",
            "Name": "金凤区"
          },
          {
            "Code": "640121",
            "Name": "永宁县"
          },
          {
            "Code": "640122",
            "Name": "贺兰县"
          },
          {
            "Code": "640181",
            "Name": "灵武市"
          }
        ]
      },
      {
        "Code": "640200",
        "Name": "石嘴山市",
        "level": [
          {
            "Code": "640202",
            "Name": "大武口区"
          },
          {
            "Code": "640205",
            "Name": "惠农区"
          },
          {
            "Code": "640221",
            "Name": "平罗县"
          }
        ]
      },
      {
        "Code": "640300",
        "Name": "吴忠市",
        "level": [
          {
            "Code": "640302",
            "Name": "利通区"
          },
          {
            "Code": "640303",
            "Name": "红寺堡区"
          },
          {
            "Code": "640323",
            "Name": "盐池县"
          },
          {
            "Code": "640324",
            "Name": "同心县"
          },
          {
            "Code": "640381",
            "Name": "青铜峡市"
          }
        ]
      },
      {
        "Code": "640400",
        "Name": "固原市",
        "level": [
          {
            "Code": "640402",
            "Name": "原州区"
          },
          {
            "Code": "640422",
            "Name": "西吉县"
          },
          {
            "Code": "640423",
            "Name": "隆德县"
          },
          {
            "Code": "640424",
            "Name": "泾源县"
          },
          {
            "Code": "640425",
            "Name": "彭阳县"
          }
        ]
      },
      {
        "Code": "640500",
        "Name": "中卫市",
        "level": [
          {
            "Code": "640502",
            "Name": "沙坡头区"
          },
          {
            "Code": "640521",
            "Name": "中宁县"
          },
          {
            "Code": "640522",
            "Name": "海原县"
          }
        ]
      }
    ]
  },
  {
    "Code": "650000",
    "Name": "新疆维吾尔自治区",
    "level": [
      {
        "Code": "650100",
        "Name": "乌鲁木齐市",
        "level": [
          {
            "Code": "650102",
            "Name": "天山区"
          },
          {
            "Code": "650103",
            "Name": "沙依巴克区"
          },
          {
            "Code": "650104",
            "Name": "新市区"
          },
          {
            "Code": "650105",
            "Name": "水磨沟区"
          },
          {
            "Code": "650106",
            "Name": "头屯河区"
          },
          {
            "Code": "650107",
            "Name": "达坂城区"
          },
          {
            "Code": "650109",
            "Name": "米东区"
          },
          {
            "Code": "650121",
            "Name": "乌鲁木齐县"
          }
        ]
      },
      {
        "Code": "650200",
        "Name": "克拉玛依市",
        "level": [
          {
            "Code": "650202",
            "Name": "独山子区"
          },
          {
            "Code": "650203",
            "Name": "克拉玛依区"
          },
          {
            "Code": "650204",
            "Name": "白碱滩区"
          },
          {
            "Code": "650205",
            "Name": "乌尔禾区"
          }
        ]
      },
      {
        "Code": "652100",
        "Name": "吐鲁番地区",
        "level": [
          {
            "Code": "652101",
            "Name": "吐鲁番市"
          },
          {
            "Code": "652122",
            "Name": "鄯善县"
          },
          {
            "Code": "652123",
            "Name": "托克逊县"
          }
        ]
      },
      {
        "Code": "652200",
        "Name": "哈密地区",
        "level": [
          {
            "Code": "652201",
            "Name": "哈密市"
          },
          {
            "Code": "652222",
            "Name": "巴里坤哈萨克自治县"
          },
          {
            "Code": "652223",
            "Name": "伊吾县"
          }
        ]
      },
      {
        "Code": "652300",
        "Name": "昌吉回族自治州",
        "level": [
          {
            "Code": "652301",
            "Name": "昌吉市"
          },
          {
            "Code": "652302",
            "Name": "阜康市"
          },
          {
            "Code": "652323",
            "Name": "呼图壁县"
          },
          {
            "Code": "652324",
            "Name": "玛纳斯县"
          },
          {
            "Code": "652325",
            "Name": "奇台县"
          },
          {
            "Code": "652327",
            "Name": "吉木萨尔县"
          },
          {
            "Code": "652328",
            "Name": "木垒哈萨克自治县"
          }
        ]
      },
      {
        "Code": "652700",
        "Name": "博尔塔拉蒙古自治州",
        "level": [
          {
            "Code": "652701",
            "Name": "博乐市"
          },
          {
            "Code": "652702",
            "Name": "阿拉山口市"
          },
          {
            "Code": "652722",
            "Name": "精河县"
          },
          {
            "Code": "652723",
            "Name": "温泉县"
          }
        ]
      },
      {
        "Code": "652800",
        "Name": "巴音郭楞蒙古自治州",
        "level": [
          {
            "Code": "652801",
            "Name": "库尔勒市"
          },
          {
            "Code": "652822",
            "Name": "轮台县"
          },
          {
            "Code": "652823",
            "Name": "尉犁县"
          },
          {
            "Code": "652824",
            "Name": "若羌县"
          },
          {
            "Code": "652825",
            "Name": "且末县"
          },
          {
            "Code": "652826",
            "Name": "焉耆回族自治县"
          },
          {
            "Code": "652827",
            "Name": "和静县"
          },
          {
            "Code": "652828",
            "Name": "和硕县"
          },
          {
            "Code": "652829",
            "Name": "博湖县"
          }
        ]
      },
      {
        "Code": "652900",
        "Name": "阿克苏地区",
        "level": [
          {
            "Code": "652901",
            "Name": "阿克苏市"
          },
          {
            "Code": "652922",
            "Name": "温宿县"
          },
          {
            "Code": "652923",
            "Name": "库车县"
          },
          {
            "Code": "652924",
            "Name": "沙雅县"
          },
          {
            "Code": "652925",
            "Name": "新和县"
          },
          {
            "Code": "652926",
            "Name": "拜城县"
          },
          {
            "Code": "652927",
            "Name": "乌什县"
          },
          {
            "Code": "652928",
            "Name": "阿瓦提县"
          },
          {
            "Code": "652929",
            "Name": "柯坪县"
          }
        ]
      },
      {
        "Code": "653000",
        "Name": "克孜勒苏柯尔克孜自治州",
        "level": [
          {
            "Code": "653001",
            "Name": "阿图什市"
          },
          {
            "Code": "653022",
            "Name": "阿克陶县"
          },
          {
            "Code": "653023",
            "Name": "阿合奇县"
          },
          {
            "Code": "653024",
            "Name": "乌恰县"
          }
        ]
      },
      {
        "Code": "653100",
        "Name": "喀什地区",
        "level": [
          {
            "Code": "653101",
            "Name": "喀什市"
          },
          {
            "Code": "653121",
            "Name": "疏附县"
          },
          {
            "Code": "653122",
            "Name": "疏勒县"
          },
          {
            "Code": "653123",
            "Name": "英吉沙县"
          },
          {
            "Code": "653124",
            "Name": "泽普县"
          },
          {
            "Code": "653125",
            "Name": "莎车县"
          },
          {
            "Code": "653126",
            "Name": "叶城县"
          },
          {
            "Code": "653127",
            "Name": "麦盖提县"
          },
          {
            "Code": "653128",
            "Name": "岳普湖县"
          },
          {
            "Code": "653129",
            "Name": "伽师县"
          },
          {
            "Code": "653130",
            "Name": "巴楚县"
          },
          {
            "Code": "653131",
            "Name": "塔什库尔干塔吉克自治县"
          }
        ]
      },
      {
        "Code": "653200",
        "Name": "和田地区",
        "level": [
          {
            "Code": "653201",
            "Name": "和田市"
          },
          {
            "Code": "653221",
            "Name": "和田县"
          },
          {
            "Code": "653222",
            "Name": "墨玉县"
          },
          {
            "Code": "653223",
            "Name": "皮山县"
          },
          {
            "Code": "653224",
            "Name": "洛浦县"
          },
          {
            "Code": "653225",
            "Name": "策勒县"
          },
          {
            "Code": "653226",
            "Name": "于田县"
          },
          {
            "Code": "653227",
            "Name": "民丰县"
          }
        ]
      },
      {
        "Code": "654000",
        "Name": "伊犁哈萨克自治州",
        "level": [
          {
            "Code": "654002",
            "Name": "伊宁市"
          },
          {
            "Code": "654003",
            "Name": "奎屯市"
          },
          {
            "Code": "654021",
            "Name": "伊宁县"
          },
          {
            "Code": "654022",
            "Name": "察布查尔锡伯自治县"
          },
          {
            "Code": "654023",
            "Name": "霍城县"
          },
          {
            "Code": "654024",
            "Name": "巩留县"
          },
          {
            "Code": "654025",
            "Name": "新源县"
          },
          {
            "Code": "654026",
            "Name": "昭苏县"
          },
          {
            "Code": "654027",
            "Name": "特克斯县"
          },
          {
            "Code": "654028",
            "Name": "尼勒克县"
          }
        ]
      },
      {
        "Code": "654200",
        "Name": "塔城地区",
        "level": [
          {
            "Code": "654201",
            "Name": "塔城市"
          },
          {
            "Code": "654202",
            "Name": "乌苏市"
          },
          {
            "Code": "654221",
            "Name": "额敏县"
          },
          {
            "Code": "654223",
            "Name": "沙湾县"
          },
          {
            "Code": "654224",
            "Name": "托里县"
          },
          {
            "Code": "654225",
            "Name": "裕民县"
          },
          {
            "Code": "654226",
            "Name": "和布克赛尔蒙古自治县"
          }
        ]
      },
      {
        "Code": "654300",
        "Name": "阿勒泰地区",
        "level": [
          {
            "Code": "654301",
            "Name": "阿勒泰市"
          },
          {
            "Code": "654321",
            "Name": "布尔津县"
          },
          {
            "Code": "654322",
            "Name": "富蕴县"
          },
          {
            "Code": "654323",
            "Name": "福海县"
          },
          {
            "Code": "654324",
            "Name": "哈巴河县"
          },
          {
            "Code": "654325",
            "Name": "青河县"
          },
          {
            "Code": "654326",
            "Name": "吉木乃县"
          }
        ]
      },
      {
        "Code": "659001",
        "Name": "石河子市",
        "level": [
          {
            "Code": "659001001",
            "Name": "新城街道"
          },
          {
            "Code": "659001002",
            "Name": "向阳街道"
          },
          {
            "Code": "659001003",
            "Name": "红山街道"
          },
          {
            "Code": "659001004",
            "Name": "老街街道"
          },
          {
            "Code": "659001005",
            "Name": "东城街道"
          },
          {
            "Code": "659001100",
            "Name": "北泉镇"
          },
          {
            "Code": "659001200",
            "Name": "石河子乡"
          },
          {
            "Code": "659001500",
            "Name": "兵团一五二团"
          }
        ]
      },
      {
        "Code": "659002",
        "Name": "阿拉尔市",
        "level": [
          {
            "Code": "659002001",
            "Name": "金银川路街道"
          },
          {
            "Code": "659002002",
            "Name": "幸福路街道"
          },
          {
            "Code": "659002003",
            "Name": "青松路街道"
          },
          {
            "Code": "659002004",
            "Name": "南口街道"
          },
          {
            "Code": "659002200",
            "Name": "托喀依乡"
          },
          {
            "Code": "659002402",
            "Name": "工业园区"
          },
          {
            "Code": "659002500",
            "Name": "兵团七团"
          },
          {
            "Code": "659002501",
            "Name": "兵团八团"
          },
          {
            "Code": "659002503",
            "Name": "兵团十团"
          },
          {
            "Code": "659002504",
            "Name": "兵团十一团"
          },
          {
            "Code": "659002505",
            "Name": "兵团十二团"
          },
          {
            "Code": "659002506",
            "Name": "兵团十三团"
          },
          {
            "Code": "659002507",
            "Name": "兵团十四团"
          },
          {
            "Code": "659002509",
            "Name": "兵团十六团"
          },
          {
            "Code": "659002511",
            "Name": "兵团第一师水利水电工程处"
          },
          {
            "Code": "659002512",
            "Name": "兵团第一师塔里木灌区水利管理处"
          },
          {
            "Code": "659002513",
            "Name": "阿拉尔农场"
          },
          {
            "Code": "659002514",
            "Name": "兵团第一师幸福农场"
          },
          {
            "Code": "659002515",
            "Name": "中心监狱"
          }
        ]
      },
      {
        "Code": "659003",
        "Name": "图木舒克市",
        "level": [
          {
            "Code": "659003001",
            "Name": "齐干却勒街道"
          },
          {
            "Code": "659003002",
            "Name": "前海街道"
          },
          {
            "Code": "659003003",
            "Name": "永安坝街道"
          },
          {
            "Code": "659003504",
            "Name": "兵团四十四团"
          },
          {
            "Code": "659003509",
            "Name": "兵团四十九团"
          },
          {
            "Code": "659003510",
            "Name": "兵团五十团"
          },
          {
            "Code": "659003511",
            "Name": "兵团五十一团"
          },
          {
            "Code": "659003513",
            "Name": "兵团五十三团"
          },
          {
            "Code": "659003514",
            "Name": "兵团图木舒克市喀拉拜勒镇"
          },
          {
            "Code": "659003515",
            "Name": "兵团图木舒克市永安坝"
          }
        ]
      },
      {
        "Code": "659004",
        "Name": "五家渠市",
        "level": [
          {
            "Code": "659004001",
            "Name": "军垦路街道"
          },
          {
            "Code": "659004002",
            "Name": "青湖路街道"
          },
          {
            "Code": "659004003",
            "Name": "人民路街道"
          },
          {
            "Code": "659004500",
            "Name": "兵团一零一团"
          },
          {
            "Code": "659004501",
            "Name": "兵团一零二团"
          },
          {
            "Code": "659004502",
            "Name": "兵团一零三团"
          }
        ]
      }
    ]
  },
  {
    "Code": "710000",
    "Name": "台湾",
    "level": [
      {
        "Code": "710100",
        "Name": "台北市",
        "level": [
          {
            "Code": "710101",
            "Name": "中正区"
          },
          {
            "Code": "710102",
            "Name": "大同区"
          },
          {
            "Code": "710103",
            "Name": "中山区"
          },
          {
            "Code": "710104",
            "Name": "松山区"
          },
          {
            "Code": "710105",
            "Name": "大安区"
          },
          {
            "Code": "710106",
            "Name": "万华区"
          },
          {
            "Code": "710107",
            "Name": "信义区"
          },
          {
            "Code": "710108",
            "Name": "士林区"
          },
          {
            "Code": "710109",
            "Name": "北投区"
          },
          {
            "Code": "710110",
            "Name": "内湖区"
          },
          {
            "Code": "710111",
            "Name": "南港区"
          },
          {
            "Code": "710112",
            "Name": "文山区"
          }
        ]
      },
      {
        "Code": "710200",
        "Name": "高雄市",
        "level": [
          {
            "Code": "710201",
            "Name": "新兴区"
          },
          {
            "Code": "710202",
            "Name": "前金区"
          },
          {
            "Code": "710203",
            "Name": "芩雅区"
          },
          {
            "Code": "710204",
            "Name": "盐埕区"
          },
          {
            "Code": "710205",
            "Name": "鼓山区"
          },
          {
            "Code": "710206",
            "Name": "旗津区"
          },
          {
            "Code": "710207",
            "Name": "前镇区"
          },
          {
            "Code": "710208",
            "Name": "三民区"
          },
          {
            "Code": "710209",
            "Name": "左营区"
          },
          {
            "Code": "710210",
            "Name": "楠梓区"
          },
          {
            "Code": "710211",
            "Name": "小港区"
          },
          {
            "Code": "710241",
            "Name": "苓雅区"
          },
          {
            "Code": "710242",
            "Name": "仁武区"
          },
          {
            "Code": "710243",
            "Name": "大社区"
          },
          {
            "Code": "710244",
            "Name": "冈山区"
          },
          {
            "Code": "710245",
            "Name": "路竹区"
          },
          {
            "Code": "710246",
            "Name": "阿莲区"
          },
          {
            "Code": "710247",
            "Name": "田寮区"
          },
          {
            "Code": "710248",
            "Name": "燕巢区"
          },
          {
            "Code": "710249",
            "Name": "桥头区"
          },
          {
            "Code": "710250",
            "Name": "梓官区"
          },
          {
            "Code": "710251",
            "Name": "弥陀区"
          },
          {
            "Code": "710252",
            "Name": "永安区"
          },
          {
            "Code": "710253",
            "Name": "湖内区"
          },
          {
            "Code": "710254",
            "Name": "凤山区"
          },
          {
            "Code": "710255",
            "Name": "大寮区"
          },
          {
            "Code": "710256",
            "Name": "林园区"
          },
          {
            "Code": "710257",
            "Name": "鸟松区"
          },
          {
            "Code": "710258",
            "Name": "大树区"
          },
          {
            "Code": "710259",
            "Name": "旗山区"
          },
          {
            "Code": "710260",
            "Name": "美浓区"
          },
          {
            "Code": "710261",
            "Name": "六龟区"
          },
          {
            "Code": "710262",
            "Name": "内门区"
          },
          {
            "Code": "710263",
            "Name": "杉林区"
          },
          {
            "Code": "710264",
            "Name": "甲仙区"
          },
          {
            "Code": "710265",
            "Name": "桃源区"
          },
          {
            "Code": "710266",
            "Name": "那玛夏区"
          },
          {
            "Code": "710267",
            "Name": "茂林区"
          },
          {
            "Code": "710268",
            "Name": "茄萣区"
          }
        ]
      },
      {
        "Code": "710300",
        "Name": "台南市",
        "level": [
          {
            "Code": "710301",
            "Name": "中西区"
          },
          {
            "Code": "710302",
            "Name": "东区"
          },
          {
            "Code": "710303",
            "Name": "南区"
          },
          {
            "Code": "710304",
            "Name": "北区"
          },
          {
            "Code": "710305",
            "Name": "安平区"
          },
          {
            "Code": "710306",
            "Name": "安南区"
          },
          {
            "Code": "710339",
            "Name": "永康区"
          },
          {
            "Code": "710340",
            "Name": "归仁区"
          },
          {
            "Code": "710341",
            "Name": "新化区"
          },
          {
            "Code": "710342",
            "Name": "左镇区"
          },
          {
            "Code": "710343",
            "Name": "玉井区"
          },
          {
            "Code": "710344",
            "Name": "楠西区"
          },
          {
            "Code": "710345",
            "Name": "南化区"
          },
          {
            "Code": "710346",
            "Name": "仁德区"
          },
          {
            "Code": "710347",
            "Name": "关庙区"
          },
          {
            "Code": "710348",
            "Name": "龙崎区"
          },
          {
            "Code": "710349",
            "Name": "官田区"
          },
          {
            "Code": "710350",
            "Name": "麻豆区"
          },
          {
            "Code": "710351",
            "Name": "佳里区"
          },
          {
            "Code": "710352",
            "Name": "西港区"
          },
          {
            "Code": "710353",
            "Name": "七股区"
          },
          {
            "Code": "710354",
            "Name": "将军区"
          },
          {
            "Code": "710355",
            "Name": "学甲区"
          },
          {
            "Code": "710356",
            "Name": "北门区"
          },
          {
            "Code": "710357",
            "Name": "新营区"
          },
          {
            "Code": "710358",
            "Name": "后壁区"
          },
          {
            "Code": "710359",
            "Name": "白河区"
          },
          {
            "Code": "710360",
            "Name": "东山区"
          },
          {
            "Code": "710361",
            "Name": "六甲区"
          },
          {
            "Code": "710362",
            "Name": "下营区"
          },
          {
            "Code": "710363",
            "Name": "柳营区"
          },
          {
            "Code": "710364",
            "Name": "盐水区"
          },
          {
            "Code": "710365",
            "Name": "善化区"
          },
          {
            "Code": "710366",
            "Name": "大内区"
          },
          {
            "Code": "710367",
            "Name": "山上区"
          },
          {
            "Code": "710368",
            "Name": "新市区"
          },
          {
            "Code": "710369",
            "Name": "安定区"
          }
        ]
      },
      {
        "Code": "710400",
        "Name": "台中市",
        "level": [
          {
            "Code": "710401",
            "Name": "中区"
          },
          {
            "Code": "710402",
            "Name": "东区"
          },
          {
            "Code": "710403",
            "Name": "南区"
          },
          {
            "Code": "710404",
            "Name": "西区"
          },
          {
            "Code": "710405",
            "Name": "北区"
          },
          {
            "Code": "710406",
            "Name": "北屯区"
          },
          {
            "Code": "710407",
            "Name": "西屯区"
          },
          {
            "Code": "710408",
            "Name": "南屯区"
          },
          {
            "Code": "710431",
            "Name": "太平区"
          },
          {
            "Code": "710432",
            "Name": "大里区"
          },
          {
            "Code": "710433",
            "Name": "雾峰区"
          },
          {
            "Code": "710434",
            "Name": "乌日区"
          },
          {
            "Code": "710435",
            "Name": "丰原区"
          },
          {
            "Code": "710436",
            "Name": "后里区"
          },
          {
            "Code": "710437",
            "Name": "石冈区"
          },
          {
            "Code": "710438",
            "Name": "东势区"
          },
          {
            "Code": "710439",
            "Name": "和平区"
          },
          {
            "Code": "710440",
            "Name": "新社区"
          },
          {
            "Code": "710441",
            "Name": "潭子区"
          },
          {
            "Code": "710442",
            "Name": "大雅区"
          },
          {
            "Code": "710443",
            "Name": "神冈区"
          },
          {
            "Code": "710444",
            "Name": "大肚区"
          },
          {
            "Code": "710445",
            "Name": "沙鹿区"
          },
          {
            "Code": "710446",
            "Name": "龙井区"
          },
          {
            "Code": "710447",
            "Name": "梧栖区"
          },
          {
            "Code": "710448",
            "Name": "清水区"
          },
          {
            "Code": "710449",
            "Name": "大甲区"
          },
          {
            "Code": "710450",
            "Name": "外埔区"
          },
          {
            "Code": "710451",
            "Name": "大安区"
          }
        ]
      },
      {
        "Code": "710500",
        "Name": "金门县",
        "level": [
          {
            "Code": "710507",
            "Name": "金沙镇"
          },
          {
            "Code": "710508",
            "Name": "金湖镇"
          },
          {
            "Code": "710509",
            "Name": "金宁乡"
          },
          {
            "Code": "710510",
            "Name": "金城镇"
          },
          {
            "Code": "710511",
            "Name": "烈屿乡"
          },
          {
            "Code": "710512",
            "Name": "乌w乡"
          }
        ]
      },
      {
        "Code": "710600",
        "Name": "南投县",
        "level": [
          {
            "Code": "710614",
            "Name": "南投市"
          },
          {
            "Code": "710615",
            "Name": "中寮乡"
          },
          {
            "Code": "710616",
            "Name": "草屯镇"
          },
          {
            "Code": "710617",
            "Name": "国姓乡"
          },
          {
            "Code": "710618",
            "Name": "埔里镇"
          },
          {
            "Code": "710619",
            "Name": "仁爱乡"
          },
          {
            "Code": "710620",
            "Name": "名间乡"
          },
          {
            "Code": "710621",
            "Name": "集集镇"
          },
          {
            "Code": "710622",
            "Name": "水里乡"
          },
          {
            "Code": "710623",
            "Name": "鱼池乡"
          },
          {
            "Code": "710624",
            "Name": "信义乡"
          },
          {
            "Code": "710625",
            "Name": "竹山镇"
          },
          {
            "Code": "710626",
            "Name": "鹿谷乡"
          }
        ]
      },
      {
        "Code": "710700",
        "Name": "基隆市",
        "level": [
          {
            "Code": "710701",
            "Name": "仁爱区"
          },
          {
            "Code": "710702",
            "Name": "信义区"
          },
          {
            "Code": "710703",
            "Name": "中正区"
          },
          {
            "Code": "710704",
            "Name": "中山区"
          },
          {
            "Code": "710705",
            "Name": "安乐区"
          },
          {
            "Code": "710706",
            "Name": "暖暖区"
          },
          {
            "Code": "710707",
            "Name": "七堵区"
          }
        ]
      },
      {
        "Code": "710800",
        "Name": "新竹市",
        "level": [
          {
            "Code": "710801",
            "Name": "东区"
          },
          {
            "Code": "710802",
            "Name": "北区"
          },
          {
            "Code": "710803",
            "Name": "香山区"
          }
        ]
      },
      {
        "Code": "710900",
        "Name": "嘉义市",
        "level": [
          {
            "Code": "710901",
            "Name": "东区"
          },
          {
            "Code": "710902",
            "Name": "西区"
          }
        ]
      },
      {
        "Code": "711100",
        "Name": "新北市",
        "level": [
          {
            "Code": "711130",
            "Name": "万里区"
          },
          {
            "Code": "711131",
            "Name": "金山区"
          },
          {
            "Code": "711132",
            "Name": "板桥区"
          },
          {
            "Code": "711133",
            "Name": "汐止区"
          },
          {
            "Code": "711134",
            "Name": "深坑区"
          },
          {
            "Code": "711135",
            "Name": "石碇区"
          },
          {
            "Code": "711136",
            "Name": "瑞芳区"
          },
          {
            "Code": "711137",
            "Name": "平溪区"
          },
          {
            "Code": "711138",
            "Name": "双溪区"
          },
          {
            "Code": "711139",
            "Name": "贡寮区"
          },
          {
            "Code": "711140",
            "Name": "新店区"
          },
          {
            "Code": "711141",
            "Name": "坪林区"
          },
          {
            "Code": "711142",
            "Name": "乌来区"
          },
          {
            "Code": "711143",
            "Name": "永和区"
          },
          {
            "Code": "711144",
            "Name": "中和区"
          },
          {
            "Code": "711145",
            "Name": "土城区"
          },
          {
            "Code": "711146",
            "Name": "三峡区"
          },
          {
            "Code": "711147",
            "Name": "树林区"
          },
          {
            "Code": "711148",
            "Name": "莺歌区"
          },
          {
            "Code": "711149",
            "Name": "三重区"
          },
          {
            "Code": "711150",
            "Name": "新庄区"
          },
          {
            "Code": "711151",
            "Name": "泰山区"
          },
          {
            "Code": "711152",
            "Name": "林口区"
          },
          {
            "Code": "711153",
            "Name": "芦洲区"
          },
          {
            "Code": "711154",
            "Name": "五股区"
          },
          {
            "Code": "711155",
            "Name": "八里区"
          },
          {
            "Code": "711156",
            "Name": "淡水区"
          },
          {
            "Code": "711157",
            "Name": "三芝区"
          },
          {
            "Code": "711158",
            "Name": "石门区"
          }
        ]
      },
      {
        "Code": "711200",
        "Name": "宜兰县",
        "level": [
          {
            "Code": "711214",
            "Name": "宜兰市"
          },
          {
            "Code": "711215",
            "Name": "头城镇"
          },
          {
            "Code": "711216",
            "Name": "礁溪乡"
          },
          {
            "Code": "711217",
            "Name": "壮围乡"
          },
          {
            "Code": "711218",
            "Name": "员山乡"
          },
          {
            "Code": "711219",
            "Name": "罗东镇"
          },
          {
            "Code": "711220",
            "Name": "三星乡"
          },
          {
            "Code": "711221",
            "Name": "大同乡"
          },
          {
            "Code": "711222",
            "Name": "五结乡"
          },
          {
            "Code": "711223",
            "Name": "冬山乡"
          },
          {
            "Code": "711224",
            "Name": "苏澳镇"
          },
          {
            "Code": "711225",
            "Name": "南澳乡"
          },
          {
            "Code": "711226",
            "Name": "钓鱼台"
          }
        ]
      },
      {
        "Code": "711300",
        "Name": "新竹县",
        "level": [
          {
            "Code": "711314",
            "Name": "竹北市"
          },
          {
            "Code": "711315",
            "Name": "湖口乡"
          },
          {
            "Code": "711316",
            "Name": "新丰乡"
          },
          {
            "Code": "711317",
            "Name": "新埔镇"
          },
          {
            "Code": "711318",
            "Name": "关西镇"
          },
          {
            "Code": "711319",
            "Name": "芎林乡"
          },
          {
            "Code": "711320",
            "Name": "宝山乡"
          },
          {
            "Code": "711321",
            "Name": "竹东镇"
          },
          {
            "Code": "711322",
            "Name": "五峰乡"
          },
          {
            "Code": "711323",
            "Name": "横山乡"
          },
          {
            "Code": "711324",
            "Name": "尖石乡"
          },
          {
            "Code": "711325",
            "Name": "北埔乡"
          },
          {
            "Code": "711326",
            "Name": "峨眉乡"
          }
        ]
      },
      {
        "Code": "711400",
        "Name": "桃园县",
        "level": [
          {
            "Code": "711414",
            "Name": "中坜市"
          },
          {
            "Code": "711415",
            "Name": "平镇市"
          },
          {
            "Code": "711416",
            "Name": "龙潭乡"
          },
          {
            "Code": "711417",
            "Name": "杨梅市"
          },
          {
            "Code": "711418",
            "Name": "新屋乡"
          },
          {
            "Code": "711419",
            "Name": "观音乡"
          },
          {
            "Code": "711420",
            "Name": "桃园市"
          },
          {
            "Code": "711421",
            "Name": "龟山乡"
          },
          {
            "Code": "711422",
            "Name": "八德市"
          },
          {
            "Code": "711423",
            "Name": "大溪镇"
          },
          {
            "Code": "711424",
            "Name": "复兴乡"
          },
          {
            "Code": "711425",
            "Name": "大园乡"
          },
          {
            "Code": "711426",
            "Name": "芦竹乡"
          }
        ]
      },
      {
        "Code": "711500",
        "Name": "苗栗县",
        "level": [
          {
            "Code": "711519",
            "Name": "竹南镇"
          },
          {
            "Code": "711520",
            "Name": "头份镇"
          },
          {
            "Code": "711521",
            "Name": "三湾乡"
          },
          {
            "Code": "711522",
            "Name": "南庄乡"
          },
          {
            "Code": "711523",
            "Name": "狮潭乡"
          },
          {
            "Code": "711524",
            "Name": "后龙镇"
          },
          {
            "Code": "711525",
            "Name": "通霄镇"
          },
          {
            "Code": "711526",
            "Name": "苑里镇"
          },
          {
            "Code": "711527",
            "Name": "苗栗市"
          },
          {
            "Code": "711528",
            "Name": "造桥乡"
          },
          {
            "Code": "711529",
            "Name": "头屋乡"
          },
          {
            "Code": "711530",
            "Name": "公馆乡"
          },
          {
            "Code": "711531",
            "Name": "大湖乡"
          },
          {
            "Code": "711532",
            "Name": "泰安乡"
          },
          {
            "Code": "711533",
            "Name": "铜锣乡"
          },
          {
            "Code": "711534",
            "Name": "三义乡"
          },
          {
            "Code": "711535",
            "Name": "西湖乡"
          },
          {
            "Code": "711536",
            "Name": "卓兰镇"
          }
        ]
      },
      {
        "Code": "711700",
        "Name": "彰化县",
        "level": [
          {
            "Code": "711727",
            "Name": "彰化市"
          },
          {
            "Code": "711728",
            "Name": "芬园乡"
          },
          {
            "Code": "711729",
            "Name": "花坛乡"
          },
          {
            "Code": "711730",
            "Name": "秀水乡"
          },
          {
            "Code": "711731",
            "Name": "鹿港镇"
          },
          {
            "Code": "711732",
            "Name": "福兴乡"
          },
          {
            "Code": "711733",
            "Name": "线西乡"
          },
          {
            "Code": "711734",
            "Name": "和美镇"
          },
          {
            "Code": "711735",
            "Name": "伸港乡"
          },
          {
            "Code": "711736",
            "Name": "员林镇"
          },
          {
            "Code": "711737",
            "Name": "社头乡"
          },
          {
            "Code": "711738",
            "Name": "永靖乡"
          },
          {
            "Code": "711739",
            "Name": "埔心乡"
          },
          {
            "Code": "711740",
            "Name": "溪湖镇"
          },
          {
            "Code": "711741",
            "Name": "大村乡"
          },
          {
            "Code": "711742",
            "Name": "埔盐乡"
          },
          {
            "Code": "711743",
            "Name": "田中镇"
          },
          {
            "Code": "711744",
            "Name": "北斗镇"
          },
          {
            "Code": "711745",
            "Name": "田尾乡"
          },
          {
            "Code": "711746",
            "Name": "埤头乡"
          },
          {
            "Code": "711747",
            "Name": "溪州乡"
          },
          {
            "Code": "711748",
            "Name": "竹塘乡"
          },
          {
            "Code": "711749",
            "Name": "二林镇"
          },
          {
            "Code": "711750",
            "Name": "大城乡"
          },
          {
            "Code": "711751",
            "Name": "芳苑乡"
          },
          {
            "Code": "711752",
            "Name": "二水乡"
          }
        ]
      },
      {
        "Code": "711900",
        "Name": "嘉义县",
        "level": [
          {
            "Code": "711919",
            "Name": "番路乡"
          },
          {
            "Code": "711920",
            "Name": "梅山乡"
          },
          {
            "Code": "711921",
            "Name": "竹崎乡"
          },
          {
            "Code": "711922",
            "Name": "阿里山乡"
          },
          {
            "Code": "711923",
            "Name": "中埔乡"
          },
          {
            "Code": "711924",
            "Name": "大埔乡"
          },
          {
            "Code": "711925",
            "Name": "水上乡"
          },
          {
            "Code": "711926",
            "Name": "鹿草乡"
          },
          {
            "Code": "711927",
            "Name": "太保市"
          },
          {
            "Code": "711928",
            "Name": "朴子市"
          },
          {
            "Code": "711929",
            "Name": "东石乡"
          },
          {
            "Code": "711930",
            "Name": "六脚乡"
          },
          {
            "Code": "711931",
            "Name": "新港乡"
          },
          {
            "Code": "711932",
            "Name": "民雄乡"
          },
          {
            "Code": "711933",
            "Name": "大林镇"
          },
          {
            "Code": "711934",
            "Name": "溪口乡"
          },
          {
            "Code": "711935",
            "Name": "义竹乡"
          },
          {
            "Code": "711936",
            "Name": "布袋镇"
          }
        ]
      },
      {
        "Code": "712100",
        "Name": "云林县",
        "level": [
          {
            "Code": "712121",
            "Name": "斗南镇"
          },
          {
            "Code": "712122",
            "Name": "大埤乡"
          },
          {
            "Code": "712123",
            "Name": "虎尾镇"
          },
          {
            "Code": "712124",
            "Name": "土库镇"
          },
          {
            "Code": "712125",
            "Name": "褒忠乡"
          },
          {
            "Code": "712126",
            "Name": "东势乡"
          },
          {
            "Code": "712127",
            "Name": "台西乡"
          },
          {
            "Code": "712128",
            "Name": "仑背乡"
          },
          {
            "Code": "712129",
            "Name": "麦寮乡"
          },
          {
            "Code": "712130",
            "Name": "斗六市"
          },
          {
            "Code": "712131",
            "Name": "林内乡"
          },
          {
            "Code": "712132",
            "Name": "古坑乡"
          },
          {
            "Code": "712133",
            "Name": "莿桐乡"
          },
          {
            "Code": "712134",
            "Name": "西螺镇"
          },
          {
            "Code": "712135",
            "Name": "二仑乡"
          },
          {
            "Code": "712136",
            "Name": "北港镇"
          },
          {
            "Code": "712137",
            "Name": "水林乡"
          },
          {
            "Code": "712138",
            "Name": "口湖乡"
          },
          {
            "Code": "712139",
            "Name": "四湖乡"
          },
          {
            "Code": "712140",
            "Name": "元长乡"
          }
        ]
      },
      {
        "Code": "712400",
        "Name": "屏东县",
        "level": [
          {
            "Code": "712434",
            "Name": "屏东市"
          },
          {
            "Code": "712435",
            "Name": "三地门乡"
          },
          {
            "Code": "712436",
            "Name": "雾台乡"
          },
          {
            "Code": "712437",
            "Name": "玛家乡"
          },
          {
            "Code": "712438",
            "Name": "九如乡"
          },
          {
            "Code": "712439",
            "Name": "里港乡"
          },
          {
            "Code": "712440",
            "Name": "高树乡"
          },
          {
            "Code": "712441",
            "Name": "盐埔乡"
          },
          {
            "Code": "712442",
            "Name": "长治乡"
          },
          {
            "Code": "712443",
            "Name": "麟洛乡"
          },
          {
            "Code": "712444",
            "Name": "竹田乡"
          },
          {
            "Code": "712445",
            "Name": "内埔乡"
          },
          {
            "Code": "712446",
            "Name": "万丹乡"
          },
          {
            "Code": "712447",
            "Name": "潮州镇"
          },
          {
            "Code": "712448",
            "Name": "泰武乡"
          },
          {
            "Code": "712449",
            "Name": "来义乡"
          },
          {
            "Code": "712450",
            "Name": "万峦乡"
          },
          {
            "Code": "712451",
            "Name": "顶乡"
          },
          {
            "Code": "712452",
            "Name": "新埤乡"
          },
          {
            "Code": "712453",
            "Name": "南州乡"
          },
          {
            "Code": "712454",
            "Name": "林边乡"
          },
          {
            "Code": "712455",
            "Name": "东港镇"
          },
          {
            "Code": "712456",
            "Name": "琉球乡"
          },
          {
            "Code": "712457",
            "Name": "佳冬乡"
          },
          {
            "Code": "712458",
            "Name": "新园乡"
          },
          {
            "Code": "712459",
            "Name": "枋寮乡"
          },
          {
            "Code": "712460",
            "Name": "枋山乡"
          },
          {
            "Code": "712461",
            "Name": "春日乡"
          },
          {
            "Code": "712462",
            "Name": "狮子乡"
          },
          {
            "Code": "712463",
            "Name": "车城乡"
          },
          {
            "Code": "712464",
            "Name": "牡丹乡"
          },
          {
            "Code": "712465",
            "Name": "恒春镇"
          },
          {
            "Code": "712466",
            "Name": "满州乡"
          }
        ]
      },
      {
        "Code": "712500",
        "Name": "台东县",
        "level": [
          {
            "Code": "712517",
            "Name": "台东市"
          },
          {
            "Code": "712518",
            "Name": "绿岛乡"
          },
          {
            "Code": "712519",
            "Name": "兰屿乡"
          },
          {
            "Code": "712520",
            "Name": "延平乡"
          },
          {
            "Code": "712521",
            "Name": "卑南乡"
          },
          {
            "Code": "712522",
            "Name": "鹿野乡"
          },
          {
            "Code": "712523",
            "Name": "关山镇"
          },
          {
            "Code": "712524",
            "Name": "海端乡"
          },
          {
            "Code": "712525",
            "Name": "池上乡"
          },
          {
            "Code": "712526",
            "Name": "东河乡"
          },
          {
            "Code": "712527",
            "Name": "成功镇"
          },
          {
            "Code": "712528",
            "Name": "长滨乡"
          },
          {
            "Code": "712529",
            "Name": "金峰乡"
          },
          {
            "Code": "712530",
            "Name": "大武乡"
          },
          {
            "Code": "712531",
            "Name": "达仁乡"
          },
          {
            "Code": "712532",
            "Name": "太麻里乡"
          }
        ]
      },
      {
        "Code": "712600",
        "Name": "花莲县",
        "level": [
          {
            "Code": "712615",
            "Name": "花莲市"
          },
          {
            "Code": "712616",
            "Name": "新城乡"
          },
          {
            "Code": "712617",
            "Name": "太鲁阁"
          },
          {
            "Code": "712618",
            "Name": "秀林乡"
          },
          {
            "Code": "712619",
            "Name": "吉安乡"
          },
          {
            "Code": "712620",
            "Name": "寿丰乡"
          },
          {
            "Code": "712621",
            "Name": "凤林镇"
          },
          {
            "Code": "712622",
            "Name": "光复乡"
          },
          {
            "Code": "712623",
            "Name": "丰滨乡"
          },
          {
            "Code": "712624",
            "Name": "瑞穗乡"
          },
          {
            "Code": "712625",
            "Name": "万荣乡"
          },
          {
            "Code": "712626",
            "Name": "玉里镇"
          },
          {
            "Code": "712627",
            "Name": "卓溪乡"
          },
          {
            "Code": "712628",
            "Name": "富里乡"
          }
        ]
      },
      {
        "Code": "712700",
        "Name": "澎湖县",
        "level": [
          {
            "Code": "712707",
            "Name": "马公市"
          },
          {
            "Code": "712708",
            "Name": "西屿乡"
          },
          {
            "Code": "712709",
            "Name": "望安乡"
          },
          {
            "Code": "712710",
            "Name": "七美乡"
          },
          {
            "Code": "712711",
            "Name": "白沙乡"
          },
          {
            "Code": "712712",
            "Name": "湖西乡"
          }
        ]
      },
      {
        "Code": "712800",
        "Name": "连江县",
        "level": [
          {
            "Code": "712805",
            "Name": "南竿乡"
          },
          {
            "Code": "712806",
            "Name": "北竿乡"
          },
          {
            "Code": "712807",
            "Name": "莒光乡"
          },
          {
            "Code": "712808",
            "Name": "东引乡"
          }
        ]
      }
    ]
  },
  {
    "Code": "810000",
    "Name": "香港特别行政区",
    "level": [
      {
        "Code": "810100",
        "Name": "香港岛",
        "level": [
          {
            "Code": "810101",
            "Name": "中西区"
          },
          {
            "Code": "810102",
            "Name": "湾仔"
          },
          {
            "Code": "810103",
            "Name": "东区"
          },
          {
            "Code": "810104",
            "Name": "南区"
          }
        ]
      },
      {
        "Code": "810200",
        "Name": "九龙",
        "level": [
          {
            "Code": "810201",
            "Name": "九龙城区"
          },
          {
            "Code": "810202",
            "Name": "油尖旺区"
          },
          {
            "Code": "810203",
            "Name": "深水埗"
          },
          {
            "Code": "810204",
            "Name": "黄大仙区"
          },
          {
            "Code": "810205",
            "Name": "观塘区"
          }
        ]
      },
      {
        "Code": "810300",
        "Name": "新界",
        "level": [
          {
            "Code": "810301",
            "Name": "北区"
          },
          {
            "Code": "810302",
            "Name": "大埔区"
          },
          {
            "Code": "810303",
            "Name": "沙田区"
          },
          {
            "Code": "810304",
            "Name": "西贡区"
          },
          {
            "Code": "810305",
            "Name": "元朗区"
          },
          {
            "Code": "810306",
            "Name": "屯门区"
          },
          {
            "Code": "810307",
            "Name": "荃湾区"
          },
          {
            "Code": "810308",
            "Name": "葵青区"
          },
          {
            "Code": "810309",
            "Name": "离岛区"
          }
        ]
      }
    ]
  },
  {
    "Code": "820000",
    "Name": "澳门特别行政区",
    "level": [
      {
        "Code": "820100",
        "Name": "澳门半岛",
        "level": [{
          "Code": "820101",
          "Name": ""
        }]
      },
      {
        "Code": "820200",
        "Name": "离岛",
        "level": [{
          "Code": "820201",
          "Name": ""
        }]
      }
    ]
  }
]